#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function CM_Btn_Close.CM_Btn_Close_C.BtnStateImg_Set
	 */
	struct UCM_Btn_Close_C_BtnStateImg_Set_Params
	{
	public:
		class UObject*                                             NoBg;                                                    // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject*                                             HaveBg;                                                  // 0x0008(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                                       NoBg_;                                                   // 0x0010(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function CM_Btn_Close.CM_Btn_Close_C.BndEvt__MirButton_0_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature
	 */
	struct UCM_Btn_Close_C_BndEvt__MirButton_0_K2Node_ComponentBoundEvent_18_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CM_Btn_Close.CM_Btn_Close_C.PreConstruct
	 */
	struct UCM_Btn_Close_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function CM_Btn_Close.CM_Btn_Close_C.BndEvt__MirButton_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	 */
	struct UCM_Btn_Close_C_BndEvt__MirButton_0_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CM_Btn_Close.CM_Btn_Close_C.BndEvt__MirButton_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature
	 */
	struct UCM_Btn_Close_C_BndEvt__MirButton_0_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CM_Btn_Close.CM_Btn_Close_C.BndEvt__MirButton_0_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature
	 */
	struct UCM_Btn_Close_C_BndEvt__MirButton_0_K2Node_ComponentBoundEvent_4_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function CM_Btn_Close.CM_Btn_Close_C.OnInitailizeWidget
	 */
	struct UCM_Btn_Close_C_OnInitailizeWidget_Params
	{
	public:
		class FString                                              Parameters;                                              // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function CM_Btn_Close.CM_Btn_Close_C.ExecuteUbergraph_CM_Btn_Close
	 */
	struct UCM_Btn_Close_C_ExecuteUbergraph_CM_Btn_Close_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function CM_Btn_Close.CM_Btn_Close_C.Click__DelegateSignature
	 */
	struct UCM_Btn_Close_C_Click__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
