#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass F_H_WizardAnimBP.F_H_WizardAnimBP_C
	 * Size -> 0x7CF8 (FullSize[0x8278] - InheritedSize[0x0580])
	 */
	class UF_H_WizardAnimBP_C : public UMirAnimInstance
	{
	public:
		struct FPointerToUberGraphFrame                            UberGraphFrame;                                          // 0x0580(0x0008) ZeroConstructor, Transient, DuplicateTransient
		struct FAnimNode_Root                                      AnimGraphNode_Root;                                      // 0x0588(0x0030)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_2;                         // 0x05B8(0x00A0)
		struct FAnimNode_PoseSnapshot                              AnimGraphNode_PoseSnapshot;                              // 0x0658(0x0090)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_134;                      // 0x06E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_133;                      // 0x0710(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_132;                      // 0x0738(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_131;                      // 0x0760(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_130;                      // 0x0788(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_129;                      // 0x07B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_128;                      // 0x07D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_127;                      // 0x0800(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_126;                      // 0x0828(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_125;                      // 0x0850(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_124;                      // 0x0878(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_123;                      // 0x08A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_122;                      // 0x08C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_121;                      // 0x08F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_120;                      // 0x0918(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_119;                      // 0x0940(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_118;                      // 0x0968(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_117;                      // 0x0990(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_116;                      // 0x09B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_115;                      // 0x09E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_114;                      // 0x0A08(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_113;                      // 0x0A30(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_112;                      // 0x0A58(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_111;                      // 0x0A80(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_110;                      // 0x0AA8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_109;                      // 0x0AD0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_108;                      // 0x0AF8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_107;                      // 0x0B20(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_106;                      // 0x0B48(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_105;                      // 0x0B70(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_104;                      // 0x0B98(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_103;                      // 0x0BC0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_102;                      // 0x0BE8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_101;                      // 0x0C10(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_100;                      // 0x0C38(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_99;                       // 0x0C60(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_98;                       // 0x0C88(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_97;                       // 0x0CB0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_96;                       // 0x0CD8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_95;                       // 0x0D00(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_94;                       // 0x0D28(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_93;                       // 0x0D50(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_92;                       // 0x0D78(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_91;                       // 0x0DA0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_90;                       // 0x0DC8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_89;                       // 0x0DF0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_88;                       // 0x0E18(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_87;                       // 0x0E40(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_86;                       // 0x0E68(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_85;                       // 0x0E90(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_84;                       // 0x0EB8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_83;                       // 0x0EE0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_82;                       // 0x0F08(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_81;                       // 0x0F30(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_80;                       // 0x0F58(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_79;                       // 0x0F80(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_78;                       // 0x0FA8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_77;                       // 0x0FD0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_76;                       // 0x0FF8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_75;                       // 0x1020(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_74;                       // 0x1048(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_73;                       // 0x1070(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_72;                       // 0x1098(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_71;                       // 0x10C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_70;                       // 0x10E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_69;                       // 0x1110(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_68;                       // 0x1138(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_67;                       // 0x1160(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_66;                       // 0x1188(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_65;                       // 0x11B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_64;                       // 0x11D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_63;                       // 0x1200(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_62;                       // 0x1228(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_61;                       // 0x1250(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_60;                       // 0x1278(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_59;                       // 0x12A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_58;                       // 0x12C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_57;                       // 0x12F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_56;                       // 0x1318(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_55;                       // 0x1340(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_54;                       // 0x1368(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_53;                       // 0x1390(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_52;                       // 0x13B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_51;                       // 0x13E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_50;                       // 0x1408(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_49;                       // 0x1430(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_48;                       // 0x1458(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_47;                       // 0x1480(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_46;                       // 0x14A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_45;                       // 0x14D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_44;                       // 0x14F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_43;                       // 0x1520(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_42;                       // 0x1548(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_41;                       // 0x1570(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_40;                       // 0x1598(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_39;                       // 0x15C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_38;                       // 0x15E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_37;                       // 0x1610(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_36;                       // 0x1638(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_35;                       // 0x1660(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_34;                       // 0x1688(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_33;                       // 0x16B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_32;                       // 0x16D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_31;                       // 0x1700(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_30;                       // 0x1728(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_29;                       // 0x1750(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_28;                       // 0x1778(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_27;                       // 0x17A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_26;                       // 0x17C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_25;                       // 0x17F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_24;                       // 0x1818(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_23;                       // 0x1840(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_22;                       // 0x1868(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_21;                       // 0x1890(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_20;                       // 0x18B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_19;                       // 0x18E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_18;                       // 0x1908(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_17;                       // 0x1930(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_16;                       // 0x1958(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_15;                       // 0x1980(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_14;                       // 0x19A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_13;                       // 0x19D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_12;                       // 0x19F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_11;                       // 0x1A20(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_10;                       // 0x1A48(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9;                        // 0x1A70(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8;                        // 0x1A98(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_7;                        // 0x1AC0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6;                        // 0x1AE8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_5;                        // 0x1B10(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4;                        // 0x1B38(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_3;                        // 0x1B60(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2;                        // 0x1B88(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult;                          // 0x1BB0(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_105;                        // 0x1BD8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_104;                        // 0x1C58(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_42;                        // 0x1CD8(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_67;                            // 0x1D88(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_103;                        // 0x1DB8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_66;                            // 0x1E38(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_102;                        // 0x1E68(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_101;                        // 0x1EE8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_41;                        // 0x1F68(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_65;                            // 0x2018(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_100;                        // 0x2048(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_99;                         // 0x20C8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_40;                        // 0x2148(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_64;                            // 0x21F8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_98;                         // 0x2228(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_63;                            // 0x22A8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_97;                         // 0x22D8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_39;                        // 0x2358(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_96;                         // 0x2408(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_62;                            // 0x2488(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_95;                         // 0x24B8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_61;                            // 0x2538(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_94;                         // 0x2568(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_93;                         // 0x25E8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_38;                        // 0x2668(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_60;                            // 0x2718(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_92;                         // 0x2748(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_91;                         // 0x27C8(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool;                           // 0x2848(0x00A0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_59;                            // 0x28E8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_90;                         // 0x2918(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_58;                            // 0x2998(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_89;                         // 0x29C8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_57;                            // 0x2A48(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_88;                         // 0x2A78(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_56;                            // 0x2AF8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_87;                         // 0x2B28(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_55;                            // 0x2BA8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_86;                         // 0x2BD8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_54;                            // 0x2C58(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_85;                         // 0x2C88(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_53;                            // 0x2D08(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_84;                         // 0x2D38(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_52;                            // 0x2DB8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_83;                         // 0x2DE8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_51;                            // 0x2E68(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_82;                         // 0x2E98(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_50;                            // 0x2F18(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_81;                         // 0x2F48(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_49;                            // 0x2FC8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_80;                         // 0x2FF8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_48;                            // 0x3078(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_79;                         // 0x30A8(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_78;                         // 0x3128(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_37;                        // 0x31A8(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_47;                            // 0x3258(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_77;                         // 0x3288(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_76;                         // 0x3308(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_36;                        // 0x3388(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_46;                            // 0x3438(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_75;                         // 0x3468(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_45;                            // 0x34E8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_74;                         // 0x3518(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_44;                            // 0x3598(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_73;                         // 0x35C8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_35;                        // 0x3648(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_72;                         // 0x36F8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_43;                            // 0x3778(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_71;                         // 0x37A8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_34;                        // 0x3828(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_70;                         // 0x38D8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_42;                            // 0x3958(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_69;                         // 0x3988(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_33;                        // 0x3A08(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_68;                         // 0x3AB8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_41;                            // 0x3B38(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_67;                         // 0x3B68(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_32;                        // 0x3BE8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_66;                         // 0x3C98(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_40;                            // 0x3D18(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_65;                         // 0x3D48(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_31;                        // 0x3DC8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_64;                         // 0x3E78(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_39;                            // 0x3EF8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_63;                         // 0x3F28(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_30;                        // 0x3FA8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_62;                         // 0x4058(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_38;                            // 0x40D8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_61;                         // 0x4108(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_29;                        // 0x4188(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_60;                         // 0x4238(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_37;                            // 0x42B8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_59;                         // 0x42E8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_28;                        // 0x4368(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_58;                         // 0x4418(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_36;                            // 0x4498(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_57;                         // 0x44C8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_27;                        // 0x4548(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_56;                         // 0x45F8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_35;                            // 0x4678(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_7;                        // 0x46A8(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_6;                        // 0x4790(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_5;                        // 0x4878(0x00E8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_26;                        // 0x4960(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_34;                            // 0x4A10(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_55;                         // 0x4A40(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_25;                        // 0x4AC0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_54;                         // 0x4B70(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_33;                            // 0x4BF0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_53;                         // 0x4C20(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_24;                        // 0x4CA0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_52;                         // 0x4D50(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_32;                            // 0x4DD0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_51;                         // 0x4E00(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_23;                        // 0x4E80(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_50;                         // 0x4F30(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_31;                            // 0x4FB0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_49;                         // 0x4FE0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_22;                        // 0x5060(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_48;                         // 0x5110(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_30;                            // 0x5190(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_47;                         // 0x51C0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_21;                        // 0x5240(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_46;                         // 0x52F0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_29;                            // 0x5370(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_45;                         // 0x53A0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_20;                        // 0x5420(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_44;                         // 0x54D0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_28;                            // 0x5550(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_43;                         // 0x5580(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_19;                        // 0x5600(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_42;                         // 0x56B0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_27;                            // 0x5730(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_41;                         // 0x5760(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_26;                            // 0x57E0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_40;                         // 0x5810(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_18;                        // 0x5890(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_39;                         // 0x5940(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_25;                            // 0x59C0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_38;                         // 0x59F0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_17;                        // 0x5A70(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_37;                         // 0x5B20(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_24;                            // 0x5BA0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_36;                         // 0x5BD0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_23;                            // 0x5C50(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_35;                         // 0x5C80(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_16;                        // 0x5D00(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_34;                         // 0x5DB0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_22;                            // 0x5E30(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_33;                         // 0x5E60(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_15;                        // 0x5EE0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_32;                         // 0x5F90(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_21;                            // 0x6010(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_31;                         // 0x6040(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_20;                            // 0x60C0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_30;                         // 0x60F0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_19;                            // 0x6170(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_29;                         // 0x61A0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_18;                            // 0x6220(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_28;                         // 0x6250(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_17;                            // 0x62D0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_27;                         // 0x6300(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_16;                            // 0x6380(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_26;                         // 0x63B0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_15;                            // 0x6430(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_25;                         // 0x6460(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_24;                         // 0x64E0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_14;                        // 0x6560(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_14;                            // 0x6610(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_23;                         // 0x6640(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_13;                        // 0x66C0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_22;                         // 0x6770(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_13;                            // 0x67F0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_21;                         // 0x6820(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_12;                        // 0x68A0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_20;                         // 0x6950(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_12;                            // 0x69D0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_19;                         // 0x6A00(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_11;                        // 0x6A80(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_18;                         // 0x6B30(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_11;                            // 0x6BB0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_17;                         // 0x6BE0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_10;                        // 0x6C60(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_16;                         // 0x6D10(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_10;                            // 0x6D90(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_15;                         // 0x6DC0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_9;                         // 0x6E40(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_14;                         // 0x6EF0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_9;                             // 0x6F70(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_13;                         // 0x6FA0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_8;                         // 0x7020(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_12;                         // 0x70D0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_8;                             // 0x7150(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_11;                         // 0x7180(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_7;                         // 0x7200(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_10;                         // 0x72B0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_7;                             // 0x7330(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9;                          // 0x7360(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_6;                         // 0x73E0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8;                          // 0x7490(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_6;                             // 0x7510(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_7;                          // 0x7540(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_5;                         // 0x75C0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6;                          // 0x7670(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_5;                             // 0x76F0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_5;                          // 0x7720(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_4;                         // 0x77A0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_4;                          // 0x7850(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_4;                             // 0x78D0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3;                          // 0x7900(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_3;                         // 0x7980(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2;                          // 0x7A30(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_3;                             // 0x7AB0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer;                            // 0x7AE0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_2;                             // 0x7B60(0x0030)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_2;                         // 0x7B90(0x00B0)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_4;                        // 0x7C40(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_3;                        // 0x7D28(0x00E8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum;                           // 0x7E10(0x00B0)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_2;                        // 0x7EC0(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer;                          // 0x7FA8(0x00E8)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend;                               // 0x8090(0x00C8)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult;                               // 0x8158(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine;                              // 0x8188(0x00B0)
		bool                                                       IsFreeze;                                                // 0x8238(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_XH1O[0x7];                                   // 0x8239(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FPoseSnapshot                                       Pose;                                                    // 0x8240(0x0038) Edit, BlueprintVisible, DisableEditOnInstance

	public:
		void AnimGraph(struct FPoseLink* AnimGraph);
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_H_WizardAnimBP_AnimGraphNode_TransitionResult_C086A3F34786F0249A91C8AE42C655E9();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_H_WizardAnimBP_AnimGraphNode_TransitionResult_56B9B3B94D983B11BF04CB81745942C1();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_H_WizardAnimBP_AnimGraphNode_TransitionResult_E0EBF8D746234AE26CD8A6A9D481D37A();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_H_WizardAnimBP_AnimGraphNode_TransitionResult_0E3E8EF6436525745AE0E9A241883F56();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_H_WizardAnimBP_AnimGraphNode_TransitionResult_036F7E794B66AE0378303689EA078365();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_H_WizardAnimBP_AnimGraphNode_TransitionResult_ACE7B3A74CAE2BD15E6E7388F9BA0564();
