#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * AnimBlueprintGeneratedClass F_WizardAnimBP.F_WizardAnimBP_C
	 * Size -> 0x8B48 (FullSize[0x90C8] - InheritedSize[0x0580])
	 */
	class UF_WizardAnimBP_C : public UMirAnimInstance
	{
	public:
		struct FPointerToUberGraphFrame                            UberGraphFrame;                                          // 0x0580(0x0008) ZeroConstructor, Transient, DuplicateTransient
		struct FAnimNode_Root                                      AnimGraphNode_Root;                                      // 0x0588(0x0030)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_133;                      // 0x05B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_132;                      // 0x05E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_131;                      // 0x0608(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_130;                      // 0x0630(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_129;                      // 0x0658(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_128;                      // 0x0680(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_127;                      // 0x06A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_126;                      // 0x06D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_125;                      // 0x06F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_124;                      // 0x0720(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_123;                      // 0x0748(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_122;                      // 0x0770(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_121;                      // 0x0798(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_120;                      // 0x07C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_119;                      // 0x07E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_118;                      // 0x0810(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_117;                      // 0x0838(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_116;                      // 0x0860(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_115;                      // 0x0888(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_114;                      // 0x08B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_113;                      // 0x08D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_112;                      // 0x0900(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_111;                      // 0x0928(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_110;                      // 0x0950(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_109;                      // 0x0978(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_108;                      // 0x09A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_107;                      // 0x09C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_106;                      // 0x09F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_105;                      // 0x0A18(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_104;                      // 0x0A40(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_103;                      // 0x0A68(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_102;                      // 0x0A90(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_101;                      // 0x0AB8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_100;                      // 0x0AE0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_99;                       // 0x0B08(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_98;                       // 0x0B30(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_97;                       // 0x0B58(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_96;                       // 0x0B80(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_95;                       // 0x0BA8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_94;                       // 0x0BD0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_93;                       // 0x0BF8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_92;                       // 0x0C20(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_91;                       // 0x0C48(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_90;                       // 0x0C70(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_89;                       // 0x0C98(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_88;                       // 0x0CC0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_87;                       // 0x0CE8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_86;                       // 0x0D10(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_85;                       // 0x0D38(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_84;                       // 0x0D60(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_83;                       // 0x0D88(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_82;                       // 0x0DB0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_81;                       // 0x0DD8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_80;                       // 0x0E00(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_79;                       // 0x0E28(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_78;                       // 0x0E50(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_77;                       // 0x0E78(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_76;                       // 0x0EA0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_75;                       // 0x0EC8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_74;                       // 0x0EF0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_73;                       // 0x0F18(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_72;                       // 0x0F40(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_71;                       // 0x0F68(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_70;                       // 0x0F90(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_69;                       // 0x0FB8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_68;                       // 0x0FE0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_67;                       // 0x1008(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_66;                       // 0x1030(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_65;                       // 0x1058(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_64;                       // 0x1080(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_63;                       // 0x10A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_62;                       // 0x10D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_61;                       // 0x10F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_60;                       // 0x1120(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_59;                       // 0x1148(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_58;                       // 0x1170(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_57;                       // 0x1198(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_56;                       // 0x11C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_55;                       // 0x11E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_54;                       // 0x1210(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_53;                       // 0x1238(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_52;                       // 0x1260(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_51;                       // 0x1288(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_50;                       // 0x12B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_49;                       // 0x12D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_48;                       // 0x1300(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_47;                       // 0x1328(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_46;                       // 0x1350(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_45;                       // 0x1378(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_44;                       // 0x13A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_43;                       // 0x13C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_42;                       // 0x13F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_41;                       // 0x1418(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_40;                       // 0x1440(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_39;                       // 0x1468(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_38;                       // 0x1490(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_37;                       // 0x14B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_36;                       // 0x14E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_35;                       // 0x1508(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_34;                       // 0x1530(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_33;                       // 0x1558(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_32;                       // 0x1580(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_31;                       // 0x15A8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_30;                       // 0x15D0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_29;                       // 0x15F8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_28;                       // 0x1620(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_27;                       // 0x1648(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_26;                       // 0x1670(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_25;                       // 0x1698(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_24;                       // 0x16C0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_23;                       // 0x16E8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_22;                       // 0x1710(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_21;                       // 0x1738(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_20;                       // 0x1760(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_19;                       // 0x1788(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_18;                       // 0x17B0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_17;                       // 0x17D8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_16;                       // 0x1800(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_15;                       // 0x1828(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_14;                       // 0x1850(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_13;                       // 0x1878(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_12;                       // 0x18A0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_11;                       // 0x18C8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_10;                       // 0x18F0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_9;                        // 0x1918(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_8;                        // 0x1940(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_7;                        // 0x1968(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_6;                        // 0x1990(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_5;                        // 0x19B8(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_4;                        // 0x19E0(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_3;                        // 0x1A08(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult_2;                        // 0x1A30(0x0028)
		struct FAnimNode_TransitionResult                          AnimGraphNode_TransitionResult;                          // 0x1A58(0x0028)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_105;                        // 0x1A80(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_104;                        // 0x1B00(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_43;                        // 0x1B80(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_66;                            // 0x1C30(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_103;                        // 0x1C60(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_102;                        // 0x1CE0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_42;                        // 0x1D60(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_65;                            // 0x1E10(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_101;                        // 0x1E40(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_100;                        // 0x1EC0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_41;                        // 0x1F40(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_64;                            // 0x1FF0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_99;                         // 0x2020(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_63;                            // 0x20A0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_98;                         // 0x20D0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_40;                        // 0x2150(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_97;                         // 0x2200(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_62;                            // 0x2280(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_96;                         // 0x22B0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_61;                            // 0x2330(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_95;                         // 0x2360(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_94;                         // 0x23E0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_39;                        // 0x2460(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_60;                            // 0x2510(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_93;                         // 0x2540(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_92;                         // 0x25C0(0x0080)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool_2;                         // 0x2640(0x00A0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_59;                            // 0x26E0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_91;                         // 0x2710(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_58;                            // 0x2790(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_90;                         // 0x27C0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_57;                            // 0x2840(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_89;                         // 0x2870(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_56;                            // 0x28F0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_88;                         // 0x2920(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_55;                            // 0x29A0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_87;                         // 0x29D0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_54;                            // 0x2A50(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_86;                         // 0x2A80(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_53;                            // 0x2B00(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_85;                         // 0x2B30(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_52;                            // 0x2BB0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_84;                         // 0x2BE0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_51;                            // 0x2C60(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_83;                         // 0x2C90(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_50;                            // 0x2D10(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_82;                         // 0x2D40(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_49;                            // 0x2DC0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_81;                         // 0x2DF0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_48;                            // 0x2E70(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_80;                         // 0x2EA0(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_79;                         // 0x2F20(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_38;                        // 0x2FA0(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_47;                            // 0x3050(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_78;                         // 0x3080(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_77;                         // 0x3100(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_37;                        // 0x3180(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_46;                            // 0x3230(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_76;                         // 0x3260(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_36;                        // 0x32E0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_75;                         // 0x3390(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_45;                            // 0x3410(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_74;                         // 0x3440(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_44;                            // 0x34C0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_73;                         // 0x34F0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_35;                        // 0x3570(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_72;                         // 0x3620(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_43;                            // 0x36A0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_71;                         // 0x36D0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_34;                        // 0x3750(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_70;                         // 0x3800(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_42;                            // 0x3880(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_69;                         // 0x38B0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_33;                        // 0x3930(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_68;                         // 0x39E0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_41;                            // 0x3A60(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_67;                         // 0x3A90(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_32;                        // 0x3B10(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_66;                         // 0x3BC0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_40;                            // 0x3C40(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_65;                         // 0x3C70(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_31;                        // 0x3CF0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_64;                         // 0x3DA0(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_39;                            // 0x3E20(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_63;                         // 0x3E50(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_30;                        // 0x3ED0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_62;                         // 0x3F80(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_38;                            // 0x4000(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_61;                         // 0x4030(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_29;                        // 0x40B0(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_60;                         // 0x4160(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_37;                            // 0x41E0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_59;                         // 0x4210(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_28;                        // 0x4290(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_58;                         // 0x4340(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_36;                            // 0x43C0(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_57;                         // 0x43F0(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_27;                        // 0x4470(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_56;                         // 0x4520(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_35;                            // 0x45A0(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_7;                        // 0x45D0(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_6;                        // 0x46B8(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_5;                        // 0x47A0(0x00E8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_26;                        // 0x4888(0x00B0)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_34;                            // 0x4938(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_55;                         // 0x4968(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_25;                        // 0x49E8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_54;                         // 0x4A98(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_33;                            // 0x4B18(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_53;                         // 0x4B48(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_24;                        // 0x4BC8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_52;                         // 0x4C78(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_32;                            // 0x4CF8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_51;                         // 0x4D28(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_23;                        // 0x4DA8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_50;                         // 0x4E58(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_31;                            // 0x4ED8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_49;                         // 0x4F08(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_22;                        // 0x4F88(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_48;                         // 0x5038(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_30;                            // 0x50B8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_47;                         // 0x50E8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_21;                        // 0x5168(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_46;                         // 0x5218(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_29;                            // 0x5298(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_45;                         // 0x52C8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_20;                        // 0x5348(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_44;                         // 0x53F8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_28;                            // 0x5478(0x0030)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_19;                        // 0x54A8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_43;                         // 0x5558(0x0080)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_42;                         // 0x55D8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_27;                            // 0x5658(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_41;                         // 0x5688(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_26;                            // 0x5708(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_40;                         // 0x5738(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_18;                        // 0x57B8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_39;                         // 0x5868(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_25;                            // 0x58E8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_38;                         // 0x5918(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_17;                        // 0x5998(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_37;                         // 0x5A48(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_24;                            // 0x5AC8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_36;                         // 0x5AF8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_23;                            // 0x5B78(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_35;                         // 0x5BA8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_16;                        // 0x5C28(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_34;                         // 0x5CD8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_22;                            // 0x5D58(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_33;                         // 0x5D88(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_15;                        // 0x5E08(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_32;                         // 0x5EB8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_21;                            // 0x5F38(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_31;                         // 0x5F68(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_20;                            // 0x5FE8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_30;                         // 0x6018(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_19;                            // 0x6098(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_29;                         // 0x60C8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_18;                            // 0x6148(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_28;                         // 0x6178(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_17;                            // 0x61F8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_27;                         // 0x6228(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_16;                            // 0x62A8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_26;                         // 0x62D8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_15;                            // 0x6358(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_25;                         // 0x6388(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_14;                        // 0x6408(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_24;                         // 0x64B8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_14;                            // 0x6538(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_23;                         // 0x6568(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_13;                        // 0x65E8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_22;                         // 0x6698(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_13;                            // 0x6718(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_21;                         // 0x6748(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_12;                        // 0x67C8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_20;                         // 0x6878(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_12;                            // 0x68F8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_19;                         // 0x6928(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_11;                        // 0x69A8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_18;                         // 0x6A58(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_11;                            // 0x6AD8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_17;                         // 0x6B08(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_10;                        // 0x6B88(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_16;                         // 0x6C38(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_10;                            // 0x6CB8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_15;                         // 0x6CE8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_9;                         // 0x6D68(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_14;                         // 0x6E18(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_9;                             // 0x6E98(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_13;                         // 0x6EC8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_8;                         // 0x6F48(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_12;                         // 0x6FF8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_8;                             // 0x7078(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_11;                         // 0x70A8(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_7;                         // 0x7128(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_10;                         // 0x71D8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_7;                             // 0x7258(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_9;                          // 0x7288(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_6;                         // 0x7308(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_8;                          // 0x73B8(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_6;                             // 0x7438(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_7;                          // 0x7468(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_5;                         // 0x74E8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_6;                          // 0x7598(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_5;                             // 0x7618(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_5;                          // 0x7648(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_4;                         // 0x76C8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_4;                          // 0x7778(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_4;                             // 0x77F8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_3;                          // 0x7828(0x0080)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_3;                         // 0x78A8(0x00B0)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer_2;                          // 0x7958(0x0080)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_3;                             // 0x79D8(0x0030)
		struct FAnimNode_SequencePlayer                            AnimGraphNode_SequencePlayer;                            // 0x7A08(0x0080)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_3;                   // 0x7A88(0x0020)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_3;                   // 0x7AA8(0x0020)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_3;                              // 0x7AC8(0x0108)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult_2;                             // 0x7BD0(0x0030)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_4;                        // 0x7C00(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_3;                        // 0x7CE8(0x00E8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum_2;                         // 0x7DD0(0x00B0)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer_2;                        // 0x7E80(0x00E8)
		struct FAnimNode_BlendSpacePlayer                          AnimGraphNode_BlendSpacePlayer;                          // 0x7F68(0x00E8)
		struct FAnimNode_BlendListByEnum                           AnimGraphNode_BlendListByEnum;                           // 0x8050(0x00B0)
		struct FAnimNode_TwoWayBlend                               AnimGraphNode_TwoWayBlend;                               // 0x8100(0x00C8)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace_2;                   // 0x81C8(0x0020)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace_2;                   // 0x81E8(0x0020)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone_2;                              // 0x8208(0x0108)
		struct FAnimNode_StateResult                               AnimGraphNode_StateResult;                               // 0x8310(0x0030)
		struct FAnimNode_StateMachine                              AnimGraphNode_StateMachine;                              // 0x8340(0x00B0)
		struct FAnimNode_BlendListByBool                           AnimGraphNode_BlendListByBool;                           // 0x83F0(0x00A0)
		struct FAnimNode_PoseSnapshot                              AnimGraphNode_PoseSnapshot;                              // 0x8490(0x0090)
		struct FAnimNode_ModifyBone                                AnimGraphNode_ModifyBone;                                // 0x8520(0x0108)
		struct FAnimNode_ConvertLocalToComponentSpace              AnimGraphNode_LocalToComponentSpace;                     // 0x8628(0x0020)
		struct FAnimNode_ConvertComponentToLocalSpace              AnimGraphNode_ComponentToLocalSpace;                     // 0x8648(0x0020)
		unsigned char                                              UnknownData_RPAR[0x8];                                   // 0x8668(0x0008) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FAnimNode_TwoBoneIK                                 AnimGraphNode_TwoBoneIK_2;                               // 0x8670(0x01E0)
		struct FAnimNode_TwoBoneIK                                 AnimGraphNode_TwoBoneIK;                                 // 0x8850(0x01E0)
		struct FAnimNode_Fabrik                                    AnimGraphNode_Fabrik_4;                                  // 0x8A30(0x0190)
		struct FAnimNode_Fabrik                                    AnimGraphNode_Fabrik_3;                                  // 0x8BC0(0x0190)
		struct FAnimNode_Fabrik                                    AnimGraphNode_Fabrik_2;                                  // 0x8D50(0x0190)
		struct FAnimNode_Fabrik                                    AnimGraphNode_Fabrik;                                    // 0x8EE0(0x0190)
		bool                                                       IsFreeze;                                                // 0x9070(0x0001) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor
		unsigned char                                              UnknownData_FDJ8[0x7];                                   // 0x9071(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FPoseSnapshot                                       Pose;                                                    // 0x9078(0x0038) Edit, BlueprintVisible, DisableEditOnInstance
		struct FVector                                             JointTargetLeft;                                         // 0x90B0(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash
		struct FVector                                             JointTargetRight;                                        // 0x90BC(0x000C) Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash

	public:
		void SetCharacter(const struct FPoseSnapshot& Pose, bool IsFreeze, bool* success);
		void AnimGraph(struct FPoseLink* AnimGraph);
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_WizardAnimBP_AnimGraphNode_TransitionResult_63F35B0A464626C1CEB1AFAC9EAD37F5();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_WizardAnimBP_AnimGraphNode_TransitionResult_058F845A4C1D963EF4B0EFA5E47FDB73();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_WizardAnimBP_AnimGraphNode_TransitionResult_9282826A43290D0155B0A383E7BCBEAB();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_WizardAnimBP_AnimGraphNode_TransitionResult_63FA5EBE40DE9E860A1CA485D6EAAFA5();
		void EvaluateGraphExposedInputs_ExecuteUbergraph_F_WizardAnimBP_AnimGraphNode_TransitionResult_45254DEA45F1EEA45509D6B94666C041();
