#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Ginkgo_villageMaster.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_3
	 */
	struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_3_Params
	{
	public:
		class ACutSceneDialogManager_BP_C*                         Cut_Scene_Dialog_Manager_BP;                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Ginkgo_villageMaster.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_2
	 */
	struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_2_Params
	{
	public:
		class ACutSceneDialogManager_BP_C*                         Cut_Scene_Dialog_Manager_BP;                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Ginkgo_villageMaster.SequenceDirector_C.SequenceEvent__ENTRYPOINTSequenceDirector_1
	 */
	struct USequenceDirector_C_SequenceEvent__ENTRYPOINTSequenceDirector_1_Params
	{
	public:
		class ACutSceneDialogManager_BP_C*                         Cut_Scene_Dialog_Manager_BP;                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Ginkgo_villageMaster.SequenceDirector_C.SequenceEvent_1
	 */
	struct USequenceDirector_C_SequenceEvent_1_Params
	{	};

	/**
	 * Function Ginkgo_villageMaster.SequenceDirector_C.Cut_Scene_Dialog_Manager_BP_Event_1
	 */
	struct USequenceDirector_C_Cut_Scene_Dialog_Manager_BP_Event_1_Params
	{
	public:
		class ACutSceneDialogManager_BP_C*                         Cut_Scene_Dialog_Manager_BP;                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    TalkerNameID;                                            // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    DialogID;                                                // 0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Ginkgo_villageMaster.SequenceDirector_C.Cut_Scene_Dialog_Manager_BP_Event_2
	 */
	struct USequenceDirector_C_Cut_Scene_Dialog_Manager_BP_Event_2_Params
	{
	public:
		class ACutSceneDialogManager_BP_C*                         Cut_Scene_Dialog_Manager_BP;                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    TalkerNameID;                                            // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    DialogID;                                                // 0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Ginkgo_villageMaster.SequenceDirector_C.Cut_Scene_Dialog_Manager_BP_Event_3
	 */
	struct USequenceDirector_C_Cut_Scene_Dialog_Manager_BP_Event_3_Params
	{
	public:
		class ACutSceneDialogManager_BP_C*                         Cut_Scene_Dialog_Manager_BP;                             // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    TalkerNameID;                                            // 0x0008(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    DialogID;                                                // 0x000C(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Ginkgo_villageMaster.SequenceDirector_C.ExecuteUbergraph_SequenceDirector
	 */
	struct USequenceDirector_C_ExecuteUbergraph_SequenceDirector_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
