#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function HUD_BuffBox_Pop.HUD_BuffBox_Pop_C.BndEvt__HUD_BuffBox_Pop_K2Node_ComponentBoundEvent_0_PopClose__DelegateSignature
	 */
	struct UHUD_BuffBox_Pop_C_BndEvt__HUD_BuffBox_Pop_K2Node_ComponentBoundEvent_0_PopClose__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_BuffBox_Pop.HUD_BuffBox_Pop_C.OnPreSet
	 */
	struct UHUD_BuffBox_Pop_C_OnPreSet_Params
	{	};

	/**
	 * Function HUD_BuffBox_Pop.HUD_BuffBox_Pop_C.BndEvt__Buff_tab_btn_K2Node_ComponentBoundEvent_1_OnTabStateChanged__DelegateSignature
	 */
	struct UHUD_BuffBox_Pop_C_BndEvt__Buff_tab_btn_K2Node_ComponentBoundEvent_1_OnTabStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_BuffBox_Pop.HUD_BuffBox_Pop_C.BndEvt__DeBuff_tab_btn_K2Node_ComponentBoundEvent_2_OnTabStateChanged__DelegateSignature
	 */
	struct UHUD_BuffBox_Pop_C_BndEvt__DeBuff_tab_btn_K2Node_ComponentBoundEvent_2_OnTabStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_BuffBox_Pop.HUD_BuffBox_Pop_C.BndEvt__Passive_tab_btn_K2Node_ComponentBoundEvent_3_OnTabStateChanged__DelegateSignature
	 */
	struct UHUD_BuffBox_Pop_C_BndEvt__Passive_tab_btn_K2Node_ComponentBoundEvent_3_OnTabStateChanged__DelegateSignature_Params
	{
	public:
		bool                                                       bIsChecked;                                              // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_BuffBox_Pop.HUD_BuffBox_Pop_C.OnSetActive
	 */
	struct UHUD_BuffBox_Pop_C_OnSetActive_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_BuffBox_Pop.HUD_BuffBox_Pop_C.ExecuteUbergraph_HUD_BuffBox_Pop
	 */
	struct UHUD_BuffBox_Pop_C_ExecuteUbergraph_HUD_BuffBox_Pop_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_BuffBox_Pop.HUD_BuffBox_Pop_C.CLoseDispather__DelegateSignature
	 */
	struct UHUD_BuffBox_Pop_C_CLoseDispather__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_BuffBox_Pop.HUD_BuffBox_Pop_C.NewEventDispatcher_0__DelegateSignature
	 */
	struct UHUD_BuffBox_Pop_C_NewEventDispatcher_0__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
