#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.Btn_Bg_State_Function
	 */
	struct UHud_Bg_MenuBtn_C_Btn_Bg_State_Function_Params
	{
	public:
		class UObject*                                             Image;                                                   // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.PreConstruct
	 */
	struct UHud_Bg_MenuBtn_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.BndEvt__Second_Menu_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UHud_Bg_MenuBtn_C_BndEvt__Second_Menu_Button_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.OnChangeCflag
	 */
	struct UHud_Bg_MenuBtn_C_OnChangeCflag_Params
	{
	public:
		struct FCFlagValues                                        CFlagValues;                                             // 0x0000(0x0020)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.OnInitailizeWidget
	 */
	struct UHud_Bg_MenuBtn_C_OnInitailizeWidget_Params
	{
	public:
		class FString                                              Parameters;                                              // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.OnReceivePrefabMessage
	 */
	struct UHud_Bg_MenuBtn_C_OnReceivePrefabMessage_Params
	{
	public:
		class FName                                                PrefabMessage;                                           // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FString                                              PrefabParameters;                                        // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.BndEvt__Over_Button_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature
	 */
	struct UHud_Bg_MenuBtn_C_BndEvt__Over_Button_K2Node_ComponentBoundEvent_7_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.BndEvt__Over_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature
	 */
	struct UHud_Bg_MenuBtn_C_BndEvt__Over_Button_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.BndEvt__Second_Menu_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature
	 */
	struct UHud_Bg_MenuBtn_C_BndEvt__Second_Menu_Button_K2Node_ComponentBoundEvent_3_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.BndEvt__Second_Menu_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature
	 */
	struct UHud_Bg_MenuBtn_C_BndEvt__Second_Menu_Button_K2Node_ComponentBoundEvent_4_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.BndEvt__Over_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
	 */
	struct UHud_Bg_MenuBtn_C_BndEvt__Over_Button_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.BndEvt__Second_Menu_Button_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature
	 */
	struct UHud_Bg_MenuBtn_C_BndEvt__Second_Menu_Button_K2Node_ComponentBoundEvent_6_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.BndEvt__Over_Button_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature
	 */
	struct UHud_Bg_MenuBtn_C_BndEvt__Over_Button_K2Node_ComponentBoundEvent_8_OnButtonPressedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.OnSetSystemOpen
	 */
	struct UHud_Bg_MenuBtn_C_OnSetSystemOpen_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.ExecuteUbergraph_Hud_Bg_MenuBtn
	 */
	struct UHud_Bg_MenuBtn_C_ExecuteUbergraph_Hud_Bg_MenuBtn_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Hud_Bg_MenuBtn.Hud_Bg_MenuBtn_C.MenuBtn_Click__DelegateSignature
	 */
	struct UHud_Bg_MenuBtn_C_MenuBtn_Click__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
