#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function HUD_Item_Quick_Slot_Elem.HUD_Item_Quick_Slot_Elem_C.SequenceEvent__ENTRYPOINTHUD_Item_Quick_Slot_Elem_2
	 */
	struct UHUD_Item_Quick_Slot_Elem_C_SequenceEvent__ENTRYPOINTHUD_Item_Quick_Slot_Elem_2_Params
	{
	public:
		class UHorizontalBox*                                      HUD_Item_Quick_Slot_Elem_hor;                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Item_Quick_Slot_Elem.HUD_Item_Quick_Slot_Elem_C.SequenceEvent__ENTRYPOINTHUD_Item_Quick_Slot_Elem_1
	 */
	struct UHUD_Item_Quick_Slot_Elem_C_SequenceEvent__ENTRYPOINTHUD_Item_Quick_Slot_Elem_1_Params
	{
	public:
		class UHorizontalBox*                                      HUD_Item_Quick_Slot_Elem_hor;                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Item_Quick_Slot_Elem.HUD_Item_Quick_Slot_Elem_C.Shake_Ani_Function
	 */
	struct UHUD_Item_Quick_Slot_Elem_C_Shake_Ani_Function_Params
	{
	public:
		bool                                                       isRight;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_Item_Quick_Slot_Elem.HUD_Item_Quick_Slot_Elem_C.In_Out_Ani_Function
	 */
	struct UHUD_Item_Quick_Slot_Elem_C_In_Out_Ani_Function_Params
	{
	public:
		bool                                                       isRight;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_Item_Quick_Slot_Elem.HUD_Item_Quick_Slot_Elem_C.HUD_Item_Quick_Slot_Ani_PivotPoint
	 */
	struct UHUD_Item_Quick_Slot_Elem_C_HUD_Item_Quick_Slot_Ani_PivotPoint_Params
	{
	public:
		class UHorizontalBox*                                      HUD_Item_Quick_Slot_Elem_hor;                            // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Item_Quick_Slot_Elem.HUD_Item_Quick_Slot_Elem_C.ExecuteUbergraph_HUD_Item_Quick_Slot_Elem
	 */
	struct UHUD_Item_Quick_Slot_Elem_C_ExecuteUbergraph_HUD_Item_Quick_Slot_Elem_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Item_Quick_Slot_Elem.HUD_Item_Quick_Slot_Elem_C.SlotAnimFinish__DelegateSignature
	 */
	struct UHUD_Item_Quick_Slot_Elem_C_SlotAnimFinish__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Item_Quick_Slot_Elem.HUD_Item_Quick_Slot_Elem_C.SlotAnimPivot__DelegateSignature
	 */
	struct UHUD_Item_Quick_Slot_Elem_C_SlotAnimPivot__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
