#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.HidePopup
	 */
	struct UHUD_WarningAlarm_C_HidePopup_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.OnSetInventorySpace
	 */
	struct UHUD_WarningAlarm_C_OnSetInventorySpace_Params
	{
	public:
		int32_t                                                    curr;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32_t                                                    Size;                                                    // 0x0004(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__Buy_btn_K2Node_ComponentBoundEvent_4_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__Buy_btn_K2Node_ComponentBoundEvent_4_ClickDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__Info_btn_K2Node_ComponentBoundEvent_8_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__Info_btn_K2Node_ComponentBoundEvent_8_ClickDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__Move_btn_K2Node_ComponentBoundEvent_9_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__Move_btn_K2Node_ComponentBoundEvent_9_ClickDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.OnInitailizeWidget
	 */
	struct UHUD_WarningAlarm_C_OnInitailizeWidget_Params
	{
	public:
		class FString                                              Parameters;                                              // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.OnSetAlarmVisibility
	 */
	struct UHUD_WarningAlarm_C_OnSetAlarmVisibility_Params
	{
	public:
		bool                                                       isAlram;                                                 // 0x0000(0x0001)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__Equip_Durability_Refair_btn_K2Node_ComponentBoundEvent_2_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__Equip_Durability_Refair_btn_K2Node_ComponentBoundEvent_2_ClickDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.PreConstruct
	 */
	struct UHUD_WarningAlarm_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__CM_BlackBg_K2Node_ComponentBoundEvent_6_CloseBtn_Event__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__CM_BlackBg_K2Node_ComponentBoundEvent_6_CloseBtn_Event__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.OnWarningOrder
	 */
	struct UHUD_WarningAlarm_C_OnWarningOrder_Params
	{
	public:
		int32_t                                                    Idx;                                                     // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		ESlateVisibility                                           eVisible;                                                // 0x0004(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__HUD_WarningAlarm_Exp_Restore_btn_K2Node_ComponentBoundEvent_5_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__HUD_WarningAlarm_Exp_Restore_btn_K2Node_ComponentBoundEvent_5_ClickDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.ResourceRegistration
	 */
	struct UHUD_WarningAlarm_C_ResourceRegistration_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__HUD_WarningAlarm_CM_Btn_Close_K2Node_ComponentBoundEvent_1_Click__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__HUD_WarningAlarm_CM_Btn_Close_K2Node_ComponentBoundEvent_1_Click__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__HUD_WarningAlarm_Inven_Warning_btn_K2Node_ComponentBoundEvent_7_ClickDipatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__HUD_WarningAlarm_Inven_Warning_btn_K2Node_ComponentBoundEvent_7_ClickDipatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__HUD_WarningAlarm_Weight_Warning_btn_K2Node_ComponentBoundEvent_10_ClickDipatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__HUD_WarningAlarm_Weight_Warning_btn_K2Node_ComponentBoundEvent_10_ClickDipatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__HUD_WarningAlarm_Reputation_Warning_btn_K2Node_ComponentBoundEvent_11_ClickDipatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__HUD_WarningAlarm_Reputation_Warning_btn_K2Node_ComponentBoundEvent_11_ClickDipatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__HUD_WarningAlarm_Armor_Warning_btn_K2Node_ComponentBoundEvent_12_ClickDipatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__HUD_WarningAlarm_Armor_Warning_btn_K2Node_ComponentBoundEvent_12_ClickDipatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__HUD_WarningAlarm_Exp_Warning_btn_K2Node_ComponentBoundEvent_13_ClickDipatcher__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__HUD_WarningAlarm_Exp_Warning_btn_K2Node_ComponentBoundEvent_13_ClickDipatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.BndEvt__Btn_Coution_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	 */
	struct UHUD_WarningAlarm_C_BndEvt__Btn_Coution_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_WarningAlarm.HUD_WarningAlarm_C.ExecuteUbergraph_HUD_WarningAlarm
	 */
	struct UHUD_WarningAlarm_C_ExecuteUbergraph_HUD_WarningAlarm_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
