#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.SequenceEvent__ENTRYPOINTHUD_Skill_Quick_Slot_Elem_2
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_SequenceEvent__ENTRYPOINTHUD_Skill_Quick_Slot_Elem_2_Params
	{
	public:
		class UHorizontalBox*                                      HUD_Skill_Quick_Slot_Elem_hor;                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.SequenceEvent__ENTRYPOINTHUD_Skill_Quick_Slot_Elem_1
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_SequenceEvent__ENTRYPOINTHUD_Skill_Quick_Slot_Elem_1_Params
	{
	public:
		class UHorizontalBox*                                      HUD_Skill_Quick_Slot_Elem_hor;                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.Skill_Shake_ani
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_Skill_Shake_ani_Params
	{
	public:
		bool                                                       isRight;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.Skill_InOut_ani
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_Skill_InOut_ani_Params
	{
	public:
		bool                                                       IsOut;                                                   // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.HUD_Skill_Quick_Slot_Anim_Pivot
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_HUD_Skill_Quick_Slot_Anim_Pivot_Params
	{
	public:
		class UHorizontalBox*                                      HUD_Skill_Quick_Slot_Elem_hor;                           // 0x0000(0x0008)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.BndEvt__Hud_SkillBtn_Elem_01_K2Node_ComponentBoundEvent_0_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_BndEvt__Hud_SkillBtn_Elem_01_K2Node_ComponentBoundEvent_0_ClickDispatcher__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.BndEvt__Hud_SkillBtn_Elem_02_K2Node_ComponentBoundEvent_1_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_BndEvt__Hud_SkillBtn_Elem_02_K2Node_ComponentBoundEvent_1_ClickDispatcher__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.BndEvt__Hud_SkillBtn_Elem_03_K2Node_ComponentBoundEvent_2_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_BndEvt__Hud_SkillBtn_Elem_03_K2Node_ComponentBoundEvent_2_ClickDispatcher__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.BndEvt__Hud_SkillBtn_Elem_04_K2Node_ComponentBoundEvent_3_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_BndEvt__Hud_SkillBtn_Elem_04_K2Node_ComponentBoundEvent_3_ClickDispatcher__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.BndEvt__Hud_SkillBtn_Elem_05_K2Node_ComponentBoundEvent_4_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_BndEvt__Hud_SkillBtn_Elem_05_K2Node_ComponentBoundEvent_4_ClickDispatcher__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.BndEvt__Hud_SkillBtn_Elem_06_K2Node_ComponentBoundEvent_5_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_BndEvt__Hud_SkillBtn_Elem_06_K2Node_ComponentBoundEvent_5_ClickDispatcher__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.WidgetAnimationEvt_Left_2_Right_ani_K2Node_WidgetAnimationEvent_1
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_WidgetAnimationEvt_Left_2_Right_ani_K2Node_WidgetAnimationEvent_1_Params
	{	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.WidgetAnimationEvt_Right_2_Left_ani_K2Node_WidgetAnimationEvent_2
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_WidgetAnimationEvt_Right_2_Left_ani_K2Node_WidgetAnimationEvent_2_Params
	{	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.ExecuteUbergraph_HUD_Skill_Quick_Slot_Elem
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_ExecuteUbergraph_HUD_Skill_Quick_Slot_Elem_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.OnFinishSwipeAnim__DelegateSignature
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_OnFinishSwipeAnim__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.OnSwipeAnimPivot__DelegateSignature
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_OnSwipeAnimPivot__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Skill_Quick_Slot_Elem.HUD_Skill_Quick_Slot_Elem_C.ClickDispatcher__DelegateSignature
	 */
	struct UHUD_Skill_Quick_Slot_Elem_C_ClickDispatcher__DelegateSignature_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
