#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Hud_PartyBox_New.Hud_PartyBox_New_C.BndEvt__Hud_PartyBox_New_CallMember_btn_K2Node_ComponentBoundEvent_1_ClickDispatcher__DelegateSignature
	 */
	struct UHud_PartyBox_New_C_BndEvt__Hud_PartyBox_New_CallMember_btn_K2Node_ComponentBoundEvent_1_ClickDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_PartyBox_New.Hud_PartyBox_New_C.BndEvt__Hud_PartyBox_New_MOve_Owner_btn_K2Node_ComponentBoundEvent_2_ClickDispatcher__DelegateSignature
	 */
	struct UHud_PartyBox_New_C_BndEvt__Hud_PartyBox_New_MOve_Owner_btn_K2Node_ComponentBoundEvent_2_ClickDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_PartyBox_New.Hud_PartyBox_New_C.PreConstruct
	 */
	struct UHud_PartyBox_New_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Hud_PartyBox_New.Hud_PartyBox_New_C.Tick
	 */
	struct UHud_PartyBox_New_C_Tick_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		float                                                      InDeltaTime;                                             // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Hud_PartyBox_New.Hud_PartyBox_New_C.SetPartyMemeberSummonBtnEnable
	 */
	struct UHud_PartyBox_New_C_SetPartyMemeberSummonBtnEnable_Params
	{
	public:
		bool                                                       bEnable;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Hud_PartyBox_New.Hud_PartyBox_New_C.SetMovetoPartyOwnerBtnEnable
	 */
	struct UHud_PartyBox_New_C_SetMovetoPartyOwnerBtnEnable_Params
	{
	public:
		bool                                                       bEnable;                                                 // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Hud_PartyBox_New.Hud_PartyBox_New_C.ExecuteUbergraph_Hud_PartyBox_New
	 */
	struct UHud_PartyBox_New_C_ExecuteUbergraph_Hud_PartyBox_New_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Hud_PartyBox_New.Hud_PartyBox_New_C.ClickDispatcher__DelegateSignature
	 */
	struct UHud_PartyBox_New_C_ClickDispatcher__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
