#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.SetTeamTag
	 */
	struct UHud_TProfile_New_C_SetTeamTag_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.Tick
	 */
	struct UHud_TProfile_New_C_Tick_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		float                                                      InDeltaTime;                                             // 0x0038(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__MirButton_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__MirButton_1_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.OnPreSet
	 */
	struct UHud_TProfile_New_C_OnPreSet_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.OnSetVisible
	 */
	struct UHud_TProfile_New_C_OnSetVisible_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.PreConstruct
	 */
	struct UHud_TProfile_New_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_5_InvitePartyDispatcher__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_5_InvitePartyDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_10_PersonalTradeDispatcher__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_10_PersonalTradeDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_11_InviteGuildDispatcher__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_11_InviteGuildDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_12_WhisperDispatcher__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_12_WhisperDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_13_WhisperBlockDispatcher__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_13_WhisperBlockDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_14_DetailViewDispatcher__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_14_DetailViewDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_15_AddFriendDispatcher__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__Hud_ProfileMenu_K2Node_ComponentBoundEvent_15_AddFriendDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__Hud_TProfile_New_MirButton_176_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__Hud_TProfile_New_MirButton_176_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.BndEvt__Hud_TProfile_New_CM_Btn_Close_K2Node_ComponentBoundEvent_4_Click__DelegateSignature
	 */
	struct UHud_TProfile_New_C_BndEvt__Hud_TProfile_New_CM_Btn_Close_K2Node_ComponentBoundEvent_4_Click__DelegateSignature_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.CloseEvent
	 */
	struct UHud_TProfile_New_C_CloseEvent_Params
	{	};

	/**
	 * Function Hud_TProfile_New.Hud_TProfile_New_C.ExecuteUbergraph_Hud_TProfile_New
	 */
	struct UHud_TProfile_New_C_ExecuteUbergraph_Hud_TProfile_New_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
