#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.On_BG_MouseButtonDown_1
	 */
	struct UPage_Talkbox_Profession_C_On_BG_MouseButtonDown_1_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.OnSetAlram_Already
	 */
	struct UPage_Talkbox_Profession_C_OnSetAlram_Already_Params
	{
	public:
		class FString                                              Title;                                                   // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		class FString                                              upgrade;                                                 // 0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.OnPreSet
	 */
	struct UPage_Talkbox_Profession_C_OnPreSet_Params
	{	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.BndEvt__TB_Craftsman_Reset_K2Node_ComponentBoundEvent_1_CloseDispatcher__DelegateSignature
	 */
	struct UPage_Talkbox_Profession_C_BndEvt__TB_Craftsman_Reset_K2Node_ComponentBoundEvent_1_CloseDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.BndEvt__TB_Craftsman_Upgrade_K2Node_ComponentBoundEvent_2_CloseDispatcher__DelegateSignature
	 */
	struct UPage_Talkbox_Profession_C_BndEvt__TB_Craftsman_Upgrade_K2Node_ComponentBoundEvent_2_CloseDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.BndEvt__TB_Craftsman_Reset_K2Node_ComponentBoundEvent_3_ResetDispatcher__DelegateSignature
	 */
	struct UPage_Talkbox_Profession_C_BndEvt__TB_Craftsman_Reset_K2Node_ComponentBoundEvent_3_ResetDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.BndEvt__TB_Craftsman_Upgrade_K2Node_ComponentBoundEvent_4_UpgradeDispatcher__DelegateSignature
	 */
	struct UPage_Talkbox_Profession_C_BndEvt__TB_Craftsman_Upgrade_K2Node_ComponentBoundEvent_4_UpgradeDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.BndEvt__TB_Craftsman_Already_K2Node_ComponentBoundEvent_0_CloseDispatcher__DelegateSignature
	 */
	struct UPage_Talkbox_Profession_C_BndEvt__TB_Craftsman_Already_K2Node_ComponentBoundEvent_0_CloseDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.OnSetSelectType
	 */
	struct UPage_Talkbox_Profession_C_OnSetSelectType_Params
	{
	public:
		int32_t                                                    Type;                                                    // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.OnSetAlram_Reset
	 */
	struct UPage_Talkbox_Profession_C_OnSetAlram_Reset_Params
	{
	public:
		class FString                                              Title;                                                   // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
		class FString                                              upgrade;                                                 // 0x0010(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.CancelPopup
	 */
	struct UPage_Talkbox_Profession_C_CancelPopup_Params
	{	};

	/**
	 * Function Page_Talkbox_Profession.Page_Talkbox_Profession_C.ExecuteUbergraph_Page_Talkbox_Profession
	 */
	struct UPage_Talkbox_Profession_C_ExecuteUbergraph_Page_Talkbox_Profession_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
