#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function Pause_Menu.Pause_Menu_C.OnMouseButtonDown_1
	 */
	struct UPause_Menu_C_OnMouseButtonDown_1_Params
	{
	public:
		struct FGeometry                                           MyGeometry;                                              // 0x0000(0x0038)  (BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
		struct FPointerEvent                                       MouseEvent;                                              // 0x0038(0x0070)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
		struct FEventReply                                         ReturnValue;                                             // 0x00A8(0x00B8)  (Parm, OutParm, ReturnParm)
	};

	/**
	 * Function Pause_Menu.Pause_Menu_C.CustomEvent
	 */
	struct UPause_Menu_C_CustomEvent_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function Pause_Menu.Pause_Menu_C.Construct
	 */
	struct UPause_Menu_C_Construct_Params
	{	};

	/**
	 * Function Pause_Menu.Pause_Menu_C.OnInitialized
	 */
	struct UPause_Menu_C_OnInitialized_Params
	{	};

	/**
	 * Function Pause_Menu.Pause_Menu_C.BndEvt__CM_PopupBgSet_K2Node_ComponentBoundEvent_0_PopClose__DelegateSignature
	 */
	struct UPause_Menu_C_BndEvt__CM_PopupBgSet_K2Node_ComponentBoundEvent_0_PopClose__DelegateSignature_Params
	{	};

	/**
	 * Function Pause_Menu.Pause_Menu_C.BndEvt__CM_PopupBgSet_K2Node_ComponentBoundEvent_1_PopYesBtn__DelegateSignature
	 */
	struct UPause_Menu_C_BndEvt__CM_PopupBgSet_K2Node_ComponentBoundEvent_1_PopYesBtn__DelegateSignature_Params
	{	};

	/**
	 * Function Pause_Menu.Pause_Menu_C.BndEvt__CM_PopupBgSet_K2Node_ComponentBoundEvent_2_PopNoBtn__DelegateSignature
	 */
	struct UPause_Menu_C_BndEvt__CM_PopupBgSet_K2Node_ComponentBoundEvent_2_PopNoBtn__DelegateSignature_Params
	{	};

	/**
	 * Function Pause_Menu.Pause_Menu_C.ExecuteUbergraph_Pause_Menu
	 */
	struct UPause_Menu_C_ExecuteUbergraph_Pause_Menu_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function Pause_Menu.Pause_Menu_C.CloseWidgetDispatch__DelegateSignature
	 */
	struct UPause_Menu_C_CloseWidgetDispatch__DelegateSignature_Params
	{	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
