#pragma once

/**
 * Name: MIRM
 * Version: 0623-2
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.PreConstruct
	 */
	struct UHUD_IV_Function_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.OnActivePopupEvent
	 */
	struct UHUD_IV_Function_C_OnActivePopupEvent_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.BndEvt__CM_Trash_btn_K2Node_ComponentBoundEvent_0_OnChangeState__DelegateSignature
	 */
	struct UHUD_IV_Function_C_BndEvt__CM_Trash_btn_K2Node_ComponentBoundEvent_0_OnChangeState__DelegateSignature_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.BndEvt__Destroy_Btn_K2Node_ComponentBoundEvent_2_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_IV_Function_C_BndEvt__Destroy_Btn_K2Node_ComponentBoundEvent_2_ClickDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.BndEvt__Sell_Btn_K2Node_ComponentBoundEvent_3_ClickDispatcher__DelegateSignature
	 */
	struct UHUD_IV_Function_C_BndEvt__Sell_Btn_K2Node_ComponentBoundEvent_3_ClickDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.BndEvt__Decomposition_Btn_K2Node_ComponentBoundEvent_4_Decomp_ClicK_Dispatch__DelegateSignature
	 */
	struct UHUD_IV_Function_C_BndEvt__Decomposition_Btn_K2Node_ComponentBoundEvent_4_Decomp_ClicK_Dispatch__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.BndEvt__HUD_IV_Function_CM_Btn_Close_K2Node_ComponentBoundEvent_1_Click__DelegateSignature
	 */
	struct UHUD_IV_Function_C_BndEvt__HUD_IV_Function_CM_Btn_Close_K2Node_ComponentBoundEvent_1_Click__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.BndEvt__HUD_IV_Function_Repare_btn_K2Node_ComponentBoundEvent_5_Click__DelegateSignature
	 */
	struct UHUD_IV_Function_C_BndEvt__HUD_IV_Function_Repare_btn_K2Node_ComponentBoundEvent_5_Click__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.ExecuteUbergraph_HUD_IV_Function
	 */
	struct UHUD_IV_Function_C_ExecuteUbergraph_HUD_IV_Function_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_IV_Function.HUD_IV_Function_C.OnActivedispatcher__DelegateSignature
	 */
	struct UHUD_IV_Function_C_OnActivedispatcher__DelegateSignature_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
