#pragma once

/**
 * Name: MIRM
 * Version: 0623-2
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.OnCreateMirPage
	 */
	struct UHUD_Inventory_Set_C_OnCreateMirPage_Params
	{
	public:
		class FString                                              Parameters;                                              // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.BndEvt__HUD_IV_Frame_K2Node_ComponentBoundEvent_1_CloseDispatcher__DelegateSignature
	 */
	struct UHUD_Inventory_Set_C_BndEvt__HUD_IV_Frame_K2Node_ComponentBoundEvent_1_CloseDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.OnInitailizeWidget
	 */
	struct UHUD_Inventory_Set_C_OnInitailizeWidget_Params
	{
	public:
		class FString                                              Parameters;                                              // 0x0000(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.BndEvt__HUD_IV_Sorting_K2Node_ComponentBoundEvent_0_OnActivedispatcher__DelegateSignature
	 */
	struct UHUD_Inventory_Set_C_BndEvt__HUD_IV_Sorting_K2Node_ComponentBoundEvent_0_OnActivedispatcher__DelegateSignature_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.BndEvt__HUD_IV_Function_K2Node_ComponentBoundEvent_2_OnActiveDispatcher__DelegateSignature
	 */
	struct UHUD_Inventory_Set_C_BndEvt__HUD_IV_Function_K2Node_ComponentBoundEvent_2_OnActiveDispatcher__DelegateSignature_Params
	{
	public:
		bool                                                       IsOn;                                                    // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.BndEvt__HUD_IV_Frame_K2Node_ComponentBoundEvent_3_OnWeightDispatcher__DelegateSignature
	 */
	struct UHUD_Inventory_Set_C_BndEvt__HUD_IV_Frame_K2Node_ComponentBoundEvent_3_OnWeightDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.BndEvt__HUD_IV_Frame_K2Node_ComponentBoundEvent_4_OnSlotDispatcher__DelegateSignature
	 */
	struct UHUD_Inventory_Set_C_BndEvt__HUD_IV_Frame_K2Node_ComponentBoundEvent_4_OnSlotDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.PreConstruct
	 */
	struct UHUD_Inventory_Set_C_PreConstruct_Params
	{
	public:
		bool                                                       IsDesignTime;                                            // 0x0000(0x0001)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.OnReceivePrefabMessage
	 */
	struct UHUD_Inventory_Set_C_OnReceivePrefabMessage_Params
	{
	public:
		class FName                                                PrefabMessage;                                           // 0x0000(0x0008)  (ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FString                                              PrefabParameters;                                        // 0x0008(0x0010)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.BndEvt__MirButton_59_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature
	 */
	struct UHUD_Inventory_Set_C_BndEvt__MirButton_59_K2Node_ComponentBoundEvent_5_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.BndEvt__A_CM_Item_Info_Group_K2Node_ComponentBoundEvent_6_OpenDispatcher__DelegateSignature
	 */
	struct UHUD_Inventory_Set_C_BndEvt__A_CM_Item_Info_Group_K2Node_ComponentBoundEvent_6_OpenDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.BndEvt__A_CM_Item_Info_Group_K2Node_ComponentBoundEvent_7_CloseDispatcher__DelegateSignature
	 */
	struct UHUD_Inventory_Set_C_BndEvt__A_CM_Item_Info_Group_K2Node_ComponentBoundEvent_7_CloseDispatcher__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.BndEvt__Item_Info_Close_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature
	 */
	struct UHUD_Inventory_Set_C_BndEvt__Item_Info_Close_1_K2Node_ComponentBoundEvent_8_OnButtonClickedEvent__DelegateSignature_Params
	{	};

	/**
	 * Function HUD_Inventory_Set.HUD_Inventory_Set_C.ExecuteUbergraph_HUD_Inventory_Set
	 */
	struct UHUD_Inventory_Set_C_ExecuteUbergraph_HUD_Inventory_Set_Params
	{
	public:
		int32_t                                                    EntryPoint;                                              // 0x0000(0x0004)  (BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
