#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Enums
	// --------------------------------------------------
	/**
	 * Enum MirM.ECFlag
	 */
	enum class ECFlag : uint8_t
	{
		Player                             = 0,
		Character                          = 1,
		Goods                              = 2,
		Level                              = 3,
		Inven                              = 4,
		EXP                                = 5,
		EQUIP                              = 6,
		PARTY                              = 7,
		Popup                              = 8,
		PK                                 = 9,
		CHATTING                           = 10,
		MINIMAP_ST_DY                      = 11,
		MINIMAP_REALTIME                   = 12,
		SkillSettingChange                 = 13,
		POTION_HUD                         = 14,
		INVEN_WEIGHT                       = 15,
		INVEN_SIZE                         = 16,
		QUEST                              = 17,
		ChangeSector                       = 18,
		Profession                         = 19,
		Resmelt_Make                       = 20,
		Resmelt_Select                     = 21,
		Resmelt_Cancel                     = 22,
		Meridians                          = 23,
		Acupoints                          = 24,
		Exchange                           = 25,
		ChangeSector_Leave                 = 26,
		Enchant_Reinforce_Result           = 27,
		Enchant_Reinforce_ProductionFinish = 28,
		SkillUpdate                        = 29,
		Teleport_Merory_Refresh            = 30,
		NextMonsterSpawn                   = 31,
		Decomposition                      = 32,
		FieldBoss                          = 33,
		Storage_Inven                      = 34,
		Force_Recovery                     = 35,
		Force_Levelup                      = 36,
		Force_EXP                          = 37,
		Fatigue                            = 38,
		SkillLevelup                       = 39,
		FieldMapRefresh                    = 40,
		CloseAllWindow                     = 41,
		SiegeWarfare                       = 42,
		FatigueCharge                      = 43,
		FatigueRecovery                    = 44,
		MeridianSkillChange                = 45,
		Guild                              = 46,
		PlayingComboSkill                  = 47,
		IndunStage                         = 48,
		MaterialStorage                    = 49,
		TreasureStorage                    = 50,
		ShareStorage                       = 51,
		SupplyStorage                      = 52,
		ShareStorageItemRequest            = 53,
		Vehicle                            = 54,
		VehicleEquip                       = 55,
		BuffItemAutoSetting                = 56,
		MonsterItemSummon                  = 57,
		GuildTownEnter                     = 58,
		WorldBoss_Spawn                    = 59,
		WorldBoss_Disappear                = 60,
		ChangeSafeZone                     = 61,
		HUDNPCList                         = 62,
		Pet                                = 63,
		Mentor                             = 64,
		WantedListPage                     = 65,
		WantedProgressPage                 = 66,
		WantedRequestPage                  = 67,
		WantedRewardPage                   = 68,
		HorizonExpendablesValue            = 69,
		UserTitle                          = 70,
		NotiBoardRefresh                   = 71,
		UseTraceItem                       = 72,
		Friend                             = 73,
		Collection                         = 74,
		CollectionPer                      = 75,
		Costume                            = 76,
		AdventureJournal                   = 77,
		Favorability                       = 78,
		DrawPlayerPath                     = 79,
		GuildMemberListReceived            = 80,
		CashShop                           = 81,
		CashShop_HUD_Alarm                 = 82,
		DungeonRoomParticipate             = 83,
		DungeonRoomInfoChanged             = 84,
		GuildShipWar                       = 85,
		RegistSocial                       = 86,
		Equip_Page                         = 87,
		BossDungeon_Popup                  = 88,
		IllusionDungeon_Popup              = 89,
		MonarchDungeon_Popup               = 90,
		GuildShipWarSituation              = 91,
		Chatting_Whisper                   = 92,
		CastleDungeonUpdate                = 93,
		GuildWarRankUpdate                 = 94,
		SubscriptionInfo                   = 95,
		HudQuickSlot                       = 96,
		SiegeWarfareVictory                = 97,
		Channel                            = 98,
		MapPointAlarm                      = 99,
		MiniMapSectorUserAlarm             = 100,
		PersonalTrade                      = 101,
		DungeonRoomInvited                 = 102,
		Transform_Avatar                   = 103,
		Transform_Realease                 = 104,
		SecretValleySell                   = 105,
		Revive_EXP                         = 106,
		Reflection                         = 107,
		ArenaState                         = 108,
		ArenaRank                          = 109,
		RegitSpawn                         = 110,
		SpawnDungeonState                  = 111,
		SpawnDungeonUpdate                 = 112,
		Mandala                            = 113,
		CreateStreetStall                  = 114,
		MyStreetStall                      = 115,
		MyStreetStallPopup                 = 116,
		NoTouchScreen                      = 117,
		OwnerProfession                    = 118,
		MAX                                = 119
	};

	/**
	 * Enum MirM.ETaskEvent
	 */
	enum class ETaskEvent : uint8_t
	{
		START_DOWNLOAD     = 0,
		DOWNLOAD_UPDATE    = 1,
		STOP               = 2,
		DOWNLOAD_COMPLETED = 3,
		ERROR_OCCUR        = 4,
		MAX                = 5
	};

	/**
	 * Enum MirM.Download_State
	 */
	enum class EDownload_State : uint8_t
	{
		Download_State__NONE                           = 0,
		Download_State__LoadedPage                     = 1,
		Download_State__Download_VersionInfo           = 2,
		Download_State__Requested_DownloadVersion      = 3,
		Download_State__Complete_DownloadVersion       = 4,
		Download_State__Check_Version                  = 5,
		Download_State__Download_PaksManifest          = 6,
		Download_State__Requested_DownloadPaksManifest = 7,
		Download_State__Complete_DownloadPaksManifest  = 8,
		Download_State__Check_Manifest                 = 9,
		Download_State__AskDownloadPak                 = 10,
		Download_State__Download_MovieClip             = 11,
		Download_State__Requested_Download_MovieClip   = 12,
		Download_State__Complete_Download_MovieClip    = 13,
		Download_State__Download_PakFiles              = 14,
		Download_State__Requested_DownloadPakFiles     = 15,
		Download_State__Complete_DownloadPakFiles      = 16,
		Download_State__Check_PakHash                  = 17,
		Download_State__MountNewPaks                   = 18,
		Download_State__Finish                         = 19,
		Download_State__TouchWait                      = 20,
		Download_State__ConnectionFail                 = 21,
		Download_State__Download_MAX                   = 22
	};

	/**
	 * Enum MirM.EMirCheckBoxState
	 */
	enum class EMirCheckBoxState : uint8_t
	{
		Unchecked = 0,
		Checked   = 1,
		UnUsed    = 2,
		Hovered   = 3,
		MAX       = 4
	};

	/**
	 * Enum MirM.E_BUFFUSE_TYPE
	 */
	enum class E_BUFFUSE_TYPE : uint8_t
	{
		POINT         = 0,
		ONLINE        = 1,
		PARTY         = 2,
		EndEnum       = 3,
		E_BUFFUSE_MAX = 4
	};

	/**
	 * Enum MirM.E_MENTOR_TARGET
	 */
	enum class E_MENTOR_TARGET : uint8_t
	{
		MENTOR       = 0,
		MENTEE       = 1,
		EndEnum      = 2,
		E_MENTOR_MAX = 3
	};

	/**
	 * Enum MirM.E_AdventureJournalType
	 */
	enum class E_AdventureJournalType : uint8_t
	{
		CollectionItem    = 0,
		NPCFavorability   = 1,
		ViewPoint         = 2,
		MonsterCollection = 3,
		HiddenStory       = 4,
		E_MAX             = 5
	};

	/**
	 * Enum MirM.BuffType
	 */
	enum class EBuffType : uint8_t
	{
		BuffType__BARRIOR      = 0,
		BuffType__INVISIBLE    = 1,
		BuffType__BuffType_MAX = 2
	};

	/**
	 * Enum MirM.EMaterialType
	 */
	enum class EMaterialType : uint8_t
	{
		ICE    = 0,
		GROUND = 1,
		MAX    = 2
	};

	/**
	 * Enum MirM.EShakeType
	 */
	enum class EShakeType : uint8_t
	{
		BasicShake      = 0,
		ExplosionShake  = 1,
		ExplosionShake2 = 2,
		MAX             = 3
	};

	/**
	 * Enum MirM.EAutoPlayPauseStateType
	 */
	enum class EAutoPlayPauseStateType : uint8_t
	{
		_NONE               = 0,
		_TOUCH_MOVE         = 1,
		_MANUAL_MOVE        = 2,
		_TELEPORT           = 3,
		_TREASURE_BOX       = 4,
		_FEAR               = 5,
		_FEAR_STOP          = 6,
		_COLLECTION         = 7,
		_UI_CONTROL         = 8,
		_UI_CONTROL_STOP    = 9,
		_NPC_TALK           = 10,
		_NPC_TALK_STOP      = 11,
		_SKILL_ATTACK       = 12,
		_SKILL_ATTACK_STOP  = 13,
		_NORMAL_ATTACK      = 14,
		_NORMAL_ATTACK_STOP = 15,
		_WAIT               = 16,
		_WAIT_STOP          = 17,
		_CINEMA             = 18,
		_CINEMA_STOP        = 19,
		_SEALING_DEVICE     = 20,
		_RETRY_CONNECT      = 21,
		_STREET_STALL       = 22,
		_END                = 23,
		_MAX                = 24
	};

	/**
	 * Enum MirM.EMirAutoSequenceLogicType
	 */
	enum class EMirAutoSequenceLogicType : uint8_t
	{
		None              = 0,
		MoveBattle        = 1,
		MoveCollect       = 2,
		MoveTalk          = 3,
		Move              = 4,
		MoveFriend        = 5,
		NoTelePortMove    = 6,
		MoveWorship       = 7,
		MovePromotionShop = 8,
		MoveOccupyShopPos = 9,
		MAX               = 10
	};

	/**
	 * Enum MirM.EMirGuideAutoLogicType
	 */
	enum class EMirGuideAutoLogicType : uint8_t
	{
		GuideHunting = 0,
		MoveBattle   = 1,
		MoveCollect  = 2,
		MoveTalk     = 3,
		MAX          = 4
	};

	/**
	 * Enum MirM.EActiveFromType
	 */
	enum class EActiveFromType : uint8_t
	{
		None          = 0,
		Manual        = 1,
		Quest         = 2,
		FieldMap      = 3,
		PartyDungeon  = 4,
		Guide         = 5,
		WorldMap      = 6,
		MoveToNPC     = 7,
		AutoSequence  = 8,
		SpawnPosition = 9,
		StoryModeAI   = 10,
		MAX           = 11
	};

	/**
	 * Enum MirM.EAutoPlayActionType
	 */
	enum class EAutoPlayActionType : uint8_t
	{
		None       = 0,
		Battle     = 1,
		Collect    = 2,
		Move       = 3,
		Wait       = 4,
		Pause      = 5,
		BattleMove = 6,
		Auto       = 7,
		GuidBattle = 8,
		Defend     = 9,
		MAX        = 10
	};

	/**
	 * Enum MirM.EAutoPlayButtonType
	 */
	enum class EAutoPlayButtonType : uint8_t
	{
		None    = 0,
		Battle  = 1,
		Collect = 2,
		Auto    = 3,
		Guide   = 4,
		Disable = 5,
		Defend  = 6,
		MAX     = 7
	};

	/**
	 * Enum MirM.E_CashShopExchangeType
	 */
	enum class E_CashShopExchangeType : uint8_t
	{
		Daily    = 0,
		Two_Week = 1,
		E_MAX    = 2
	};

	/**
	 * Enum MirM.E_MakeSequenceStep
	 */
	enum class E_MakeSequenceStep : uint8_t
	{
		FirstTimeIntro           = 0,
		FirstTimeIntro01         = 1,
		FirstTimeIntro02         = 2,
		FirstTimeIntro03         = 3,
		SetFocus_Weapon_All      = 4,
		SetFocus_Weapon_All_Loop = 5,
		SetFocus_Weapon          = 6,
		SetFocus_Weapon01        = 7,
		SetFocus_Weapon02        = 8,
		SetFocus_Weapon_1_Loop   = 9,
		SetFocus_Weapon_2_Loop   = 10,
		SetFocus_Weapon_3_Loop   = 11,
		SetFocus_Weapon_1_All    = 12,
		SetFocus_Weapon_2_All    = 13,
		SetFocus_Weapon_3_All    = 14,
		SlideFocus_Weapon_1      = 15,
		SlideFocus_Weapon_2      = 16,
		SlideFocus_Weapon_3      = 17,
		SlideFocus_Weapon_101    = 18,
		SlideFocus_Weapon_301    = 19,
		SlideFocus_Weapon_201    = 20,
		Select_Weapon            = 21,
		Select_Weapon01          = 22,
		Select_Weapon02          = 23,
		Select_Weapon_1_Loop     = 24,
		Select_Weapon_2_Loop     = 25,
		Select_Weapon_3_Loop     = 26,
		Create_Weapon            = 27,
		Create_Weapon01          = 28,
		Create_Weapon02          = 29,
		Create_Weapon_1_Finish   = 30,
		Create_Weapon_2_Finish   = 31,
		Create_Weapon_3_Finish   = 32,
		Max                      = 33
	};

	/**
	 * Enum MirM.E_USERMENU_BUTTON_TYPE
	 */
	enum class E_USERMENU_BUTTON_TYPE : uint8_t
	{
		DETAIL  = 0,
		FRIEND  = 1,
		PARTY   = 2,
		GUILD   = 3,
		TRADE   = 4,
		WHISPER = 5,
		BLOCK   = 6,
		MAX     = 7
	};

	/**
	 * Enum MirM.E_ChatOutsideTab
	 */
	enum class E_ChatOutsideTab : uint8_t
	{
		Chat_Normal  = 0,
		Chat_Quick   = 1,
		Chat_Setting = 2,
		NONE         = 3,
		E_MAX        = 4
	};

	/**
	 * Enum MirM.EChatLinkType
	 */
	enum class EChatLinkType : uint8_t
	{
		None              = 0,
		Item_Info         = 1,
		Party_Promotion   = 2,
		Party_Join        = 3,
		Guild_Promotion   = 4,
		Dungeon_Promotion = 5,
		MAX               = 6
	};

	/**
	 * Enum MirM.EChatMsgType
	 */
	enum class EChatMsgType : uint8_t
	{
		World     = 0,
		Area      = 1,
		Party     = 2,
		PartyPR   = 3,
		Guild     = 4,
		GuildPR   = 5,
		DungeonPR = 6,
		Whisper   = 7,
		Trade     = 8,
		System    = 9,
		MAX       = 10
	};

	/**
	 * Enum MirM.EChatTabType
	 */
	enum class EChatTabType : uint8_t
	{
		World     = 0,
		Area      = 1,
		Party     = 2,
		Guild     = 3,
		Whisper   = 4,
		Promotion = 5,
		Trade     = 6,
		System    = 7,
		Ignore    = 8,
		All       = 9,
		MAX       = 10
	};

	/**
	 * Enum MirM.E_COLLECTION_MENU
	 */
	enum class E_COLLECTION_MENU : uint8_t
	{
		ADVENTURE = 0,
		MONSTER   = 1,
		ITEM      = 2,
		PET       = 3,
		MAX       = 4
	};

	/**
	 * Enum MirM.E_GUILD_LOG_TYPE
	 */
	enum class E_GUILD_LOG_TYPE : uint8_t
	{
		NONE            = 0,
		STOCK           = 1,
		TAKEOUT         = 2,
		EndEnum         = 3,
		E_GUILD_LOG_MAX = 4
	};

	/**
	 * Enum MirM.E_BANNER_LINK_TYPE
	 */
	enum class E_BANNER_LINK_TYPE : uint8_t
	{
		NONE              = 0,
		CASHSHOP          = 1,
		LINK_URL          = 2,
		WINDOW_ID         = 3,
		EndEnum           = 4,
		E_BANNER_LINK_MAX = 5
	};

	/**
	 * Enum MirM.E_LAYOUT_TYPE
	 */
	enum class E_LAYOUT_TYPE : uint8_t
	{
		NONE           = 0,
		NORMAL         = 1,
		RECOMMEND      = 2,
		EVENT          = 3,
		SPAWN          = 4,
		EXCHANGE       = 5,
		LOGIN_PACKAGE  = 6,
		GROWTH_PACKAGE = 7,
		DAILY1_PACKAGE = 8,
		DAILY2_PACKAGE = 9,
		LIMIT_PRODUCT  = 10,
		CART           = 11,
		EndEnum        = 12,
		E_LAYOUT_MAX   = 13
	};

	/**
	 * Enum MirM.E_EXCHANGE_SORTING_ORDER
	 */
	enum class E_EXCHANGE_SORTING_ORDER : uint8_t
	{
		ASCENDING              = 0,
		DESCENDING             = 1,
		EndEnum                = 2,
		E_EXCHANGE_SORTING_MAX = 3
	};

	/**
	 * Enum MirM.E_EXCHANGE_SORTING_TYPE
	 */
	enum class E_EXCHANGE_SORTING_TYPE : uint8_t
	{
		GRADE                  = 0,
		LEVEL                  = 1,
		PRICE                  = 2,
		EndEnum                = 3,
		E_EXCHANGE_SORTING_MAX = 4
	};

	/**
	 * Enum MirM.E_EXCHANGE_CLASS_SORTING
	 */
	enum class E_EXCHANGE_CLASS_SORTING : uint8_t
	{
		ALLCLASS             = 0,
		CHARACTERCLASS       = 1,
		EndEnum              = 2,
		E_EXCHANGE_CLASS_MAX = 3
	};

	/**
	 * Enum MirM.E_REWARD_PROFESIONEXP_TYPE
	 */
	enum class E_REWARD_PROFESIONEXP_TYPE : uint8_t
	{
		ALCHEMY                   = 0,
		BLACKSMITH                = 1,
		COOKING                   = 2,
		GATHER                    = 3,
		MINING                    = 4,
		LOGGING                   = 5,
		FISHING                   = 6,
		ENCHANT                   = 7,
		HANDWORK                  = 8,
		LUCK                      = 9,
		REINFORCE                 = 10,
		NONE                      = 11,
		EndEnum                   = 12,
		E_REWARD_PROFESIONEXP_MAX = 13
	};

	/**
	 * Enum MirM.E_ACHIEVE_CONDITION_TYPE
	 */
	enum class E_ACHIEVE_CONDITION_TYPE : uint8_t
	{
		NONE                       = 0,
		LEVEL                      = 1,
		MONSTER_KILL_ID            = 2,
		MONSTER_TOTAL_KILL         = 3,
		QUEST_CLEAR_ID             = 4,
		QUEST_CLEAR_COUNT          = 5,
		WEAPON_REINFORCE_STEP      = 6,
		ARMOR_REINFORCE_STEP       = 7,
		ACCESSORY_REINFORCE_STEP   = 8,
		SKILL_TOTAL_LEVEL          = 9,
		PVP_WIN_COUNT              = 10,
		PVP_LOSE_COUNT             = 11,
		PK_KILL_COUNT              = 12,
		GUILD_DUNGEON_DAMAGE       = 13,
		CASTLE_GUILD_MASTER        = 14,
		CASTLE_GUILD_MEMBER        = 15,
		AREA_OCCUPATION            = 16,
		USED_GOODS                 = 17,
		ITEM_BOOK_ID               = 18,
		COMPLETE_ITEM_BOOK_GRADE   = 19,
		COMPLETE_ITEM_BOOK_ALL     = 20,
		MONSTER_BOOK_ID            = 21,
		COMPLETE_MONSTER_BOOK_AREA = 22,
		COMPLETE_MONSTER_BOOK_ALL  = 23,
		PROFESION_COUNT            = 24,
		PROFESION_LEVEL            = 25,
		COMPLETED_TITLE_COUNT      = 26,
		PVP_RANK                   = 27,
		CHARACTER_RANK             = 28,
		GUILD_RANK                 = 29,
		GUILD_REPUTATION_RANK      = 30,
		GUILD_OCCUPATION_CASTLE    = 31,
		GUILD_OCCUPATION_AREA      = 32,
		GOLD_CONSUMPTION           = 33,
		ACCESS_TIME                = 34,
		REFLECTION_SUMMON          = 35,
		REFLECTION_MIX             = 36,
		PET_SUMMON                 = 37,
		PET_MIX                    = 38,
		VEHICLE_LEVEL              = 39,
		ACCESS_DAILY               = 40,
		MONSTER_NORMAL_KILL        = 41,
		MONSTER_RARE_KILL          = 42,
		MONSTER_BOSS_KILL          = 43,
		GUILD_DONATION_GOLD        = 44,
		GUILD_DONATION_BLACK       = 45,
		GUILD_QUEST_CLEAR          = 46,
		MANDALA_NODE_BATTLE        = 47,
		MANDALA_NODE_MEISTER       = 48,
		SKILL_FORCE_LEVEL          = 49,
		ENCHANT_REINFORCE          = 50,
		ITEM_LUCK_COUNT            = 51,
		BOSSDUNGEON_CLEAR          = 52,
		ILLUSIONDUNGEON_PLAYTIME   = 53,
		REFLECTION_SUMMON_FAIL     = 54,
		REFLECTION_MIX_FAIL        = 55,
		PET_SUMMON_FAIL            = 56,
		PET_MIX_FAIL               = 57,
		EndEnum                    = 58,
		E_ACHIEVE_CONDITION_MAX    = 59
	};

	/**
	 * Enum MirM.E_TITLE_INFO_TYPE
	 */
	enum class E_TITLE_INFO_TYPE : uint8_t
	{
		NONE             = 0,
		ACHIEVE          = 1,
		RANKING          = 2,
		EndEnum          = 3,
		E_TITLE_INFO_MAX = 4
	};

	/**
	 * Enum MirM.E_ENCHANT_RESULT
	 */
	enum class E_ENCHANT_RESULT : uint8_t
	{
		NONE          = 0,
		SUCCESS       = 1,
		BIGSUCCESS    = 2,
		FAILED        = 3,
		EndEnum       = 4,
		E_ENCHANT_MAX = 5
	};

	/**
	 * Enum MirM.E_PROFESIONCATEGORYTYPE
	 */
	enum class E_PROFESIONCATEGORYTYPE : uint8_t
	{
		NONE             = 0,
		HARVEST          = 1,
		CRAFT            = 2,
		EQUIPMENTENCHANT = 3,
		EndEnum          = 4,
		E_MAX            = 5
	};

	/**
	 * Enum MirM.E_PROFESION_GRADE_TYPE
	 */
	enum class E_PROFESION_GRADE_TYPE : uint8_t
	{
		NONE                  = 0,
		NORMAL                = 1,
		RARE                  = 2,
		UNIQUE                = 3,
		LEGEND                = 4,
		EndEnum               = 5,
		E_PROFESION_GRADE_MAX = 6
	};

	/**
	 * Enum MirM.E_REPUTE_PENALTY_EXCEPT_TARGET
	 */
	enum class E_REPUTE_PENALTY_EXCEPT_TARGET : uint8_t
	{
		NONE                        = 0,
		ALL                         = 1,
		ONCE_OCCUPATION_GUILD       = 2,
		DEADMINE_OCCUPATION_GUILD   = 3,
		INSECTCAVE_OCCUPATION_GUILD = 4,
		OMACAVE_OCCUPATION_GUILD    = 5,
		EndEnum                     = 6,
		E_REPUTE_PENALTY_EXCEPT_MAX = 7
	};

	/**
	 * Enum MirM.E_CONDITION_NODE_TYPE
	 */
	enum class E_CONDITION_NODE_TYPE : uint8_t
	{
		NONE                 = 0,
		NORMAL               = 1,
		UNIQUE               = 2,
		EndEnum              = 3,
		E_CONDITION_NODE_MAX = 4
	};

	/**
	 * Enum MirM.E_REQUIRE_HOUSE
	 */
	enum class E_REQUIRE_HOUSE : uint8_t
	{
		NONE            = 0,
		TOWN_HOME       = 1,
		TOWN_DUNGEON    = 2,
		TOWN_STORAGE    = 3,
		TRAININGCENTER  = 4,
		QUEST_OFFICE    = 5,
		TOWN_BLACKSMITH = 6,
		TOWN_ALCHEMY    = 7,
		TOWN_COOKING    = 8,
		TOWN_ARSENAL    = 9,
		TOWN_ORCHARD    = 10,
		TOWN_GROVE      = 11,
		TOWN_FARM       = 12,
		TOWN_DINNER     = 13,
		EndEnum         = 14,
		E_REQUIRE_MAX   = 15
	};

	/**
	 * Enum MirM.E_SUMMONS_COLOR_TYPE
	 */
	enum class E_SUMMONS_COLOR_TYPE : uint8_t
	{
		NONE                = 0,
		YELLOW              = 1,
		RED                 = 2,
		GREEN               = 3,
		BLUE                = 4,
		PURPLE              = 5,
		EndEnum             = 6,
		E_SUMMONS_COLOR_MAX = 7
	};

	/**
	 * Enum MirM.E_NODE_ABILITY_TYPE
	 */
	enum class E_NODE_ABILITY_TYPE : uint8_t
	{
		NONE               = 0,
		ABILITY_LIST       = 1,
		ADVANCED           = 2,
		MERIDIANSLOT       = 3,
		RECIPE             = 4,
		EndEnum            = 5,
		E_NODE_ABILITY_MAX = 6
	};

	/**
	 * Enum MirM.E_DISPLAY_QUESTTYPE
	 */
	enum class E_DISPLAY_QUESTTYPE : uint8_t
	{
		NONE          = 0,
		MAIN          = 1,
		SUB           = 2,
		EndEnum       = 3,
		E_DISPLAY_MAX = 4
	};

	/**
	 * Enum MirM.E_DISPLAY_TYPE
	 */
	enum class E_DISPLAY_TYPE : uint8_t
	{
		NONE          = 0,
		QUEST_SHOW    = 1,
		QUEST_HIDE    = 2,
		EndEnum       = 3,
		E_DISPLAY_MAX = 4
	};

	/**
	 * Enum MirM.E_START_NODE
	 */
	enum class E_START_NODE : uint8_t
	{
		MIDDLE      = 0,
		LEFT        = 1,
		RIGHT       = 2,
		UPLEFT      = 3,
		UPRIGHT     = 4,
		EndEnum     = 5,
		E_START_MAX = 6
	};

	/**
	 * Enum MirM.E_NODE_OPTION_TYPE
	 */
	enum class E_NODE_OPTION_TYPE : uint8_t
	{
		ATTACK            = 0,
		DEFENCE           = 1,
		UTILITY           = 2,
		SLOT              = 3,
		EndEnum           = 4,
		E_NODE_OPTION_MAX = 5
	};

	/**
	 * Enum MirM.E_NODE_TYPE
	 */
	enum class E_NODE_TYPE : uint8_t
	{
		NORMAL     = 0,
		UNIQUE     = 1,
		SLOT       = 2,
		LEGEND     = 3,
		EndEnum    = 4,
		E_NODE_MAX = 5
	};

	/**
	 * Enum MirM.E_PK_PENALTY_EXCEPT_TIME
	 */
	enum class E_PK_PENALTY_EXCEPT_TIME : uint8_t
	{
		NONE                    = 0,
		SECRETVALLEY            = 1,
		EndEnum                 = 2,
		E_PK_PENALTY_EXCEPT_MAX = 3
	};

	/**
	 * Enum MirM.E_SUMMON_TYPE
	 */
	enum class E_SUMMON_TYPE : uint8_t
	{
		NONE         = 0,
		MONSTER      = 1,
		TREASUREBOX  = 2,
		EndEnum      = 3,
		E_SUMMON_MAX = 4
	};

	/**
	 * Enum MirM.E_OPENDUNGEON_CONTENT_TYPE
	 */
	enum class E_OPENDUNGEON_CONTENT_TYPE : uint8_t
	{
		NONE                      = 0,
		SEALTOWER                 = 1,
		DEMONTOWER                = 2,
		CASTLEDUNGEON             = 3,
		PHANTOMDUNGEON            = 4,
		SECRETVALLEY              = 5,
		EndEnum                   = 6,
		E_OPENDUNGEON_CONTENT_MAX = 7
	};

	/**
	 * Enum MirM.E_REQUIRE_CASTLE_TYPE
	 */
	enum class E_REQUIRE_CASTLE_TYPE : uint8_t
	{
		NONE                 = 0,
		SABUK                = 1,
		KILUNG               = 2,
		EndEnum              = 3,
		E_REQUIRE_CASTLE_MAX = 4
	};

	/**
	 * Enum MirM.E_SECRETVALLEY
	 */
	enum class E_SECRETVALLEY : uint8_t
	{
		NONE        = 0,
		DEAD_MINE   = 1,
		INSECT_CAVE = 2,
		OMA_CAVE    = 3,
		EndEnum     = 4,
		E_MAX       = 5
	};

	/**
	 * Enum MirM.E_GUILD_MATERIAL
	 */
	enum class E_GUILD_MATERIAL : uint8_t
	{
		NONE          = 0,
		GUILDMATERIAL = 1,
		GUILDDUNGEON  = 2,
		TOWNMATERIAL  = 3,
		BATTLECONSUME = 4,
		SIEGEWEAPON   = 5,
		MAX           = 6,
		EndEnum       = 7
	};

	/**
	 * Enum MirM.E_TARGET_PRIORITY_TYPE
	 */
	enum class E_TARGET_PRIORITY_TYPE : uint8_t
	{
		MY_ATTACK_NEAR_USER    = 0,
		MY_ATTACK_NEAR_MONSTER = 1,
		PK_REVENGE_USER        = 2,
		ENEMY_GUILD_USER       = 3,
		QUEST_TARGET_MONSTER   = 4,
		AREA_LOW_HP_MONSTER    = 5,
		PARTY_OWNER_TARGET     = 6,
		MAX                    = 7,
		EndEnum                = 8
	};

	/**
	 * Enum MirM.E_GUILDMARK_CONDITION_TYPE
	 */
	enum class E_GUILDMARK_CONDITION_TYPE : uint8_t
	{
		NONE                      = 0,
		GUILD_LV                  = 1,
		TITLE                     = 2,
		EndEnum                   = 3,
		E_GUILDMARK_CONDITION_MAX = 4
	};

	/**
	 * Enum MirM.E_GUILDMARK_TYPE
	 */
	enum class E_GUILDMARK_TYPE : uint8_t
	{
		NONE            = 0,
		BACKGROUND      = 1,
		SIMBOL          = 2,
		EndEnum         = 3,
		E_GUILDMARK_MAX = 4
	};

	/**
	 * Enum MirM.E_ASSIGNMENT_TYPE
	 */
	enum class E_ASSIGNMENT_TYPE : uint8_t
	{
		NONE             = 0,
		SEASON           = 1,
		REPEAT           = 2,
		EndEnum          = 3,
		E_ASSIGNMENT_MAX = 4
	};

	/**
	 * Enum MirM.E_ASSIGNMENT_CONDITION_TYPE
	 */
	enum class E_ASSIGNMENT_CONDITION_TYPE : uint8_t
	{
		NONE                         = 0,
		MONSTER_TOTAL_KILL           = 1,
		AREAQUEST_CLEAR_COUNT        = 2,
		SHIPWAR_WIN_COUNT            = 3,
		PK_KILL_COUNT                = 4,
		PROFESION_COUNT              = 5,
		COST_GOLD_COUNT              = 6,
		COST_BOSSPOINT_COUNT         = 7,
		COST_PKPOINT_COUNT           = 8,
		GET_BOSSPOINT_COUNT          = 9,
		GET_PKPOINT_COUNT            = 10,
		MONSTER_GRADE_KILL           = 11,
		REPAIR_COUNT                 = 12,
		CRAFT_COUNT                  = 13,
		REINFORCE_COUNT              = 14,
		LUCK_COUNT                   = 15,
		ENCHANT_COUNT                = 16,
		GET_GOODS_COUNT              = 17,
		COST_GOODS_COUNT             = 18,
		BOSSDUNGEON_JOIN_COUNT       = 19,
		BOSSDUNGEON15_JOIN_COUNT     = 20,
		ILLUSIONDUNGEON_JOIN_COUNT   = 21,
		TRADE_REGISTRATION_COUNT     = 22,
		TRADE_BUY_COUNT              = 23,
		GUILDWAR_JOIN_COUNT          = 24,
		ARENA_JOIN_COUNT             = 25,
		COST_VEHICLE_FOOD            = 26,
		REPEAT_ADVENTURE_QUEST_COUNT = 27,
		REPEAT_PROFESION_QUEST_COUNT = 28,
		REPEAT_WAR_QUEST_COUNT       = 29,
		GUILD_DONATION_COUNT         = 30,
		GUILD_SHOP_COUNT             = 31,
		GUILD_QUEST_COUNT            = 32,
		EndEnum                      = 33,
		E_ASSIGNMENT_CONDITION_MAX   = 34
	};

	/**
	 * Enum MirM.E_SEASON_PASS_TAB
	 */
	enum class E_SEASON_PASS_TAB : uint8_t
	{
		NONE              = 0,
		READY             = 1,
		SEASON            = 2,
		ASSIGNMENT        = 3,
		SPECIAL_REWARD    = 4,
		EndEnum           = 5,
		E_SEASON_PASS_MAX = 6
	};

	/**
	 * Enum MirM.E_SEASON_PASS_CATEGORY
	 */
	enum class E_SEASON_PASS_CATEGORY : uint8_t
	{
		NONE              = 0,
		SEASON_PASS       = 1,
		EVENT_PASS        = 2,
		EVENT_PASS01      = 3,
		EVENT_PASS02      = 4,
		EndEnum           = 5,
		E_SEASON_PASS_MAX = 6
	};

	/**
	 * Enum MirM.E_SEASONCOLLECT_TYPE
	 */
	enum class E_SEASONCOLLECT_TYPE : uint8_t
	{
		NONE                = 0,
		GET                 = 1,
		USE                 = 2,
		EndEnum             = 3,
		E_SEASONCOLLECT_MAX = 4
	};

	/**
	 * Enum MirM.E_TOUCH_ANIMATION
	 */
	enum class E_TOUCH_ANIMATION : uint8_t
	{
		NONE        = 0,
		TOUCH       = 1,
		DRAG_LEFT   = 2,
		DRAG_RIGHT  = 3,
		DRAG_UP     = 4,
		DRAG_DOWN   = 5,
		EndEnum     = 6,
		E_TOUCH_MAX = 7
	};

	/**
	 * Enum MirM.E_INTIMACY_GRADE_TYPE
	 */
	enum class E_INTIMACY_GRADE_TYPE : uint8_t
	{
		NONE                 = 0,
		INDIFFERENCE         = 1,
		NORMAL               = 2,
		INTEREST             = 3,
		FRIENDLY             = 4,
		TRUST                = 5,
		EndEnum              = 6,
		E_INTIMACY_GRADE_MAX = 7
	};

	/**
	 * Enum MirM.E_VEHICLE_MOVETYPE
	 */
	enum class E_VEHICLE_MOVETYPE : uint8_t
	{
		WALK          = 0,
		FLY           = 1,
		BOUNCE        = 2,
		EndEnum       = 3,
		E_VEHICLE_MAX = 4
	};

	/**
	 * Enum MirM.E_COLLECT_MONSTER_VIEW
	 */
	enum class E_COLLECT_MONSTER_VIEW : uint8_t
	{
		NONE                  = 0,
		RARE_VIEW             = 1,
		FIELDBOSS_VIEW        = 2,
		WORLDBOSS_VIEW        = 3,
		EndEnum               = 4,
		E_COLLECT_MONSTER_MAX = 5
	};

	/**
	 * Enum MirM.E_KEYFUNCTION_TYPE
	 */
	enum class E_KEYFUNCTION_TYPE : uint8_t
	{
		NONE              = 0,
		ACTION            = 1,
		WINDOW            = 2,
		POPUP             = 3,
		CUSTOM            = 4,
		EndEnum           = 5,
		E_KEYFUNCTION_MAX = 6
	};

	/**
	 * Enum MirM.E_CAP_COSTUME_TYPE
	 */
	enum class E_CAP_COSTUME_TYPE : uint8_t
	{
		NONE              = 0,
		HEAD              = 1,
		HAIR              = 2,
		HEAD_ACC          = 3,
		HELMET            = 4,
		EndEnum           = 5,
		E_CAP_COSTUME_MAX = 6
	};

	/**
	 * Enum MirM.E_KEYACTION
	 */
	enum class E_KEYACTION : uint8_t
	{
		NONE                      = 0,
		MOVEFORWARD               = 1,
		MOVELEFT                  = 2,
		MOVEBACKWARD              = 3,
		MOVERIGHT                 = 4,
		USESKILL1                 = 5,
		USESKILL2                 = 6,
		USESKILL3                 = 7,
		USESKILL4                 = 8,
		USESKILL5                 = 9,
		USEITEMSLOT1              = 10,
		USEITEMSLOT2              = 11,
		USEITEMSLOT3              = 12,
		USEITEMSLOT4              = 13,
		USEITEMSLOT5              = 14,
		USEATTACK                 = 15,
		USECOMBOSKILL             = 16,
		CHANGETARGET              = 17,
		TOGGLEHOLDPOSITION        = 18,
		USEHEALPOTION             = 19,
		USEMANAPOTION             = 20,
		TOGGLEAUTOHUNTING         = 21,
		TOGGLEAUTOCOLLECT         = 22,
		TOGGLEAUTOATTACK          = 23,
		TOGGLEVEHICLE             = 24,
		TOGGLEPET                 = 25,
		TOGGLEMENU                = 26,
		OPENSHOP                  = 27,
		TOGGLEGUIDE               = 28,
		TOGGLEBAG                 = 29,
		OPENMAIL                  = 30,
		OPENMAP                   = 31,
		FOCUSCHATWINDOW           = 32,
		OPENQUEST                 = 33,
		OPENGUIDE                 = 34,
		OPENEQUIP                 = 35,
		OPENSKILL                 = 36,
		OPENEQUIPSTONE            = 37,
		OPENBOSS                  = 38,
		OPENWORLDBOSS             = 39,
		OPENDUNGEONBOSS           = 40,
		OPENDUNGEONCASTLE         = 41,
		OPENPVPINFO               = 42,
		OPENRANKING               = 43,
		OPENTITLE                 = 44,
		OPENCOLLECTION            = 45,
		OPENFRIEND                = 46,
		OPENMENTOR                = 47,
		OPENGUILD                 = 48,
		OPENTRADESHOP             = 49,
		OPENMAKE                  = 50,
		OPENSTORAGE               = 51,
		OPENPARTY                 = 52,
		OPENOPTION                = 53,
		OPENPOSITIONSAVE          = 54,
		OPENVEHICLE               = 55,
		OPENPET                   = 56,
		TOGGLECHARINFO            = 57,
		TOGGLEEND                 = 58,
		TOGGLEHPPOTIONLIST        = 59,
		TOGGLEMPPOTIONLIST        = 60,
		TOGGLEPKMODE              = 61,
		TOGGLECAMARA              = 62,
		TOGGLERAMPARTLEFT         = 63,
		TOGGLERAMPARTRIGHT        = 64,
		TOGGLECASTLEGATE          = 65,
		TOGGLESECRETPASSAGEOUT    = 66,
		TOGGLESECRETPASSAGEIN     = 67,
		TOGGLEDEFENDTOWERLEFT1    = 68,
		TOGGLEDEFENDTOWERLEFT2    = 69,
		TOGGLEDEFENDTOWERRIGHT1   = 70,
		TOGGLEDEFENDTOWERRIGHT2   = 71,
		TOGGLEROYALPALACESTONE    = 72,
		OPENDUNGEONMONARCH        = 73,
		TOGGLEGET                 = 74,
		TOGGLEQUESTAUTO           = 75,
		OPENSIEGEWAR              = 76,
		TOGGLEUIHIDE              = 77,
		TOGGLESCAN                = 78,
		OPENREFLECTION            = 79,
		OPENDUNGEONILLUSION       = 80,
		OPENMIRWORSHIP            = 81,
		OPENSECRETVALLEY          = 82,
		OPENAVATAR                = 83,
		OPENARENABATTLE           = 84,
		OPENMANDALA               = 85,
		OPENMIRPASS               = 86,
		TOGGLEITEMQUICKSLOTSWIPE  = 87,
		TOGGLESKILLQUICKSLOTSWIPE = 88,
		OPENGAMEEVENT             = 89,
		STREETSTALL               = 90,
		TOGGLEPOWERSAVING         = 91,
		TOGGLETONIC               = 92,
		TOGGLEQUICKOPTION         = 93,
		USEATTACKCANCLE           = 94,
		EndEnum                   = 95,
		E_MAX                     = 96
	};

	/**
	 * Enum MirM.E_SHORTCUT_EVENT_TYPE
	 */
	enum class E_SHORTCUT_EVENT_TYPE : uint8_t
	{
		NONE                 = 0,
		GAMEWINDOW           = 1,
		URL                  = 2,
		EndEnum              = 3,
		E_SHORTCUT_EVENT_MAX = 4
	};

	/**
	 * Enum MirM.E_EVENT_SYSTEM_TYPE
	 */
	enum class E_EVENT_SYSTEM_TYPE : uint8_t
	{
		NONE               = 0,
		FREE               = 1,
		NEW_CHAR           = 2,
		ATTENDANCE         = 3,
		LOGIN_TIME         = 4,
		CHAR_LV            = 5,
		PERSON_RANKING     = 6,
		EndEnum            = 7,
		E_EVENT_SYSTEM_MAX = 8
	};

	/**
	 * Enum MirM.E_LOGIN_EVENT_TYPE
	 */
	enum class E_LOGIN_EVENT_TYPE : uint8_t
	{
		NONE              = 0,
		FREE              = 1,
		NEW_CHAR          = 2,
		ATTENDANCE        = 3,
		LOGIN_TIME        = 4,
		EndEnum           = 5,
		E_LOGIN_EVENT_MAX = 6
	};

	/**
	 * Enum MirM.E_KEYSET_TYPE
	 */
	enum class E_KEYSET_TYPE : uint8_t
	{
		NONE         = 0,
		BASIC        = 1,
		MENU         = 2,
		SIEGE        = 3,
		CHARACTER    = 4,
		SKILL        = 5,
		GAME_SET     = 6,
		CONVENIENCE  = 7,
		ETC          = 8,
		EndEnum      = 9,
		E_KEYSET_MAX = 10
	};

	/**
	 * Enum MirM.E_SUBSCRIPTION_TYPE
	 */
	enum class E_SUBSCRIPTION_TYPE : uint8_t
	{
		NONE               = 0,
		SUBSCRIPTION       = 1,
		VOLUME             = 2,
		EndEnum            = 3,
		E_SUBSCRIPTION_MAX = 4
	};

	/**
	 * Enum MirM.E_BUFF_INDICATOR_PRINT_TYPE
	 */
	enum class E_BUFF_INDICATOR_PRINT_TYPE : uint8_t
	{
		NONE                       = 0,
		BUFF                       = 1,
		DEBUFF                     = 2,
		PASSIVE                    = 3,
		EndEnum                    = 4,
		E_BUFF_INDICATOR_PRINT_MAX = 5
	};

	/**
	 * Enum MirM.E_REPUTE_STEP
	 */
	enum class E_REPUTE_STEP : uint8_t
	{
		GOODMAN_4STEP = 0,
		GOODMAN_3STEP = 1,
		GOODMAN_2STEP = 2,
		GOODMAN_1STEP = 3,
		NEUTRALITY    = 4,
		CHAO_1STEP    = 5,
		CHAO_2STEP    = 6,
		CHAO_3STEP    = 7,
		CHAO_4STEP    = 8,
		EndEnum       = 9,
		E_REPUTE_MAX  = 10
	};

	/**
	 * Enum MirM.E_TALKER_TYPE
	 */
	enum class E_TALKER_TYPE : uint8_t
	{
		NONE         = 0,
		MONSTER      = 1,
		NPC          = 2,
		EndEnum      = 3,
		E_TALKER_MAX = 4
	};

	/**
	 * Enum MirM.E_DIALOGUE_TYPE
	 */
	enum class E_DIALOGUE_TYPE : uint8_t
	{
		NONE           = 0,
		NPC            = 1,
		PC             = 2,
		EndEnum        = 3,
		E_DIALOGUE_MAX = 4
	};

	/**
	 * Enum MirM.E_REWARD_CONDITION
	 */
	enum class E_REWARD_CONDITION : uint8_t
	{
		NONE            = 0,
		INSTANT         = 1,
		CHARACTER_LOGIN = 2,
		EndEnum         = 3,
		E_REWARD_MAX    = 4
	};

	/**
	 * Enum MirM.E_CONDITION_VALUE_CALCULATION
	 */
	enum class E_CONDITION_VALUE_CALCULATION : uint8_t
	{
		NONE                  = 0,
		EQUAL                 = 1,
		NOTEQUAL              = 2,
		LESS                  = 3,
		LESSEQUAL             = 4,
		GREATER               = 5,
		GREATEREQUAL          = 6,
		EndEnum               = 7,
		E_CONDITION_VALUE_MAX = 8
	};

	/**
	 * Enum MirM.E_DIALOGUE_CONDITION_TYPE
	 */
	enum class E_DIALOGUE_CONDITION_TYPE : uint8_t
	{
		NONE                     = 0,
		HP_RATE                  = 1,
		SPAWN                    = 2,
		DEAD                     = 3,
		RUN                      = 4,
		DESPAWN                  = 5,
		EndEnum                  = 6,
		E_DIALOGUE_CONDITION_MAX = 7
	};

	/**
	 * Enum MirM.E_LEAGUE
	 */
	enum class E_LEAGUE : uint8_t
	{
		NONE     = 0,
		BRONZE   = 1,
		SILVER   = 2,
		GOLD     = 3,
		PLATINUM = 4,
		DIAMOND  = 5,
		EndEnum  = 6,
		E_MAX    = 7
	};

	/**
	 * Enum MirM.E_REINFORCE_TYPE
	 */
	enum class E_REINFORCE_TYPE : uint8_t
	{
		NONE            = 0,
		WEAPON          = 1,
		EQUIPMENT       = 2,
		ACCESSORY       = 3,
		EndEnum         = 4,
		E_REINFORCE_MAX = 5
	};

	/**
	 * Enum MirM.E_SHOP_TAB_TYPE
	 */
	enum class E_SHOP_TAB_TYPE : uint8_t
	{
		NONE           = 0,
		WEAPON         = 1,
		ARMOR          = 2,
		HELMET         = 3,
		BELT           = 4,
		SHOES          = 5,
		RINGS          = 6,
		BRACELET       = 7,
		NECKLACE       = 8,
		POTION         = 9,
		ETC            = 10,
		EQUIPGEM       = 11,
		SKILLBOOK      = 12,
		MATERIAL       = 13,
		SERVER_PRICE   = 14,
		EndEnum        = 15,
		E_SHOP_TAB_MAX = 16
	};

	/**
	 * Enum MirM.E_REQUIRE_LEAGUE
	 */
	enum class E_REQUIRE_LEAGUE : uint8_t
	{
		NONE          = 0,
		BRONZE        = 1,
		SILVER        = 2,
		GOLD          = 3,
		PLATINUM      = 4,
		DIAMOND       = 5,
		EndEnum       = 6,
		E_REQUIRE_MAX = 7
	};

	/**
	 * Enum MirM.E_LIMIT_TYPE
	 */
	enum class E_LIMIT_TYPE : uint8_t
	{
		NONE                    = 0,
		DAILY_LIMIT             = 1,
		WEEKLY_LIMIT            = 2,
		MONTHLY_LIMIT           = 3,
		ACCOUNT                 = 4,
		SERVER                  = 5,
		CHARACTER               = 6,
		ACCOUNT_LIMIT           = 7,
		ACCOUNT_DAILY_LIMIT     = 8,
		ACCOUNT_WEEKLY_LIMIT    = 9,
		ACCOUNT_MONTHLY_LIMIT   = 10,
		SERVER_LIMIT            = 11,
		SERVER_DAILY_LIMIT      = 12,
		SERVER_WEEKLY_LIMIT     = 13,
		SERVER_MONTHLY_LIMIT    = 14,
		CHARACTER_LIMIT         = 15,
		CHARACTER_DAILY_LIMIT   = 16,
		CHARACTER_WEEKLY_LIMIT  = 17,
		CHARACTER_MONTHLY_LIMIT = 18,
		EndEnum                 = 19,
		E_LIMIT_MAX             = 20
	};

	/**
	 * Enum MirM.E_SALE_TYPE
	 */
	enum class E_SALE_TYPE : uint8_t
	{
		NONE            = 0,
		SERVEROPEN      = 1,
		CHARACTER_LEVEL = 2,
		ACHIEVEMENT     = 3,
		QUEST           = 4,
		EndEnum         = 5,
		E_SALE_MAX      = 6
	};

	/**
	 * Enum MirM.E_PRODUCT_TYPE
	 */
	enum class E_PRODUCT_TYPE : uint8_t
	{
		LIMITED_PACKAGE  = 0,
		NORMAL_PACKAGE   = 1,
		ITEM             = 2,
		GOODS            = 3,
		PET_SPAWN        = 4,
		EQUIPSTONE       = 5,
		LOGIN_PACKAGE    = 6,
		GROWTH_PACKAGE   = 7,
		DAILY1_PACKAGE   = 8,
		DAILY2_PACKAGE   = 9,
		SEASON_PASS      = 10,
		AVATAR_SPAWN     = 11,
		REFLECTION_SPAWN = 12,
		STEP_PACKAGE     = 13,
		EndEnum          = 14,
		E_PRODUCT_MAX    = 15
	};

	/**
	 * Enum MirM.E_SHOP_CATEGORY
	 */
	enum class E_SHOP_CATEGORY : uint8_t
	{
		NONE        = 0,
		PRODUCT     = 1,
		PACKAGE     = 2,
		EXCHANGE    = 3,
		MILEAGE     = 4,
		CART        = 5,
		NORMAL_SHOP = 6,
		SPAWN       = 7,
		EndEnum     = 8,
		E_SHOP_MAX  = 9
	};

	/**
	 * Enum MirM.E_ROOM_CHECK
	 */
	enum class E_ROOM_CHECK : uint8_t
	{
		NONE       = 0,
		NUMBER10   = 1,
		NUMBER15   = 2,
		EndEnum    = 3,
		E_ROOM_MAX = 4
	};

	/**
	 * Enum MirM.E_QUEST_GRADE
	 */
	enum class E_QUEST_GRADE : uint8_t
	{
		NONE        = 0,
		HIGH        = 1,
		LOW         = 2,
		EndEnum     = 3,
		E_QUEST_MAX = 4
	};

	/**
	 * Enum MirM.E_TRIGGERACTIVE_TYPE
	 */
	enum class E_TRIGGERACTIVE_TYPE : uint8_t
	{
		SWITCH              = 0,
		OBJECT_START        = 1,
		OBJECT_END          = 2,
		INITIAL_QUEST       = 3,
		ARRIVAL_POSITION    = 4,
		EndEnum             = 5,
		E_TRIGGERACTIVE_MAX = 6
	};

	/**
	 * Enum MirM.E_DIALTYPE_END
	 */
	enum class E_DIALTYPE_END : uint8_t
	{
		NPC            = 0,
		REMOTE         = 1,
		AUTO           = 2,
		RECALL         = 3,
		EndEnum        = 4,
		E_DIALTYPE_MAX = 5
	};

	/**
	 * Enum MirM.E_DIALTYPE_START
	 */
	enum class E_DIALTYPE_START : uint8_t
	{
		NPC            = 0,
		REMOTE         = 1,
		AUTO           = 2,
		RECALL         = 3,
		EndEnum        = 4,
		E_DIALTYPE_MAX = 5
	};

	/**
	 * Enum MirM.E_UI_TYPE
	 */
	enum class E_UI_TYPE : uint8_t
	{
		NONE     = 0,
		INTRO    = 1,
		MAIN     = 2,
		EndEnum  = 3,
		E_UI_MAX = 4
	};

	/**
	 * Enum MirM.E_STARTCONDITION
	 */
	enum class E_STARTCONDITION : uint8_t
	{
		NONE         = 0,
		FIRSTDUNGEON = 1,
		FIRSTFIELD   = 2,
		FIRSTUI      = 3,
		LEVEL        = 4,
		QUESTSTART   = 5,
		QUESTEND     = 6,
		MAPLOAD      = 7,
		DIALOGUEEND  = 8,
		QUESTENDWAIT = 9,
		EndEnum      = 10,
		E_MAX        = 11
	};

	/**
	 * Enum MirM.E_SKILL_REINFORCE_TYPE
	 */
	enum class E_SKILL_REINFORCE_TYPE : uint8_t
	{
		NONE                  = 0,
		REDUCE_COOLTIME       = 1,
		REDUCE_COST           = 2,
		INCREASE_DAMAGE       = 3,
		ADDITIONAL_LEVEL      = 4,
		PASSIVE_ABILITY_TIME  = 5,
		ADD_ABILITY_ID        = 6,
		ADD_PARAM_VALUE       = 7,
		ADD_TARGET_MAX        = 8,
		EndEnum               = 9,
		E_SKILL_REINFORCE_MAX = 10
	};

	/**
	 * Enum MirM.E_MONSTER_GRADE_TYPE
	 */
	enum class E_MONSTER_GRADE_TYPE : uint8_t
	{
		NONE                = 0,
		NORMAL              = 1,
		RARE                = 2,
		BOSS                = 3,
		WEAK                = 4,
		ELITE               = 5,
		WORLDBOSS           = 6,
		EndEnum             = 7,
		E_MONSTER_GRADE_MAX = 8
	};

	/**
	 * Enum MirM.E_MONSTER_FORM_TYPE
	 */
	enum class E_MONSTER_FORM_TYPE : uint8_t
	{
		NONE               = 0,
		HUMANMON           = 1,
		BEASTMON           = 2,
		FURRYMON           = 3,
		DEVILMON           = 4,
		EndEnum            = 5,
		E_MONSTER_FORM_MAX = 6
	};

	/**
	 * Enum MirM.E_PERIOD_TYPE
	 */
	enum class E_PERIOD_TYPE : uint8_t
	{
		NONE             = 0,
		DATE             = 1,
		DAYS             = 2,
		SUBSCRIPTION_SEC = 3,
		EndEnum          = 4,
		E_PERIOD_MAX     = 5
	};

	/**
	 * Enum MirM.E_PET_COLLECTION_CATEGORY_TYPE
	 */
	enum class E_PET_COLLECTION_CATEGORY_TYPE : uint8_t
	{
		NORMAL_CATEGORY               = 0,
		BOOKMARK_CATEGORY             = 1,
		EndEnum                       = 2,
		E_PET_COLLECTION_CATEGORY_MAX = 3
	};

	/**
	 * Enum MirM.E_RANKING_TYPE
	 */
	enum class E_RANKING_TYPE : uint8_t
	{
		PERSONAL       = 0,
		GUILD          = 1,
		PROFESION      = 2,
		PERSONAL_LV    = 3,
		PERSONAL_POWER = 4,
		EndEnum        = 5,
		E_RANKING_MAX  = 6
	};

	/**
	 * Enum MirM.E_PARTS_HIDE
	 */
	enum class E_PARTS_HIDE : uint8_t
	{
		NONE           = 0,
		HEAD_HIDE      = 1,
		HAIR_HIDE      = 2,
		HEAD_HAIR_HIDE = 3,
		MAX            = 4,
		EndEnum        = 5
	};

	/**
	 * Enum MirM.E_ITEM_COLLECTION_CATEGORY_TYPE
	 */
	enum class E_ITEM_COLLECTION_CATEGORY_TYPE : uint8_t
	{
		NORMAL_CATEGORY                = 0,
		BOOKMARK_CATEGORY              = 1,
		EndEnum                        = 2,
		E_ITEM_COLLECTION_CATEGORY_MAX = 3
	};

	/**
	 * Enum MirM.E_MON_DIC_CATEGORY_TYPE
	 */
	enum class E_MON_DIC_CATEGORY_TYPE : uint8_t
	{
		LOCAL_CATEGORY         = 0,
		BOOKMARK_CATEGORY      = 1,
		EndEnum                = 2,
		E_MON_DIC_CATEGORY_MAX = 3
	};

	/**
	 * Enum MirM.E_CUSTOMIZING_TYPE
	 */
	enum class E_CUSTOMIZING_TYPE : uint8_t
	{
		HEAD              = 0,
		HAIR              = 1,
		BODY              = 2,
		WEAPON            = 3,
		WING              = 4,
		CAP               = 5,
		EndEnum           = 6,
		E_CUSTOMIZING_MAX = 7
	};

	/**
	 * Enum MirM.E_HOW_USE
	 */
	enum class E_HOW_USE : uint8_t
	{
		NONE       = 0,
		PUT_ON     = 1,
		POSSESSION = 2,
		EndEnum    = 3,
		E_HOW_MAX  = 4
	};

	/**
	 * Enum MirM.E_TITLE_GRADE
	 */
	enum class E_TITLE_GRADE : uint8_t
	{
		NONE        = 0,
		GRADE3      = 1,
		GRADE2      = 2,
		GRADE1      = 3,
		EndEnum     = 4,
		E_TITLE_MAX = 5
	};

	/**
	 * Enum MirM.E_TITLE_CONDITION_TYPE
	 */
	enum class E_TITLE_CONDITION_TYPE : uint8_t
	{
		NONE                       = 0,
		LEVEL                      = 1,
		MONSTER_KILL_ID            = 2,
		MONSTER_TOTAL_KILL         = 3,
		QUEST_CLEAR_ID             = 4,
		QUEST_CLEAR_COUNT          = 5,
		WEAPON_REINFORCE_STEP      = 6,
		ARMOR_REINFORCE_STEP       = 7,
		ACCESSORY_REINFORCE_STEP   = 8,
		SKILL_TOTAL_LEVEL          = 9,
		PVP_WIN_COUNT              = 10,
		PVP_LOSE_COUNT             = 11,
		PK_KILL_COUNT              = 12,
		GUILD_BATTLE_WIN_COUNT     = 13,
		CASTLE_GUILD_MASTER        = 14,
		CASTLE_GUILD_MEMBER        = 15,
		AREA_OCCUPATION            = 16,
		USED_GOODS                 = 17,
		ITEM_BOOK_ID               = 18,
		COMPLETE_ITEM_BOOK_GRADE   = 19,
		COMPLETE_ITEM_BOOK_ALL     = 20,
		MONSTER_BOOK_ID            = 21,
		COMPLETE_MONSTER_BOOK_AREA = 22,
		COMPLETE_MONSTER_BOOK_ALL  = 23,
		PROFESION_COUNT            = 24,
		PROFESION_LEVEL            = 25,
		COMPLETED_TITLE_COUNT      = 26,
		PVP_RANK                   = 27,
		CHARACTER_RANK             = 28,
		GUILD_RANK                 = 29,
		GUILD_REPUTATION_RANK      = 30,
		GUILD_OCCUPATION_CASTLE    = 31,
		GUILD_OCCUPATION_AREA      = 32,
		ACCESS_TIME                = 33,
		EndEnum                    = 34,
		E_TITLE_CONDITION_MAX      = 35
	};

	/**
	 * Enum MirM.E_DINNER_GRADE
	 */
	enum class E_DINNER_GRADE : uint8_t
	{
		NORMAL       = 0,
		HIGH         = 1,
		BEST         = 2,
		EndEnum      = 3,
		E_DINNER_MAX = 4
	};

	/**
	 * Enum MirM.E_BOX_TYPE
	 */
	enum class E_BOX_TYPE : uint8_t
	{
		NONE      = 0,
		SELECT    = 1,
		RANDOM    = 2,
		ALL       = 3,
		EndEnum   = 4,
		E_BOX_MAX = 5
	};

	/**
	 * Enum MirM.E_BOX_GOODS_TYPE
	 */
	enum class E_BOX_GOODS_TYPE : uint8_t
	{
		NONE            = 0,
		GOODS           = 1,
		PET             = 2,
		ITEM            = 3,
		AVATAR          = 4,
		REFLECTION      = 5,
		EndEnum         = 6,
		E_BOX_GOODS_MAX = 7
	};

	/**
	 * Enum MirM.E_TREASURE_TYPE
	 */
	enum class E_TREASURE_TYPE : uint8_t
	{
		TREASUREBOX     = 0,
		GOLDTREASUREBOX = 1,
		RAIDTREASUREBOX = 2,
		EndEnum         = 3,
		E_TREASURE_MAX  = 4
	};

	/**
	 * Enum MirM.E_ITEMGIVE_TYPE
	 */
	enum class E_ITEMGIVE_TYPE : uint8_t
	{
		FIELD          = 0,
		INVENTORY      = 1,
		EndEnum        = 2,
		E_ITEMGIVE_MAX = 3
	};

	/**
	 * Enum MirM.E_BOXRESPAWN_TYPE
	 */
	enum class E_BOXRESPAWN_TYPE : uint8_t
	{
		RESPAWNTIME      = 0,
		TERMTIME         = 1,
		EndEnum          = 2,
		E_BOXRESPAWN_MAX = 3
	};

	/**
	 * Enum MirM.E_GET_TYPE
	 */
	enum class E_GET_TYPE : uint8_t
	{
		ITEMUSE         = 0,
		SIEGEMASTER     = 1,
		TERRITORYMASTER = 2,
		EndEnum         = 3,
		E_GET_MAX       = 4
	};

	/**
	 * Enum MirM.E_PROPERTYTYPE
	 */
	enum class E_PROPERTYTYPE : uint8_t
	{
		FIRE    = 0,
		WATER   = 1,
		WIND    = 2,
		EARTH   = 3,
		EndEnum = 4,
		E_MAX   = 5
	};

	/**
	 * Enum MirM.E_CONTENTS_TYPE
	 */
	enum class E_CONTENTS_TYPE : uint8_t
	{
		NONE             = 0,
		POINTPOSITION    = 1,
		GATE             = 2,
		NPC              = 3,
		COLLECT          = 4,
		MONSTERGROUP     = 5,
		MONSTER          = 6,
		TRRIGER          = 7,
		FISHING          = 8,
		AREAARROW        = 9,
		SIEGETOWERGATE   = 10,
		ACHER            = 11,
		BARRICADE        = 12,
		GUARDTOWER       = 13,
		SEIGEWALL        = 14,
		TREASUREBOX      = 15,
		RANGECHECK       = 16,
		BASE             = 17,
		BOTSPAWN         = 18,
		OCCUPATION       = 19,
		LIGHTNING        = 20,
		RANDOMPOSITION   = 21,
		GUARDSTONE       = 22,
		LORDSTATUE       = 23,
		OCCUPATION_TOWER = 24,
		SEALDEVICE       = 25,
		DEMONSUMMON      = 26,
		STREETSTALL      = 27,
		EndEnum          = 28,
		E_CONTENTS_MAX   = 29
	};

	/**
	 * Enum MirM.E_SUMMON_METHOD
	 */
	enum class E_SUMMON_METHOD : uint8_t
	{
		NONE         = 0,
		HOST         = 1,
		TRIGGER      = 2,
		EndEnum      = 3,
		E_SUMMON_MAX = 4
	};

	/**
	 * Enum MirM.E_LOG_TYPE
	 */
	enum class E_LOG_TYPE : uint8_t
	{
		NONE       = 0,
		TOWN_LOG   = 1,
		TOWN_LOG01 = 2,
		TOWN_LOG02 = 3,
		TOWN_LOG03 = 4,
		TOWN_LOG04 = 5,
		TOWN_LOG05 = 6,
		TOWN_LOG06 = 7,
		TOWN_LOG07 = 8,
		TOWN_LOG08 = 9,
		TOWN_LOG09 = 10,
		TOWN_LOG10 = 11,
		TOWN_LOG11 = 12,
		TOWN_LOG12 = 13,
		TOWN_LOG13 = 14,
		TOWN_LOG14 = 15,
		TOWN_LOG15 = 16,
		TOWN_LOG16 = 17,
		TOWN_LOG17 = 18,
		TOWN_LOG18 = 19,
		TOWN_LOG19 = 20,
		TOWN_LOG20 = 21,
		TOWN_LOG21 = 22,
		EndEnum    = 23,
		E_LOG_MAX  = 24
	};

	/**
	 * Enum MirM.E_ARSENAL_CATEGORY
	 */
	enum class E_ARSENAL_CATEGORY : uint8_t
	{
		NONE          = 0,
		RAM           = 1,
		SIEGETOWER    = 2,
		CATAPULT      = 3,
		ARCHERSTONE   = 4,
		GUARDMONSTER  = 5,
		BARRICADE     = 6,
		EndEnum       = 7,
		E_ARSENAL_MAX = 8
	};

	/**
	 * Enum MirM.E_TOWN_MENU
	 */
	enum class E_TOWN_MENU : uint8_t
	{
		NONE            = 0,
		TOWN_HOME       = 1,
		TOWN_DUNGEON    = 2,
		TOWN_STORAGE    = 3,
		TRAININGCENTER  = 4,
		QUEST_OFFICE    = 5,
		TOWN_BLACKSMITH = 6,
		TOWN_ALCHEMY    = 7,
		TOWN_COOKING    = 8,
		TOWN_ARSENAL    = 9,
		TOWN_ORCHARD    = 10,
		TOWN_GROVE      = 11,
		TOWN_FARM       = 12,
		TOWN_DINNER     = 13,
		EndEnum         = 14,
		E_TOWN_MAX      = 15
	};

	/**
	 * Enum MirM.E_TOWN_TYPE
	 */
	enum class E_TOWN_TYPE : uint8_t
	{
		NONE        = 0,
		KING        = 1,
		CONTRIBUTOR = 2,
		FIRST       = 3,
		SECOND      = 4,
		THIRD       = 5,
		EndEnum     = 6,
		E_TOWN_MAX  = 7
	};

	/**
	 * Enum MirM.E_SIEGE_TYPE
	 */
	enum class E_SIEGE_TYPE : uint8_t
	{
		NONE        = 0,
		SABUK       = 1,
		KILUNG      = 2,
		EndEnum     = 3,
		E_SIEGE_MAX = 4
	};

	/**
	 * Enum MirM.E_SIEGE_OBJECT_TYPE
	 */
	enum class E_SIEGE_OBJECT_TYPE : uint8_t
	{
		NONE               = 0,
		RAM                = 1,
		SIEGETOWER         = 2,
		CATAPULT           = 3,
		WALL               = 4,
		GATE               = 5,
		GUARDTOWER         = 6,
		BARRICADE          = 7,
		ARCHER             = 8,
		DEFENCEMONSTER     = 9,
		EndEnum            = 10,
		E_SIEGE_OBJECT_MAX = 11
	};

	/**
	 * Enum MirM.E_TAX_RATE_CASTLE_TYPE
	 */
	enum class E_TAX_RATE_CASTLE_TYPE : uint8_t
	{
		NONE                  = 0,
		SABUK                 = 1,
		KIGYRUNG              = 2,
		EndEnum               = 3,
		E_TAX_RATE_CASTLE_MAX = 4
	};

	/**
	 * Enum MirM.E_END_REWARD_TYPE
	 */
	enum class E_END_REWARD_TYPE : uint8_t
	{
		NONE             = 0,
		ACCRUEDAMAGE     = 1,
		JOIN             = 2,
		CLEAR            = 3,
		EndEnum          = 4,
		E_END_REWARD_MAX = 5
	};

	/**
	 * Enum MirM.E_GUILD_QUEST_SUB_TYPE
	 */
	enum class E_GUILD_QUEST_SUB_TYPE : uint8_t
	{
		NONE       = 0,
		CONTRIBUTE = 1,
		BATTLE     = 2,
		HUNT       = 3,
		VILLA      = 4,
		MAX        = 5,
		EndEnum    = 6
	};

	/**
	 * Enum MirM.E_GUILD_QUEST_TYPE
	 */
	enum class E_GUILD_QUEST_TYPE : uint8_t
	{
		NONE        = 0,
		GUILD       = 1,
		MASTERORDER = 2,
		QUESTOFFICE = 3,
		MAX         = 4,
		EndEnum     = 5
	};

	/**
	 * Enum MirM.E_CONDITION_VALUE
	 */
	enum class E_CONDITION_VALUE : uint8_t
	{
		NONE            = 0,
		SIEGE           = 1,
		EndEnum         = 2,
		E_CONDITION_MAX = 3
	};

	/**
	 * Enum MirM.E_CONDITION_TYPE
	 */
	enum class E_CONDITION_TYPE : uint8_t
	{
		NONE            = 0,
		MAP             = 1,
		EndEnum         = 2,
		E_CONDITION_MAX = 3
	};

	/**
	 * Enum MirM.E_GUILDSKILL_TYPE
	 */
	enum class E_GUILDSKILL_TYPE : uint8_t
	{
		NONE             = 0,
		GUILDPASSIVE     = 1,
		GUILDBUFF        = 2,
		EndEnum          = 3,
		E_GUILDSKILL_MAX = 4
	};

	/**
	 * Enum MirM.E_PARTY_CHECK
	 */
	enum class E_PARTY_CHECK : uint8_t
	{
		ALL         = 0,
		SINGLE      = 1,
		PARTY       = 2,
		EndEnum     = 3,
		E_PARTY_MAX = 4
	};

	/**
	 * Enum MirM.E_GROUP_CHECK
	 */
	enum class E_GROUP_CHECK : uint8_t
	{
		NONE        = 0,
		GUILD       = 1,
		CASTLE      = 2,
		EndEnum     = 3,
		E_GROUP_MAX = 4
	};

	/**
	 * Enum MirM.E_DUNGEON_DIFFICULTY
	 */
	enum class E_DUNGEON_DIFFICULTY : uint8_t
	{
		NONE          = 0,
		NORMAL        = 1,
		HARD          = 2,
		HELL          = 3,
		EndEnum       = 4,
		E_DUNGEON_MAX = 5
	};

	/**
	 * Enum MirM.E_DUNGEON_ENTRANCE_TYPE
	 */
	enum class E_DUNGEON_ENTRANCE_TYPE : uint8_t
	{
		NONE                   = 0,
		CONTACT                = 1,
		BUTTON                 = 2,
		QUEST                  = 3,
		EndEnum                = 4,
		E_DUNGEON_ENTRANCE_MAX = 5
	};

	/**
	 * Enum MirM.E_DUNGEON_CLEAR_TYPE
	 */
	enum class E_DUNGEON_CLEAR_TYPE : uint8_t
	{
		NONE                = 0,
		ENDTIME             = 1,
		OBJECT              = 2,
		ALLKILL             = 3,
		DIE                 = 4,
		EndEnum             = 5,
		E_DUNGEON_CLEAR_MAX = 6
	};

	/**
	 * Enum MirM.E_DUNGEON_TYPE
	 */
	enum class E_DUNGEON_TYPE : uint8_t
	{
		NONE            = 0,
		BOSSDUNGEON     = 1,
		ILLUSIONDUNGEON = 2,
		MONARCHDUNGEON  = 3,
		SIEGE           = 4,
		STORYDUNGEON    = 5,
		GUILDOFFICE     = 6,
		GUILDDUNGEON    = 7,
		CASTLEDUNGEON   = 8,
		GUILDSHIPWAR    = 9,
		ARENABATTLE     = 10,
		EndEnum         = 11,
		E_DUNGEON_MAX   = 12
	};

	/**
	 * Enum MirM.E_STORAGE_BUY_TYPE
	 */
	enum class E_STORAGE_BUY_TYPE : uint8_t
	{
		NONE     = 0,
		PURCHASE = 1,
		RENTAL   = 2,
		MAX      = 3,
		EndEnum  = 4
	};

	/**
	 * Enum MirM.E_STORAGE_TYPE
	 */
	enum class E_STORAGE_TYPE : uint8_t
	{
		NONE       = 0,
		CHARACTER  = 1,
		ACCOUNT    = 2,
		GUILDSHARE = 3,
		TREASURE   = 4,
		MAX        = 5,
		EndEnum    = 6
	};

	/**
	 * Enum MirM.E_KEEP_UP_TYPE
	 */
	enum class E_KEEP_UP_TYPE : uint8_t
	{
		NONE          = 0,
		NORMAL        = 1,
		KEEP_DEATH    = 2,
		KEEP_CLOSE    = 3,
		DEPEND_AREA   = 4,
		KEEP_DURATION = 5,
		EndEnum       = 6,
		E_KEEP_UP_MAX = 7
	};

	/**
	 * Enum MirM.E_NOTI_TYPE
	 */
	enum class E_NOTI_TYPE : uint8_t
	{
		NONE                            = 0,
		EQUIP_CHANGE                    = 1,
		INVEN_SLOT                      = 2,
		INVEN_WEIGHT                    = 3,
		SKILL_LEARN                     = 4,
		SKILL_UPGRADE                   = 5,
		ACUPOINT_UPGRADE                = 6,
		MERIDIAN_UPGRADE                = 7,
		EXCHANGE_CALCULATE              = 8,
		EXCHANGE_RECEIVE                = 9,
		EXCHANGE_EXPIRE                 = 10,
		MAIL_NEW                        = 11,
		FORCESKILL_LEARN                = 12,
		FORCESKILL_UPGRADE              = 13,
		GUILDDUNGEON_OPEN               = 14,
		GUILD_QUEST                     = 15,
		TREASERSTORAGE_AUCTIONFAIL      = 16,
		TREASERSTORAGE_AUCTIONSUCCESS   = 17,
		GUILD_ORDERQUEST                = 18,
		ITEM_COLLECTION                 = 19,
		PET_COLLECTION                  = 20,
		MONSTER_DICTIONARY              = 21,
		ADVENTUREBOOK                   = 22,
		ADVENTUREBOOK_REWARD            = 23,
		EQUIPSTONE_SLOTADD              = 24,
		EQUIPSTONE_EQUIP                = 25,
		EQUIPSTONE_UPGRADE              = 26,
		WANTED_MURDER_SUCCESS           = 27,
		WANTED_MURDER_FAIL              = 28,
		WANTED_MURDER_REWARD            = 29,
		REINFORCE_MATERIAL_MIX          = 30,
		EQUIP_LUCK                      = 31,
		EQUIP_ENCHANT                   = 32,
		TITLE_NEW                       = 33,
		FRIEND_NEW                      = 34,
		PK_REVENGE_NEW                  = 35,
		CHAT_WHISPER_NEW                = 36,
		CASHSHOP_LOGIN_PACKAGE1         = 37,
		CASHSHOP_LOGIN_PACKAGE2         = 38,
		CASHSHOP_LOGIN_PACKAGE3         = 39,
		CASHSHOP_GROWTH_PACKAGE1        = 40,
		CASHSHOP_GROWTH_PACKAGE2        = 41,
		CASHSHOP_GROWTH_PACKAGE3        = 42,
		CASHSHOP_DUNGEON_PACKAGE1       = 43,
		CASHSHOP_DUNGEON_PACKAGE2       = 44,
		CASHSHOP_DUNGEON_PACKAGE3       = 45,
		CASHSHOP_DAILY_PACKAGE1         = 46,
		CASHSHOP_DAILY_PACKAGE2         = 47,
		CASHSHOP_DAILY_PACKAGE3         = 48,
		CASHSHOP_CART                   = 49,
		CRAFT_POSSIBLE                  = 50,
		INVEN_EQUIP                     = 51,
		INVEN_DRAGONSTONE               = 52,
		INVEN_COSTUME                   = 53,
		INVEN_ETC                       = 54,
		MAIL_REWARD                     = 55,
		NEW_PET                         = 56,
		VEHICLE_NEW                     = 57,
		VEHICLE_SUMMON                  = 58,
		VEHICLE_EQUIPMENT               = 59,
		QUEST_MAIN_UNLOCK               = 60,
		QUEST_SUB_UNLOCK                = 61,
		QUEST_AREA_UNLOCK               = 62,
		QUEST_MAIN_COMPLETE             = 63,
		QUEST_SUB_COMPLETE              = 64,
		QUEST_AREA_COMPLETE             = 65,
		PARTY_NEW                       = 66,
		SUBSCRIPTION_ACTIVATE           = 67,
		SYSTEM_UNLOCK_EVENT             = 68,
		SYSTEM_UNLOCK_SHOP              = 69,
		SYSTEM_UNLOCK_NOTI              = 70,
		SYSTEM_UNLOCK_INVEN             = 71,
		SYSTEM_UNLOCK_MAIL              = 72,
		SYSTEM_UNLOCK_SUBQUEST          = 73,
		SYSTEM_UNLOCK_AREAQUEST         = 74,
		SYSTEM_UNLOCK_GUIDE             = 75,
		SYSTEM_UNLOCK_REINFORCE         = 76,
		SYSTEM_UNLOCK_ENCHANT           = 77,
		SYSTEM_UNLOCK_LUCK              = 78,
		SYSTEM_UNLOCK_SKILL             = 79,
		SYSTEM_UNLOCK_PASSIVE           = 80,
		SYSTEM_UNLOCK_MERIDIANS         = 81,
		SYSTEM_UNLOCK_VEHICLE           = 82,
		SYSTEM_UNLOCK_PET               = 83,
		SYSTEM_UNLOCK_EQUIPSTONE        = 84,
		SYSTEM_UNLOCK_BOSS              = 85,
		SYSTEM_UNLOCK_WORLDBOSS         = 86,
		SYSTEM_UNLOCK_DUNGEONBOSS       = 87,
		SYSTEM_UNLOCK_DUNGEONCASTLE     = 88,
		SYSTEM_UNLOCK_DUNGEONMONARCH    = 89,
		SYSTEM_UNLOCK_PVP               = 90,
		SYSTEM_UNLOCK_RANK              = 91,
		SYSTEM_UNLOCK_TITLE             = 92,
		SYSTEM_UNLOCK_COLLECTION        = 93,
		SYSTEM_UNLOCK_FRIEND            = 94,
		SYSTEM_UNLOCK_MENTOR            = 95,
		SYSTEM_UNLOCK_GUILD             = 96,
		SYSTEM_UNLOCK_TRADE             = 97,
		SYSTEM_UNLOCK_CRAFT             = 98,
		SYSTEM_UNLOCK_STORAGE           = 99,
		INTIMACY_GIFT                   = 100,
		TOWN_DINNER_OPEN                = 101,
		AVATAR_NEW                      = 102,
		PK_REVENGE_REGISTER             = 103,
		PK_WANTED_NEW                   = 104,
		EVENT_NEW                       = 105,
		GUILDSTORGE_NEWREQUEST          = 106,
		SYSTEM_UNLOCK_AREACOLLECTION    = 107,
		SYSTEM_UNLOCK_MONSTERCOLLECTION = 108,
		SYSTEM_UNLOCK_PETCOLLECTION     = 109,
		SYSTEM_UNLOCK_ITEMCOLLECTION    = 110,
		SYSTEM_UNLOCK_AVATAR            = 111,
		SYSTEM_UNLOCK_SIEGE             = 112,
		EVENT_REWARD                    = 113,
		GUILD_DONATION                  = 114,
		MATERIALSTORAGE_DONATION        = 115,
		TREASERSTORAGE_AUCTIONEND       = 116,
		MENTOR_REQUEST_NEW              = 117,
		MENTOR_NEW                      = 118,
		TREASERSTORAGE_AUCTION          = 119,
		FORCESKILL_POTION_MAKING        = 120,
		SYSTEM_UNLOCK_WORSHIP           = 121,
		SYSTEM_UNLOCK_MANDALA           = 122,
		SYSTEM_UNLOCK_MASTERMANDALA     = 123,
		SYSTEM_UNLOCK_ARENA             = 124,
		SYSTEM_UNLOCK_SECRETVALLEY      = 125,
		SYSTEM_UNLOCK_ILLUSIONDUNGEON   = 126,
		SYSTEM_UNLOCK_SEALTOWER         = 127,
		SYSTEM_UNLOCK_DEMONTOWER        = 128,
		SYSTEM_UNLOCK_DREAMTOWER        = 129,
		SYSTEM_UNLOCK_PROFESION         = 130,
		PROFESION_ALCHEMY_UPGRADE       = 131,
		PROFESION_BLACKSMITH_UPGRADE    = 132,
		PROFESION_GATHER_UPGRADE        = 133,
		PROFESION_MINING_UPGRADE        = 134,
		PROFESION_FISHING_UPGRADE       = 135,
		PROFESION_ENCHANT_UPGRADE       = 136,
		PROFESION_HANDWORK_UPGRADE      = 137,
		PROFESION_LUCK_UPGRADE          = 138,
		PROFESION_REINFORCE_UPGRADE     = 139,
		AVATAR_REPLACE                  = 140,
		AVATAR_MIX                      = 141,
		PET_MIX                         = 142,
		EQUIPSTONE_MIX                  = 143,
		ACHIEVE_NEW                     = 144,
		SYSTEM_UNLOCK_ACHIEVE           = 145,
		PET_REPLACE                     = 146,
		ITEM_EVENT_COLLECTION           = 147,
		WEAPONSTONE                     = 148,
		ARMORSTONE                      = 149,
		ACCESSORYSTONE                  = 150,
		MANDALASTONE                    = 151,
		CASHSHOP_DAILY_PACKAGE4         = 152,
		CASHSHOP_DAILY_PACKAGE5         = 153,
		CASHSHOP_DAILY_PACKAGE6         = 154,
		CASHSHOP_DAILY_PACKAGE7         = 155,
		CASHSHOP_DAILY_PACKAGE8         = 156,
		CASHSHOP_DAILY_PACKAGE9         = 157,
		CASHSHOP_DAILY_PACKAGE10        = 158,
		MAX                             = 159,
		EndEnum                         = 160
	};

	/**
	 * Enum MirM.E_GROWTH_TYPE
	 */
	enum class E_GROWTH_TYPE : uint8_t
	{
		NONE                = 0,
		ITEMPOWER           = 1,
		ITEMREINFORCE       = 2,
		ITEMENCHANT         = 3,
		LUCK                = 4,
		GEMPOWER            = 5,
		SKILLGROWTH         = 6,
		MANDALA             = 7,
		MERIDIANSKILLGROWTH = 8,
		FORCEGROWTH         = 9,
		FORCESKILLGROWTH    = 10,
		MONSTERCOLLECTION   = 11,
		EQUIPCOLLECTION     = 12,
		PETCOLLECTION       = 13,
		MAX                 = 14,
		EndEnum             = 15
	};

	/**
	 * Enum MirM.E_INITIALIZE_TYPE
	 */
	enum class E_INITIALIZE_TYPE : uint8_t
	{
		SKILL      = 0,
		EQUIP      = 1,
		INVENTORY  = 2,
		MAIL       = 3,
		REFLECTION = 4,
		MAX        = 5,
		EndEnum    = 6
	};

	/**
	 * Enum MirM.E_AVATARSCROLL_TYPE
	 */
	enum class E_AVATARSCROLL_TYPE : uint8_t
	{
		COMMON             = 0,
		INSTANT            = 1,
		EndEnum            = 2,
		E_AVATARSCROLL_MAX = 3
	};

	/**
	 * Enum MirM.E_VEHICLEEQUIPMENT_TYPE
	 */
	enum class E_VEHICLEEQUIPMENT_TYPE : uint8_t
	{
		VISOR   = 0,
		REINS   = 1,
		HEELED  = 2,
		SADDLE  = 3,
		MAX     = 4,
		EndEnum = 5
	};

	/**
	 * Enum MirM.E_SPAWN_TYPE
	 */
	enum class E_SPAWN_TYPE : uint8_t
	{
		NONE      = 0,
		MONSTER   = 1,
		NPC_TABLE = 2,
		MAX       = 3,
		EndEnum   = 4
	};

	/**
	 * Enum MirM.E_GUILDITEM_TYPE
	 */
	enum class E_GUILDITEM_TYPE : uint8_t
	{
		RAM            = 0,
		SIEGETOWER     = 1,
		CATAPULT       = 2,
		ARCHERSTONE    = 3,
		CASTLEGUARDIAN = 4,
		BARRICADE      = 5,
		MAX            = 6,
		EndEnum        = 7
	};

	/**
	 * Enum MirM.E_TICKET_TYPE
	 */
	enum class E_TICKET_TYPE : uint8_t
	{
		BOSSDUNGEONTICKET    = 0,
		MONARCHDUNGEONTICKET = 1,
		GUILDDUNGEONTICKET   = 2,
		CASTLEDUNGEOUN       = 3,
		BOSSDUNGEONTICKET15  = 4,
		MAX                  = 5,
		EndEnum              = 6
	};

	/**
	 * Enum MirM.E_ETC_TYPE
	 */
	enum class E_ETC_TYPE : uint8_t
	{
		QUEST      = 0,
		JUNK       = 1,
		RELIC      = 2,
		SEALCOIN   = 3,
		DEMONSTONE = 4,
		MAX        = 5,
		EndEnum    = 6
	};

	/**
	 * Enum MirM.E_CRAFTMATERIAL_TYPE
	 */
	enum class E_CRAFTMATERIAL_TYPE : uint8_t
	{
		WOOD                 = 0,
		FISH                 = 1,
		ORE                  = 2,
		SKIN                 = 3,
		METAL                = 4,
		ALCHEMY_MATERIALS    = 5,
		HANDWORK_MATERIALS   = 6,
		BLACKSMITH_MATERIALS = 7,
		COMMON               = 8,
		MAX                  = 9,
		EndEnum              = 10
	};

	/**
	 * Enum MirM.E_EQUIPSTONE_TYPE
	 */
	enum class E_EQUIPSTONE_TYPE : uint8_t
	{
		WEAPONSTONE    = 0,
		ARMORSTONE     = 1,
		ACCESSORYSTONE = 2,
		MANDALASTONE   = 3,
		MAX            = 4,
		EndEnum        = 5
	};

	/**
	 * Enum MirM.E_MATERIAL_TYPE
	 */
	enum class E_MATERIAL_TYPE : uint8_t
	{
		LUCK                      = 0,
		ENCHANTMATERIAL           = 1,
		SKILLBOOK                 = 2,
		NORMAL_ESSENCE            = 3,
		UNIQUE_ESSENCE            = 4,
		NORMAL_CORE               = 5,
		UNIQUE_CORE               = 6,
		NEEDLE                    = 7,
		REINFORCESTONE            = 8,
		FORCESKILLBOOK            = 9,
		FORCESKILLBOOKSTONENORMAL = 10,
		FORCESKILLBOOKSTONERARE   = 11,
		FORCESKILLBOOKSTONEUNIQUE = 12,
		MIR_SOUL                  = 13,
		PILL                      = 14,
		EQUIPSTONE_MATERIAL       = 15,
		VEHICLE_PET_FOOD          = 16,
		REINFORCEACCSTONE         = 17,
		REINFORCEACCBLESSSTONE    = 18,
		FORCESKILLUSEMATERIAL     = 19,
		MANDALAACTIVATE           = 20,
		MANDALARESET              = 21,
		MANDALALAYERMOVE          = 22,
		SPECIALMOVE_SKILLBOOK     = 23,
		SPECIALMOVE_MATERIAL      = 24,
		TONIC_CHARGE              = 25,
		MAX                       = 26,
		EndEnum                   = 27
	};

	/**
	 * Enum MirM.E_CONSUME_TYPE
	 */
	enum class E_CONSUME_TYPE : uint8_t
	{
		INVENTOTYEXTEND                       = 0,
		WEIGHTEXTEND                          = 1,
		REPUTERECOVER                         = 2,
		REVIVAL                               = 3,
		DROPPROTECT                           = 4,
		REPAIR                                = 5,
		HPPOTION                              = 6,
		MPPOTION                              = 7,
		BATTLEBUFFPOTION                      = 8,
		GROWTHBUFFPOTION                      = 9,
		FORCE_EXPBUFFPOTION                   = 10,
		SKILL_EXPBUFFPOTION                   = 11,
		BOX                                   = 12,
		RECIPE                                = 13,
		FOOD                                  = 14,
		GUILDEXPPOTION                        = 15,
		ACUPOINTSMATERIAL                     = 16,
		MERIDIANSMATERIAL                     = 17,
		VEHICLE                               = 18,
		TRACE                                 = 19,
		LOSTSTORY                             = 20,
		MOVEITEM                              = 21,
		TELEPORTITEM                          = 22,
		CHAREXP                               = 23,
		SUBSCRIPTION                          = 24,
		CRI_RATE_BUFFPOTION                   = 25,
		ACCURACY_BUFFPOTION                   = 26,
		PATK_BUFFPOTION                       = 27,
		MATK_BUFFPOTION                       = 28,
		ALL_ATK_BUFFPOTION                    = 29,
		ATK_SPEED_BUFFPOTION                  = 30,
		EVADE_BUFFPOTION                      = 31,
		PDEF_BUFFPOTION                       = 32,
		MDEF_BUFFPOTION                       = 33,
		ALL_DEF_BUFFPOTION                    = 34,
		EXP_GET_INCREASE_BUFFPOTION           = 35,
		SKILLEXP_GET_INCREASE_BUFFPOTION      = 36,
		FORCEEXP_GET_INCREASE_BUFFPOTION      = 37,
		FORCESKILLEXP_GET_INCREASE_BUFFPOTION = 38,
		QUEST_START                           = 39,
		ILLUSIONDUNGEON_RECHARGE1             = 40,
		ILLUSIONDUNGEON_RECHARGE2             = 41,
		ILLUSIONDUNGEON_RECHARGE3             = 42,
		ILLUSIONDUNGEON_RECHARGE4             = 43,
		STACK_ITEM                            = 44,
		FORCE_BUFFPOTION                      = 45,
		TITLE                                 = 46,
		MANDALASTONE_BOX                      = 47,
		WEAPONSTONE_BOX                       = 48,
		ARMORSTONE_BOX                        = 49,
		ACCESSORYSTONE_BOX                    = 50,
		EXP_RESTORE_ITEM                      = 51,
		RARE_HPPOTION                         = 52,
		RARE_MPPOTION                         = 53,
		EQUIPSTONE_BOX                        = 54,
		MAX                                   = 55,
		EndEnum                               = 56
	};

	/**
	 * Enum MirM.E_COSTUME_TYPE
	 */
	enum class E_COSTUME_TYPE : uint8_t
	{
		ARMS_COSTUME = 0,
		BODY_COSTUME = 1,
		CAP_COSTUME  = 2,
		MAX          = 3,
		EndEnum      = 4
	};

	/**
	 * Enum MirM.E_EQUIPMENT_TYPE
	 */
	enum class E_EQUIPMENT_TYPE : uint8_t
	{
		ARMOR                  = 0,
		HEAD                   = 1,
		HAIR                   = 2,
		WEAPON                 = 3,
		WING                   = 4,
		HELMET                 = 5,
		SHOES                  = 6,
		NECKLACE               = 7,
		RINGS                  = 8,
		BELT                   = 9,
		BRACELET               = 10,
		COLLECT_FISHING_ROD    = 11,
		COLLECT_MINING_PICKAXE = 12,
		COLLECT_FELLING_AXE    = 13,
		MAX                    = 14,
		EndEnum                = 15
	};

	/**
	 * Enum MirM.E_GOODS_TYPE
	 */
	enum class E_GOODS_TYPE : uint8_t
	{
		LEVEL            = 0,
		EXP              = 1,
		GOLD             = 2,
		CASH             = 3,
		REPUTEPOINT      = 4,
		GOLDINGOT        = 5,
		CONDITION_BAG    = 6,
		CONDITION        = 7,
		TELEPORT         = 8,
		TREASUREBOXKEY   = 9,
		GUILDPOINT       = 10,
		GUILDGOLD        = 11,
		BOSS_POINT       = 12,
		FORCEEXP         = 13,
		PKPOINT          = 14,
		MENTORPOINT      = 15,
		LOGOUTBATTLETIME = 16,
		PAY_CASH         = 17,
		MILEAGE          = 18,
		BLESSPOINT       = 19,
		BLACKIRON        = 20,
		GUILD_BLACKIRON  = 21,
		SEALTOWERCOIN    = 22,
		DEMONTOWERCOIN   = 23,
		GUILD_GOLDINGOT  = 24,
		CONCENTRATION    = 25,
		MAX              = 26,
		EndEnum          = 27
	};

	/**
	 * Enum MirM.E_ITEM_MAINTYPE
	 */
	enum class E_ITEM_MAINTYPE : uint8_t
	{
		NONE             = 0,
		GOODS            = 1,
		EQUIPMENT        = 2,
		COSTUME          = 3,
		CONSUME          = 4,
		MATERIAL         = 5,
		EQUIPSTONE       = 6,
		CRAFTMATERIAL    = 7,
		ETC              = 8,
		TICKET           = 9,
		SUBEQUIPMENT     = 10,
		GUILDITEM        = 11,
		VEHICLEEQUIPMENT = 12,
		AVATARSCROLL     = 13,
		MAX              = 14,
		EndEnum          = 15
	};

	/**
	 * Enum MirM.E_CHASE_TYPE
	 */
	enum class E_CHASE_TYPE : uint8_t
	{
		NONE              = 0,
		KEEP_CHASE        = 1,
		TARGET_CHANGE     = 2,
		CHANGE_IDLE_STATE = 3,
		EndEnum           = 4,
		E_CHASE_MAX       = 5
	};

	/**
	 * Enum MirM.E_ITEM_LOCATION_TYPE
	 */
	enum class E_ITEM_LOCATION_TYPE : uint8_t
	{
		NONE                   = 0,
		NPC_SHOP               = 1,
		FIELD                  = 2,
		FIELD_MONSTER          = 3,
		FIELD_BOSS             = 4,
		WOLRD_BOSS             = 5,
		DUNGEON_BOSS           = 6,
		DUNGEON_ILLUSION       = 7,
		DUNGEON_MONARCH        = 8,
		DUNGEON_GUILD          = 9,
		DUNGEON_CASTLE         = 10,
		ITEM_CRAFT             = 11,
		QUEST_AREA             = 12,
		LOGGING                = 13,
		MINING                 = 14,
		FISHING                = 15,
		CASH_SHOP              = 16,
		BOSS_SHOP              = 17,
		PVP_SHOP               = 18,
		REINFORCE_MATERIAL     = 19,
		LOCAL_COLLECTION       = 20,
		CASH_SHOP_GOODS        = 21,
		CASH_SHOP_SUMMON       = 22,
		CASH_SHOP_VEHICLE      = 23,
		CASH_SHOP_SUBSCRIPTION = 24,
		CASH_SHOP_CONSUME      = 25,
		FIELD_TREASUREBOX      = 26,
		BOSS_TREASUREBOX       = 27,
		WORLDBOSS_TREASUREBOX  = 28,
		ITEM_CRAFT_GUILDTOWN   = 29,
		GUILDQUEST             = 30,
		MAX                    = 31,
		EndEnum                = 32
	};

	/**
	 * Enum MirM.E_MAIL_TYPE
	 */
	enum class E_MAIL_TYPE : uint8_t
	{
		ACCOUNT    = 0,
		CHARACTER  = 1,
		SERVER     = 2,
		EndEnum    = 3,
		E_MAIL_MAX = 4
	};

	/**
	 * Enum MirM.E_CONDITION_GRADE
	 */
	enum class E_CONDITION_GRADE : uint8_t
	{
		POOL            = 0,
		NORMAL          = 1,
		GOOD            = 2,
		EXCELLENT       = 3,
		EndEnum         = 4,
		E_CONDITION_MAX = 5
	};

	/**
	 * Enum MirM.E_WEAPON_TYPE
	 */
	enum class E_WEAPON_TYPE : uint8_t
	{
		NONE         = 0,
		SWORD        = 1,
		AXE          = 2,
		SPEAR        = 3,
		FAN          = 4,
		STICK        = 5,
		STAFF        = 6,
		EndEnum      = 7,
		E_WEAPON_MAX = 8
	};

	/**
	 * Enum MirM.E_WEAPON_SHAPE_TYPE
	 */
	enum class E_WEAPON_SHAPE_TYPE : uint8_t
	{
		NONE               = 0,
		BLADE              = 1,
		SWORD              = 2,
		AXE                = 3,
		MACE               = 4,
		FAN                = 5,
		STAFF              = 6,
		EndEnum            = 7,
		E_WEAPON_SHAPE_MAX = 8
	};

	/**
	 * Enum MirM.E_DROP_TYPE
	 */
	enum class E_DROP_TYPE : uint8_t
	{
		ADD_CLASS  = 0,
		ONLY_CLASS = 1,
		EndEnum    = 2,
		E_DROP_MAX = 3
	};

	/**
	 * Enum MirM.E_SHOW_TOAST
	 */
	enum class E_SHOW_TOAST : uint8_t
	{
		NONE       = 0,
		TOAST      = 1,
		POPUP      = 2,
		EndEnum    = 3,
		E_SHOW_MAX = 4
	};

	/**
	 * Enum MirM.E_HUNTINGTAG_TYPE
	 */
	enum class E_HUNTINGTAG_TYPE : uint8_t
	{
		NONE             = 0,
		MAP_LEVEL1       = 1,
		MAP_LEVEL2       = 2,
		MAP_LEVEL3       = 3,
		MAP_LEVEL4       = 4,
		MAP_LEVEL5       = 5,
		MAP_LEVEL6       = 6,
		MAP_LEVEL7       = 7,
		MAP_LEVEL8       = 8,
		ARMS             = 9,
		BODY             = 10,
		HELMET           = 11,
		SHOES            = 12,
		BELT             = 13,
		BRACELET         = 14,
		RINGS            = 15,
		NECKLACE         = 16,
		ORE              = 17,
		ENCHANTSTONE     = 18,
		LUCK             = 19,
		EQUIPGEM         = 20,
		SKILLBOOK        = 21,
		FORCE            = 22,
		MERIDIANS        = 23,
		MATERIAL         = 24,
		RECIPE           = 25,
		HPPOTION         = 26,
		MPPOTION         = 27,
		BUFFPOTION       = 28,
		UTILE            = 29,
		EndEnum          = 30,
		E_HUNTINGTAG_MAX = 31
	};

	/**
	 * Enum MirM.E_COLLECTGRADE_TYPE
	 */
	enum class E_COLLECTGRADE_TYPE : uint8_t
	{
		NONE               = 0,
		NORMAL             = 1,
		RARE               = 2,
		UNIQUE             = 3,
		LEGEND             = 4,
		EndEnum            = 5,
		E_COLLECTGRADE_MAX = 6
	};

	/**
	 * Enum MirM.E_REWARDGRADE_TYPE
	 */
	enum class E_REWARDGRADE_TYPE : uint8_t
	{
		NONE              = 0,
		NORMAL            = 1,
		RARE              = 2,
		UNIQUE            = 3,
		LEGEND            = 4,
		EndEnum           = 5,
		E_REWARDGRADE_MAX = 6
	};

	/**
	 * Enum MirM.E_PROFESION_CRAFT
	 */
	enum class E_PROFESION_CRAFT : uint8_t
	{
		NONE            = 0,
		BLACKSMITH      = 1,
		ALCHEMY         = 2,
		COOKING         = 3,
		EndEnum         = 4,
		E_PROFESION_MAX = 5
	};

	/**
	 * Enum MirM.E_PROFESION_UPGRADE
	 */
	enum class E_PROFESION_UPGRADE : uint8_t
	{
		NONE            = 0,
		BLACKSMITH      = 1,
		ALCHEMY         = 2,
		COOKING         = 3,
		EndEnum         = 4,
		E_PROFESION_MAX = 5
	};

	/**
	 * Enum MirM.E_SELECTTYPE
	 */
	enum class E_SELECTTYPE : uint8_t
	{
		AUTO    = 0,
		SELECT  = 1,
		EndEnum = 2,
		E_MAX   = 3
	};

	/**
	 * Enum MirM.E_CLASS_FILTER
	 */
	enum class E_CLASS_FILTER : uint8_t
	{
		NONE        = 0,
		WARRIOR     = 1,
		WIZARD      = 2,
		TAOIST      = 3,
		BARD        = 4,
		HALBARDIER  = 5,
		ALL         = 6,
		MONSTER     = 7,
		ITEM        = 8,
		EndEnum     = 9,
		E_CLASS_MAX = 10
	};

	/**
	 * Enum MirM.E_EXCHANGE_PRICETYPE
	 */
	enum class E_EXCHANGE_PRICETYPE : uint8_t
	{
		NONE           = 0,
		FIXEDPRICE     = 1,
		MINPRICE       = 2,
		EndEnum        = 3,
		E_EXCHANGE_MAX = 4
	};

	/**
	 * Enum MirM.E_PROFESION_CATEGORY
	 */
	enum class E_PROFESION_CATEGORY : uint8_t
	{
		ARMS                 = 0,
		BODY                 = 1,
		HELMET               = 2,
		SHOES                = 3,
		BELT                 = 4,
		SIEGE                = 5,
		POSION               = 6,
		ELIXIR               = 7,
		FEAST                = 8,
		ORE                  = 9,
		ACCESSORY            = 10,
		ADDOPTION_STONE      = 11,
		ADVANCED_MATERIALS   = 12,
		ETC                  = 13,
		SKILLBOOK            = 14,
		BOOKMARK             = 15,
		ARMOR                = 16,
		MOUNT_EQUIP          = 17,
		COLLECT_ARMS         = 18,
		GROWTH_MATERIALS     = 19,
		ALCHEMY_MATERIALS    = 20,
		REINFORCESTONE       = 21,
		HANDWORK_MATERIALS   = 22,
		BLACKSMITH_MATERIALS = 23,
		MAX                  = 24,
		EndEnum              = 25
	};

	/**
	 * Enum MirM.E_PROFESIONTYPE
	 */
	enum class E_PROFESIONTYPE : uint8_t
	{
		ALCHEMY    = 0,
		BLACKSMITH = 1,
		COOKING    = 2,
		GATHER     = 3,
		MINING     = 4,
		LOGGING    = 5,
		FISHING    = 6,
		ENCHANT    = 7,
		HANDWORK   = 8,
		LUCK       = 9,
		REINFORCE  = 10,
		NONE       = 11,
		EndEnum    = 12,
		E_MAX      = 13
	};

	/**
	 * Enum MirM.E_EXCHANGE_TYPE
	 */
	enum class E_EXCHANGE_TYPE : uint8_t
	{
		NONE            = 0,
		EXCHANGE_TYPE1  = 1,
		EXCHANGE_TYPE2  = 2,
		EXCHANGE_TYPE3  = 3,
		EXCHANGE_TYPE4  = 4,
		EXCHANGE_TYPE5  = 5,
		EXCHANGE_TYPE6  = 6,
		EXCHANGE_TYPE7  = 7,
		EXCHANGE_TYPE8  = 8,
		EXCHANGE_TYPE9  = 9,
		EXCHANGE_TYPE10 = 10,
		EXCHANGE_TYPE11 = 11,
		EXCHANGE_TYPE12 = 12,
		EXCHANGE_TYPE13 = 13,
		EXCHANGE_TYPE14 = 14,
		EXCHANGE_TYPE15 = 15,
		EXCHANGE_TYPE16 = 16,
		EXCHANGE_TYPE17 = 17,
		EXCHANGE_TYPE18 = 18,
		EXCHANGE_TYPE19 = 19,
		EXCHANGE_TYPE20 = 20,
		EXCHANGE_TYPE21 = 21,
		EXCHANGE_TYPE22 = 22,
		EXCHANGE_TYPE23 = 23,
		EXCHANGE_TYPE24 = 24,
		EXCHANGE_TYPE25 = 25,
		EXCHANGE_TYPE26 = 26,
		EXCHANGE_TYPE27 = 27,
		EXCHANGE_TYPE28 = 28,
		EXCHANGE_TYPE29 = 29,
		EXCHANGE_TYPE30 = 30,
		EXCHANGE_TYPE31 = 31,
		EXCHANGE_TYPE32 = 32,
		EXCHANGE_TYPE33 = 33,
		EXCHANGE_TYPE34 = 34,
		EXCHANGE_TYPE35 = 35,
		EXCHANGE_TYPE36 = 36,
		EXCHANGE_TYPE37 = 37,
		EXCHANGE_TYPE38 = 38,
		EXCHANGE_TYPE39 = 39,
		EXCHANGE_TYPE40 = 40,
		EXCHANGE_TYPE41 = 41,
		EXCHANGE_TYPE42 = 42,
		EXCHANGE_TYPE43 = 43,
		EXCHANGE_TYPE44 = 44,
		EXCHANGE_TYPE45 = 45,
		EXCHANGE_TYPE46 = 46,
		EXCHANGE_TYPE47 = 47,
		EXCHANGE_TYPE48 = 48,
		EXCHANGE_TYPE49 = 49,
		EXCHANGE_TYPE50 = 50,
		MAX             = 51,
		EndEnum         = 52
	};

	/**
	 * Enum MirM.E_CATEGORY_TYPE
	 */
	enum class E_CATEGORY_TYPE : uint8_t
	{
		NONE           = 0,
		EQUIP_TYPE     = 1,
		ITEM_TYPE      = 2,
		EndEnum        = 3,
		E_CATEGORY_MAX = 4
	};

	/**
	 * Enum MirM.E_CATEGORYBUTTON
	 */
	enum class E_CATEGORYBUTTON : uint8_t
	{
		NONE                = 0,
		EXCHANGE_MAINTYPE1  = 1,
		EXCHANGE_MAINTYPE2  = 2,
		EXCHANGE_MAINTYPE3  = 3,
		EXCHANGE_MAINTYPE4  = 4,
		EXCHANGE_MAINTYPE5  = 5,
		EXCHANGE_MAINTYPE6  = 6,
		EXCHANGE_MAINTYPE7  = 7,
		EXCHANGE_MAINTYPE8  = 8,
		EXCHANGE_MAINTYPE9  = 9,
		EXCHANGE_MAINTYPE10 = 10,
		EXCHANGE_MAINTYPE11 = 11,
		EXCHANGE_MAINTYPE12 = 12,
		EXCHANGE_MAINTYPE13 = 13,
		EXCHANGE_MAINTYPE14 = 14,
		EXCHANGE_MAINTYPE15 = 15,
		EXCHANGE_MAINTYPE16 = 16,
		EXCHANGE_MAINTYPE17 = 17,
		EXCHANGE_MAINTYPE18 = 18,
		EXCHANGE_MAINTYPE19 = 19,
		EXCHANGE_MAINTYPE20 = 20,
		MAX                 = 21,
		EndEnum             = 22
	};

	/**
	 * Enum MirM.E_LOCK_TYPE
	 */
	enum class E_LOCK_TYPE : uint8_t
	{
		NONE       = 0,
		HIDE       = 1,
		LOCK       = 2,
		DISABLE    = 3,
		EndEnum    = 4,
		E_LOCK_MAX = 5
	};

	/**
	 * Enum MirM.E_OPENCONDITION_TYPE
	 */
	enum class E_OPENCONDITION_TYPE : uint8_t
	{
		NONE                = 0,
		LEVEL               = 1,
		TUTORIAL            = 2,
		QUEST               = 3,
		GUILD               = 4,
		GUILD_LV            = 5,
		EndEnum             = 6,
		E_OPENCONDITION_MAX = 7
	};

	/**
	 * Enum MirM.E_IDLE_MOVE_TYPE
	 */
	enum class E_IDLE_MOVE_TYPE : uint8_t
	{
		MOVE            = 0,
		STATIC          = 1,
		RALLY           = 2,
		EndEnum         = 3,
		E_IDLE_MOVE_MAX = 4
	};

	/**
	 * Enum MirM.E_TRIGGER_TYPE
	 */
	enum class E_TRIGGER_TYPE : uint8_t
	{
		TELEPORT                 = 0,
		OPEN                     = 1,
		APPEAR                   = 2,
		DISAPPEAR                = 3,
		SPAWN_OBJECT_PLACEMENT   = 4,
		AI_ACTIVE                = 5,
		DESPAWN_OBJECT_PLACEMENT = 6,
		SPAWN_NPC                = 7,
		DESPAWN_NPC              = 8,
		TALK_SPAWN_NPC           = 9,
		ENTRY_WARP               = 10,
		EndEnum                  = 11,
		E_TRIGGER_MAX            = 12
	};

	/**
	 * Enum MirM.E_CLEAR_TYPE
	 */
	enum class E_CLEAR_TYPE : uint8_t
	{
		NONE        = 0,
		KILL        = 1,
		ALLKILL     = 2,
		COLLECT     = 3,
		TRIGGER     = 4,
		MOVE        = 5,
		EndEnum     = 6,
		E_CLEAR_MAX = 7
	};

	/**
	 * Enum MirM.E_PK_TYPE
	 */
	enum class E_PK_TYPE : uint8_t
	{
		PEACE         = 0,
		CHAO          = 1,
		PARTY         = 2,
		GUILD         = 3,
		GUILD_WARFARE = 4,
		ALL           = 5,
		TRACE_TARGET  = 6,
		EndEnum       = 7,
		E_PK_MAX      = 8
	};

	/**
	 * Enum MirM.E_ABILITY_ACTION_TYPE
	 */
	enum class E_ABILITY_ACTION_TYPE : uint8_t
	{
		NONE                 = 0,
		DASH                 = 1,
		PUSH                 = 2,
		PULL                 = 3,
		SUMMON               = 4,
		PENETRATE            = 5,
		TELEPORT             = 6,
		LEAP_ATTACK          = 7,
		WARP                 = 8,
		EndEnum              = 9,
		E_ABILITY_ACTION_MAX = 10
	};

	/**
	 * Enum MirM.E_MAP_TYPE
	 */
	enum class E_MAP_TYPE : uint8_t
	{
		NORMAL         = 0,
		STORYNORMAL    = 1,
		STORYCOMBAT    = 2,
		BOSS           = 3,
		PARTYDUNGEON   = 4,
		CASTLEDUNGEON  = 5,
		GUILDHOME      = 6,
		GUILDDUNGEON   = 7,
		RAID           = 8,
		SIEGE          = 9,
		TEST           = 10,
		MONARCHDUNGEON = 11,
		ILLUSION       = 12,
		GUILDBATTLE    = 13,
		ARENABATTLE    = 14,
		MINIGAME       = 15,
		EndEnum        = 16,
		E_MAP_MAX      = 17
	};

	/**
	 * Enum MirM.E_ITEMPRIORITY
	 */
	enum class E_ITEMPRIORITY : uint8_t
	{
		NONE          = 0,
		FIRSTATTACKER = 1,
		EndEnum       = 2,
		E_MAX         = 3
	};

	/**
	 * Enum MirM.E_MAINSTATUS
	 */
	enum class E_MAINSTATUS : uint8_t
	{
		NONE       = 0,
		ALL        = 1,
		PATK       = 2,
		MATK       = 3,
		PDEF       = 4,
		MDEF       = 5,
		HP         = 6,
		MP         = 7,
		ACCURACY   = 8,
		EVADE      = 9,
		CRI_RATE   = 10,
		CC_RESIST  = 11,
		CCRATE     = 12,
		CRI_RESIST = 13,
		EndEnum    = 14,
		E_MAX      = 15
	};

	/**
	 * Enum MirM.E_MOVE_TYPE
	 */
	enum class E_MOVE_TYPE : uint8_t
	{
		NONE       = 0,
		LOOP       = 1,
		ONESHOT    = 2,
		WARP       = 3,
		EndEnum    = 4,
		E_MOVE_MAX = 5
	};

	/**
	 * Enum MirM.E_SKILL_TYPE
	 */
	enum class E_SKILL_TYPE : uint8_t
	{
		PASSIVE                 = 0,
		ACTIVE_SKILL            = 1,
		ACTIVE_NORMAL           = 2,
		ACTIVE_MERIDIANS        = 3,
		ACTIVE_DELAYED          = 4,
		MENTOR                  = 5,
		PASSIVE_BONUS_STATUS    = 6,
		PASSIVE_ADVANCED_OPTION = 7,
		PASSIVE_SKILL_REINFORCE = 8,
		EndEnum                 = 9,
		E_SKILL_MAX             = 10
	};

	/**
	 * Enum MirM.E_PROJECTILE_TYPE
	 */
	enum class E_PROJECTILE_TYPE : uint8_t
	{
		NONE             = 0,
		SHOOT            = 1,
		INSTALL          = 2,
		STATIC           = 3,
		MULTISHOOT       = 4,
		LAUNCHER         = 5,
		EndEnum          = 6,
		E_PROJECTILE_MAX = 7
	};

	/**
	 * Enum MirM.E_MONTAGE
	 */
	enum class E_MONTAGE : uint8_t
	{
		ANIMMONTAGE       = 0,
		ANIMMONTAGE_SKILL = 1,
		EndEnum           = 2,
		E_MAX             = 3
	};

	/**
	 * Enum MirM.E_STACK_TYPE
	 */
	enum class E_STACK_TYPE : uint8_t
	{
		NONE        = 0,
		ADD         = 1,
		RENEW       = 2,
		EndEnum     = 3,
		E_STACK_MAX = 4
	};

	/**
	 * Enum MirM.E_ABILITY_VALUE_TYPE
	 */
	enum class E_ABILITY_VALUE_TYPE : uint8_t
	{
		ABSOLUTE_VALUE      = 0,
		RATIO               = 1,
		EndEnum             = 2,
		E_ABILITY_VALUE_MAX = 3
	};

	/**
	 * Enum MirM.E_STATUS_VALUE_TYPE
	 */
	enum class E_STATUS_VALUE_TYPE : uint8_t
	{
		ABSOLUTE_VALUE     = 0,
		RATIO              = 1,
		EndEnum            = 2,
		E_STATUS_VALUE_MAX = 3
	};

	/**
	 * Enum MirM.E_DAMAGE_TYPE
	 */
	enum class E_DAMAGE_TYPE : uint8_t
	{
		NONE         = 0,
		PATK         = 1,
		MATK         = 2,
		ALL          = 3,
		ZEN          = 4,
		EndEnum      = 5,
		E_DAMAGE_MAX = 6
	};

	/**
	 * Enum MirM.E_SHAPE_TYPE
	 */
	enum class E_SHAPE_TYPE : uint8_t
	{
		NONE         = 0,
		DASH         = 1,
		CIRCLE       = 2,
		BOX          = 3,
		FIXED_TARGET = 4,
		ARC          = 5,
		EndEnum      = 6,
		E_SHAPE_MAX  = 7
	};

	/**
	 * Enum MirM.E_TARGET_TYPE
	 */
	enum class E_TARGET_TYPE : uint8_t
	{
		NONE                          = 0,
		ENEMY_TARGET                  = 1,
		ENEMY_TARGET_AREA             = 2,
		ALLY_TARGET                   = 3,
		ALLY_TARGET_AREA              = 4,
		SELF_TARGET                   = 5,
		SELF_TARGET_AREA              = 6,
		SUMMON                        = 7,
		SELF_SUMMON                   = 8,
		ENEMY_GROUND                  = 9,
		NPC_ALLY                      = 10,
		NPC_GROUP                     = 11,
		NPC_SELF                      = 12,
		ALL_TARGET                    = 13,
		ALL_TARGET_AREA               = 14,
		SELF_TARGET_AREA_ALLY         = 15,
		ALLY_GROUND                   = 16,
		ONLY_NPC_GROUP                = 17,
		GUILD_TARGET_AREA             = 18,
		SELF_TARGET_AREA_GUILD        = 19,
		GUILD_GROUND                  = 20,
		PARTY_TARGET_AREA             = 21,
		SELF_TARGET_AREA_PARTY        = 22,
		PARTY_GROUND                  = 23,
		SELF_TARGET_AREA_RESURRECTION = 24,
		SELF_TARGET_AREA_INCLUDE_ME   = 25,
		EndEnum                       = 26,
		E_TARGET_MAX                  = 27
	};

	/**
	 * Enum MirM.E_ABILITY_TYPE
	 */
	enum class E_ABILITY_TYPE : uint8_t
	{
		DAMAGE                 = 0,
		BUFF                   = 1,
		DEBUFF                 = 2,
		HEAL                   = 3,
		NOSKILL                = 4,
		DAMAGE_DECREASE        = 5,
		DAMAGE_INCREASE        = 6,
		SIEGE_PURE_DAMAGE      = 7,
		SIEGE_ARCHER_DAMAGE    = 8,
		SIEGE_TOWER_DAMAGE     = 9,
		SIEGE_LIGHTNING_DAMAGE = 10,
		PASSIVE                = 11,
		SUBSCRIPTION_PASSIVE   = 12,
		RESURRECTION           = 13,
		MAX                    = 14,
		EndEnum                = 15
	};

	/**
	 * Enum MirM.E_USE_COST
	 */
	enum class E_USE_COST : uint8_t
	{
		NONE      = 0,
		HP        = 1,
		MP        = 2,
		FORCE     = 3,
		EndEnum   = 4,
		E_USE_MAX = 5
	};

	/**
	 * Enum MirM.E_PAS_CLASS_TYPE
	 */
	enum class E_PAS_CLASS_TYPE : uint8_t
	{
		NONE       = 0,
		WARRIOR    = 1,
		WIZARD     = 2,
		TAOIST     = 3,
		BARD       = 4,
		HALBARDIER = 5,
		ALL        = 6,
		MONSTER    = 7,
		ITEM       = 8,
		MAX        = 9,
		EndEnum    = 10
	};

	/**
	 * Enum MirM.E_PASSIVE_TYPE
	 */
	enum class E_PASSIVE_TYPE : uint8_t
	{
		SKILL_PASSIVE        = 0,
		SKILL_ATK_PASSIVE    = 1,
		SKILL_HIT_PASSIVE    = 2,
		STATUS_PASSIVE       = 3,
		ITEM_PASSIVE         = 4,
		EQUIPMENTSET_PASSIVE = 5,
		SYSTEM_PASSIVE       = 6,
		GUILD_PASSIVE        = 7,
		PASSIVE2             = 8,
		EndEnum              = 9,
		E_PASSIVE_MAX        = 10
	};

	/**
	 * Enum MirM.E_ABILITY_STATUS
	 */
	enum class E_ABILITY_STATUS : uint8_t
	{
		NONE          = 0,
		STUN          = 1,
		KNOCKBACK     = 2,
		FEAR          = 3,
		DOWN          = 4,
		PULL          = 5,
		AIR           = 6,
		SLOW          = 7,
		HIT           = 8,
		STONE         = 9,
		FREEZE        = 10,
		BLEEDING      = 11,
		BURN          = 12,
		ELECTRIC      = 13,
		POISONING     = 14,
		SLOW_ATK      = 15,
		SLOW_RUN      = 16,
		CONFUSION     = 17,
		SILENCE       = 18,
		WEAKENING     = 19,
		EndEnum       = 20,
		E_ABILITY_MAX = 21
	};

	/**
	 * Enum MirM.E_STATUS_LIST
	 */
	enum class E_STATUS_LIST : uint8_t
	{
		NONE                                    = 0,
		HP_MAX                                  = 1,
		MP_MAX                                  = 2,
		PATK_MIN                                = 3,
		PATK_MAX                                = 4,
		MATK_MIN                                = 5,
		MATK_MAX                                = 6,
		PDEF_MIN                                = 7,
		PDEF_MAX                                = 8,
		MDEF_MIN                                = 9,
		MDEF_MAX                                = 10,
		CRI_RATE                                = 11,
		CRI_RESIST                              = 12,
		CC_RATE                                 = 13,
		CC_RESIST                               = 14,
		MOVESPEED                               = 15,
		RUNSPEED                                = 16,
		ACCURACY                                = 17,
		EVADE                                   = 18,
		PATK                                    = 19,
		MATK                                    = 20,
		PDEF                                    = 21,
		MDEF                                    = 22,
		HP                                      = 23,
		MP                                      = 24,
		INVINCIBILITY                           = 25,
		NOACTION                                = 26,
		SHIELD                                  = 27,
		HIDE                                    = 28,
		ALL_ATK                                 = 29,
		ALL_DEF                                 = 30,
		DEF_PENETRATE_RATE                      = 31,
		DEF_PENETRATE_VALUE                     = 32,
		LUCK                                    = 33,
		SUPERARMOR                              = 34,
		HP_HEAL                                 = 35,
		NOSKILL                                 = 36,
		PENETRATE                               = 37,
		CURSE                                   = 38,
		ATK_MAX_RATE                            = 39,
		ATK_MIN_RATE                            = 40,
		CONFUSION                               = 41,
		ZEN                                     = 42,
		ATK_SPEED                               = 43,
		FORCE_VALUE                             = 44,
		FORCE_RECOVERY                          = 45,
		DAMAGEREDUCTION_ABSOLUTE                = 46,
		DAMAGEREDUCTION_MERIDIANSSKILL_RATE     = 47,
		UNUSED48                                = 48,
		HP_HEAL_INCREASE                        = 49,
		EXP_GET_INCREASE                        = 50,
		DROP_RATE_INCREASE                      = 51,
		SKILLEXP_GET_INCREASE                   = 52,
		FORCEEXP_GET_INCREASE                   = 53,
		FORCESKILLEXP_GET_INCREASE              = 54,
		SHOPPRICE_DISCOUNT                      = 55,
		DURABILITY_DISCOUNT                     = 56,
		CRAFT_DISCOUNT                          = 57,
		HP_RECOVERYRATIO                        = 58,
		MP_RECOVERYRATIO                        = 59,
		WEIGHTEXTEND                            = 60,
		VEHICLESPEED                            = 61,
		MP_HEAL_INCREASE                        = 62,
		SIN_PATK_INCREASE                       = 63,
		SIN_MATK_INCREASE                       = 64,
		SIN_ZEN_INCREASE                        = 65,
		HUMANMON_TAKE_DAMAGE_INCREASE           = 66,
		BEASTMON_TAKE_DAMAGE_INCREASE           = 67,
		DEVILMON_TAKE_DAMAGE_INCREASE           = 68,
		HUMANMON_GIVE_DAMAGE_REDUCE             = 69,
		BEASTMON_GIVE_DAMAGE_REDUCE             = 70,
		DEVILMON_GIVE_DAMAGE_REDUCE             = 71,
		RAREMON_DAMAGE_INCRASE                  = 72,
		BOSSMON_DAMAGE_INCRASE                  = 73,
		ALLMON_DAMAGE_INCRASE                   = 74,
		RAREMON_DAMAGE_REDUCE                   = 75,
		BOSSMON_GIVE_DAMAGE_REDUCE              = 76,
		ALLMON_TAKE_DAMAGE_REDUCE               = 77,
		VILLAIN_USER_GIVE_DAMAGE_INCRASE        = 78,
		VILLAIN_USER_TAKE_DAMAGE_REDUCE         = 79,
		USER_KILL_GOLD_DROP_INCRASE             = 80,
		USER_KILL_ITEM_DROP_RATE                = 81,
		USER_GIVE_DAMAGE_INCRASE                = 82,
		USER_TAKE_DAMAGE_REDUCE                 = 83,
		STONE                                   = 84,
		FREEZE                                  = 85,
		INVENTORYEXTEND                         = 86,
		FURRYMON_TAKE_DAMAGE_INCREASE           = 87,
		FURRYMON_GIVE_DAMAGE_REDUCE             = 88,
		FEAR                                    = 89,
		SAINT_USER_GIVE_DAMAGE_INCRASE          = 90,
		SAINT_USER_TAKE_DAMAGE_REDUCE           = 91,
		VIRTUE_PATK_INCREASE                    = 92,
		VIRTUE_MATK_INCREASE                    = 93,
		THORNS_DAMAGE_TO_SAINT_USER             = 94,
		THORNS_DAMAGE_TO_VILLAIN_USER           = 95,
		INCREASE_CRI_MULTI_RATE_TO_SAINT_USER   = 96,
		INCREASE_CRI_MULTI_RATE_TO_VILLAIN_USER = 97,
		VAMPIRIC_TOUCH_HP                       = 98,
		VAMPIRIC_TOUCH_MP                       = 99,
		INCREASE_PET_GET_EXP                    = 100,
		INCREASE_PET_GET_SATIATION              = 101,
		INCREASE_COLLECT_EXP                    = 102,
		ADDITIONAL_COLLECT_LEVEL                = 103,
		INCREASE_GOLD_DROP_VALUE                = 104,
		INCREASE_GOLD_DROP_RATE                 = 105,
		DECREASE_DURABILITY_DECLINE_RATE        = 106,
		INCREASE_RECOVERY_POTION                = 107,
		ADDITIONAL_ADD_CHAO_POINT               = 108,
		ADDITIONAL_ADD_PK_POINT                 = 109,
		INCREASE_DAMAGE_TO_SIEGE_WEAPONS        = 110,
		INCREASE_DAMAGE_TO_CASTLE_OBJECT        = 111,
		EndEnum                                 = 112,
		E_STATUS_MAX                            = 113
	};

	/**
	 * Enum MirM.E_REACTION_TYPE
	 */
	enum class E_REACTION_TYPE : uint8_t
	{
		REACTIONKNOCKBACK = 0,
		REACTIONDOWN      = 1,
		REACTIONUPPER     = 2,
		REACTIONDRAG      = 3,
		REACTIONHIT       = 4,
		EndEnum           = 5,
		E_REACTION_MAX    = 6
	};

	/**
	 * Enum MirM.E_EVENT_TYPE
	 */
	enum class E_EVENT_TYPE : uint8_t
	{
		NONE        = 0,
		DAMAGE      = 1,
		HEAL        = 2,
		SPAWN       = 3,
		EndEnum     = 4,
		E_EVENT_MAX = 5
	};

	/**
	 * Enum MirM.E_SCENE_TYPE
	 */
	enum class E_SCENE_TYPE : uint8_t
	{
		NONE        = 0,
		BEFORE      = 1,
		START       = 2,
		ING         = 3,
		AFTER       = 4,
		END         = 5,
		EndEnum     = 6,
		E_SCENE_MAX = 7
	};

	/**
	 * Enum MirM.E_OBJECT_TYPE
	 */
	enum class E_OBJECT_TYPE : uint8_t
	{
		TALK                  = 0,
		KILL                  = 1,
		GET                   = 2,
		HAVE                  = 3,
		USE                   = 4,
		COLLECT               = 5,
		MOVE                  = 6,
		TIME                  = 7,
		GUARD                 = 8,
		CLEAR                 = 9,
		COLLECT_ITEM          = 10,
		PCKILL                = 11,
		PCKILL_LEVEL          = 12,
		PCKILL_SIN            = 13,
		FISHING               = 14,
		FISHING_ITEM          = 15,
		GROWTH_LEVEL          = 16,
		OPERATE               = 17,
		QUESTCLEAR            = 18,
		DELIVERY_KILL         = 19,
		DELIVERY_COLLECT      = 20,
		DELIVERY_FISHING      = 21,
		STORYCLEAR            = 22,
		TUTORIAL              = 23,
		USE_ITEM              = 24,
		DONATION_GOLD         = 25,
		DONATION_ALL          = 26,
		DONATION_ITEM         = 27,
		ENTER_AUCTION         = 28,
		BUY_SHOP              = 29,
		KILL_BOSS             = 30,
		CLEAR_DUNGEONTYPE     = 31,
		PCKILL_GUILD          = 32,
		KILL_WORLDBOSS        = 33,
		QUEST_SUB             = 34,
		QUEST_LOCAL           = 35,
		QUEST_GUILD           = 36,
		SHOPTYPE_ITEM_BUY     = 37,
		SHOP_ITEM_BUY         = 38,
		CLEAR_MONARCHDUNGEON  = 39,
		CLEAR_BOSSDUNGEON     = 40,
		JOIN_ILLUSIONDUNGEON  = 41,
		REINFORCE             = 42,
		ENCHANT               = 43,
		LUCK                  = 44,
		DECOMPOSE             = 45,
		GUILD_JOIN            = 46,
		MAKE_COUNT            = 47,
		UNUSED48              = 48,
		MAKE_ITEM             = 49,
		MAKE_CATEGORY_COUNT   = 50,
		MENTOR                = 51,
		TITLE                 = 52,
		LOCAL_COLLECT         = 53,
		VEHICLE_LEVEL         = 54,
		PET_LEVEL             = 55,
		VIEW_POINT            = 56,
		TREASURE_BOX          = 57,
		SKILL_LEVEL           = 58,
		BLACKSMITH            = 59,
		BLACKSMITH_ITEM       = 60,
		BLACKSMITH_SUCCESS    = 61,
		ALCHEMY               = 62,
		ALCHEMY_ITEM          = 63,
		ALCHEMY_SUCCESS       = 64,
		HANDWORK              = 65,
		HANDWORK_ITEM         = 66,
		HANDWORK_SUCCESS      = 67,
		REINFORCE_SUCCESS     = 68,
		REINFORCE_GRADE       = 69,
		REINFORCE_PARTS       = 70,
		ENCHANT_SUCCESS       = 71,
		ENCHANT_GRADE         = 72,
		ENCHANT_PARTS         = 73,
		LUCK_SUCCESS          = 74,
		LUCK_GRADE            = 75,
		MINING                = 76,
		COLLECT_GRADE         = 77,
		FISHING_GRADE         = 78,
		MINING_GRADE          = 79,
		MINING_ITEM           = 80,
		DELIVERY_MINING       = 81,
		DELIVERY              = 82,
		JOIN_ARENA            = 83,
		ACTIVE_MASTER_MANDARA = 84,
		EndEnum               = 85,
		E_OBJECT_MAX          = 86
	};

	/**
	 * Enum MirM.E_REQTYPE_SUB
	 */
	enum class E_REQTYPE_SUB : uint8_t
	{
		NONE             = 0,
		LEVEL            = 1,
		QUEST            = 2,
		GUILDLV          = 3,
		QUESTOFFICELV    = 4,
		TUTORIAL         = 5,
		QUEST_START_ITEM = 6,
		MINING_LEVEL     = 7,
		GATHER_LEVEL     = 8,
		FISHING_LEVEL    = 9,
		BLACKSMITH_LEVEL = 10,
		ALCHEMY_LEVEL    = 11,
		HANDWORK_LEVEL   = 12,
		REINFORCE_LEVEL  = 13,
		ENCHANT_LEVEL    = 14,
		LUCK_LEVEL       = 15,
		FIELDBOSS_KILL   = 16,
		JOIN_ARENA       = 17,
		EndEnum          = 18,
		E_REQTYPE_MAX    = 19
	};

	/**
	 * Enum MirM.E_REQTYPE_MAIN
	 */
	enum class E_REQTYPE_MAIN : uint8_t
	{
		NONE             = 0,
		LEVEL            = 1,
		QUEST            = 2,
		GUILDLV          = 3,
		QUESTOFFICELV    = 4,
		TUTORIAL         = 5,
		QUEST_START_ITEM = 6,
		EndEnum          = 7,
		E_REQTYPE_MAX    = 8
	};

	/**
	 * Enum MirM.E_QUEST_TYPE
	 */
	enum class E_QUEST_TYPE : uint8_t
	{
		MAIN        = 0,
		SUB         = 1,
		DAILY       = 2,
		AREA        = 3,
		REPUTE      = 4,
		GUILD       = 5,
		STORY       = 6,
		TUTORIAL    = 7,
		PROFESION   = 8,
		REPEAT      = 9,
		EndEnum     = 10,
		E_QUEST_MAX = 11
	};

	/**
	 * Enum MirM.E_NPC_TYPE
	 */
	enum class E_NPC_TYPE : uint8_t
	{
		NORMAL                  = 0,
		ITEMSHOP                = 1,
		WEAPONSHOP              = 2,
		ARMORSHOP               = 3,
		JEWELRYSHOP             = 4,
		POTIONSHOP              = 5,
		SKILLSHOP               = 6,
		FOODSHOP                = 7,
		BLACKSMITH              = 8,
		CHEF                    = 9,
		ALCHEMIST               = 10,
		ROADSIGN                = 11,
		STORAGE                 = 12,
		GUILDGUIDE              = 13,
		GUILDSHOP               = 14,
		GUARD                   = 15,
		EXCHANGE                = 16,
		REPUTEGUIDE             = 17,
		DECOMPOSITION           = 18,
		ILLUSIONDUNGEON         = 19,
		BOSSDUNGEON             = 20,
		FORCESKILLSHOP          = 21,
		MONARCHDUNGEON          = 22,
		WARMANAGER              = 23,
		WARGENERAL              = 24,
		AIDE                    = 25,
		SIEGE_WEAPON_RAM        = 26,
		SIEGE_WEAPON_SIEGETOWER = 27,
		SIEGE_WEAPON_CATAPULT   = 28,
		DEFENCE_ARCHER          = 29,
		DEFENCE_MONSTER         = 30,
		BARRICADE               = 31,
		GUARD_TOWER             = 32,
		TOWN_DUNGEON            = 33,
		TOWN_STORAGE            = 34,
		TRAINING_CENTER         = 35,
		QUEST_OFFICE            = 36,
		TOWN_BLACKSMITH         = 37,
		TOWN_ALCHEMY            = 38,
		TOWN_COOKING            = 39,
		TOWN_ARSENAL            = 40,
		TOWN_ORCHARD            = 41,
		TOWN_GROVE              = 42,
		TOWN_FARM               = 43,
		TOWN_HOME               = 44,
		GUILDDUNGEON            = 45,
		CASTLEDUNGEON           = 46,
		TOWN_DINNER             = 47,
		PK_POINTSHOP            = 48,
		WANTED_MANAGER          = 49,
		SIEGE_TELEPORT          = 50,
		BLACKIRONSHOP           = 51,
		EndEnum                 = 52,
		E_NPC_MAX               = 53
	};

	/**
	 * Enum MirM.E_MONSTER_TYPE
	 */
	enum class E_MONSTER_TYPE : uint8_t
	{
		NEUTRAL       = 0,
		NORMAL        = 1,
		BOSS          = 2,
		SUMMON        = 3,
		RARE          = 4,
		WEAK          = 5,
		ELITE         = 6,
		RAIDBOSS      = 7,
		MIDDLEBOSS    = 8,
		SIEGE         = 9,
		WORLDBOSS     = 10,
		UNIQUE        = 11,
		ILLUSIONBOSS  = 12,
		EndEnum       = 13,
		E_MONSTER_MAX = 14
	};

	/**
	 * Enum MirM.E_GETREWARD
	 */
	enum class E_GETREWARD : uint8_t
	{
		CHARACTER             = 0,
		MAIL                  = 1,
		GUILD_MATERIALSTORAGE = 2,
		GUILD_TREASURESTORAGE = 3,
		PET_STORAGE           = 4,
		CART                  = 5,
		AVATAR_STORAGE        = 6,
		REFLECTION_STORAGE    = 7,
		EndEnum               = 8,
		E_MAX                 = 9
	};

	/**
	 * Enum MirM.E_RESPAWN_TYPE
	 */
	enum class E_RESPAWN_TYPE : uint8_t
	{
		ALL           = 0,
		PART          = 1,
		BOSS          = 2,
		EndEnum       = 3,
		E_RESPAWN_MAX = 4
	};

	/**
	 * Enum MirM.E_AREAINFO
	 */
	enum class E_AREAINFO : uint8_t
	{
		PEACE   = 0,
		PVP     = 1,
		EndEnum = 2,
		E_MAX   = 3
	};

	/**
	 * Enum MirM.E_INVENTORY_TYPE
	 */
	enum class E_INVENTORY_TYPE : uint8_t
	{
		NONE            = 0,
		WEAPON          = 1,
		ARMOR           = 2,
		ACCESSORY       = 3,
		RUNE            = 4,
		CONSUME         = 5,
		COSTUME         = 6,
		ETC             = 7,
		EndEnum         = 8,
		E_INVENTORY_MAX = 9
	};

	/**
	 * Enum MirM.E_EQUIP_TYPE
	 */
	enum class E_EQUIP_TYPE : uint8_t
	{
		HEAD        = 0,
		HAIR        = 1,
		BODY        = 2,
		SUB_ARMS    = 3,
		CLOCK       = 4,
		ARMS        = 5,
		HELMET      = 6,
		SHOES       = 7,
		NECKLACE    = 8,
		RINGS       = 9,
		BELT        = 10,
		BRACELET    = 11,
		PICKAXE     = 12,
		AXE         = 13,
		ROD         = 14,
		NONE        = 15,
		EndEnum     = 16,
		E_EQUIP_MAX = 17
	};

	/**
	 * Enum MirM.E_GRADE
	 */
	enum class E_GRADE : uint8_t
	{
		NONE    = 0,
		NORMAL  = 1,
		RARE    = 2,
		UNIQUE  = 3,
		EPIC    = 4,
		LEGEND  = 5,
		HERO    = 6,
		EndEnum = 7,
		E_MAX   = 8
	};

	/**
	 * Enum MirM.E_GIVE_TYPE
	 */
	enum class E_GIVE_TYPE : uint8_t
	{
		NONE       = 0,
		ALL        = 1,
		ONE        = 2,
		EndEnum    = 3,
		E_GIVE_MAX = 4
	};

	/**
	 * Enum MirM.E_COLLECT_TYPE
	 */
	enum class E_COLLECT_TYPE : uint8_t
	{
		MINING        = 0,
		GATHER        = 1,
		FELLING       = 2,
		FISHING       = 3,
		NONE          = 4,
		EndEnum       = 5,
		E_COLLECT_MAX = 6
	};

	/**
	 * Enum MirM.E_GENDER_TYPE
	 */
	enum class E_GENDER_TYPE : uint8_t
	{
		NONE         = 0,
		FEMALE       = 1,
		MALE         = 2,
		ALL          = 3,
		EndEnum      = 4,
		E_GENDER_MAX = 5
	};

	/**
	 * Enum MirM.E_CLASS_TYPE
	 */
	enum class E_CLASS_TYPE : uint8_t
	{
		NONE           = 0,
		WARRIOR        = 1,
		WIZARD         = 2,
		TAOIST         = 3,
		BARD           = 4,
		HALBARDIER     = 5,
		ALL            = 6,
		MONSTER        = 7,
		ITEM           = 8,
		VEHICLE        = 9,
		CASTLEGUARDIAN = 10,
		POLYMORPH      = 11,
		REFLECTION     = 12,
		MAX            = 13,
		EndEnum        = 14
	};

	/**
	 * Enum MirM.E_CHARACTER_TYPE
	 */
	enum class E_CHARACTER_TYPE : uint8_t
	{
		NONE             = 0,
		PC               = 1,
		NPC              = 2,
		MONSTER          = 3,
		RAM              = 4,
		SIEGETOWER       = 5,
		CATAPULT         = 6,
		WALL             = 7,
		GATE             = 8,
		GUARDTOWER       = 9,
		BARRICADE        = 10,
		ARCHER           = 11,
		DEFENCEMONSTER   = 12,
		AREAARROW        = 13,
		BOT              = 14,
		FLAG             = 15,
		AREALIGHTNING    = 16,
		GUARDSTONE       = 17,
		OCCUPATION_TOWER = 18,
		SEALDEVICE       = 19,
		DEMONSUMMON      = 20,
		STREETSTALL      = 21,
		EndEnum          = 22,
		E_CHARACTER_MAX  = 23
	};

	/**
	 * Enum MirM.E_SPECIAL_ACTION_TYPE
	 */
	enum class E_SPECIAL_ACTION_TYPE : uint8_t
	{
		NONE                    = 0,
		USE_SKILL_SLOT_NUMBER   = 1,
		SUMMON_MONSTER_GROUP_ID = 2,
		AWAY_FROM_TARGET        = 3,
		CHANGE_AI_ID            = 4,
		EndEnum                 = 5,
		E_SPECIAL_ACTION_MAX    = 6
	};

	/**
	 * Enum MirM.E_NORMAL_ACTION_TYPE
	 */
	enum class E_NORMAL_ACTION_TYPE : uint8_t
	{
		NONE                    = 0,
		USE_SKILL_SLOT_NUMBER   = 1,
		SUMMON_MONSTER_GROUP_ID = 2,
		AWAY_FROM_TARGET        = 3,
		CHANGE_AI_ID            = 4,
		EndEnum                 = 5,
		E_NORMAL_ACTION_MAX     = 6
	};

	/**
	 * Enum MirM.E_COMPARE_TYPE
	 */
	enum class E_COMPARE_TYPE : uint8_t
	{
		NONE          = 0,
		EQUAL_OVER    = 1,
		OVER          = 2,
		EQUAL         = 3,
		EQUAL_UNDER   = 4,
		UNDER         = 5,
		NOT_EQUAL     = 6,
		EndEnum       = 7,
		E_COMPARE_MAX = 8
	};

	/**
	 * Enum MirM.E_AI_CONDITION_TYPE
	 */
	enum class E_AI_CONDITION_TYPE : uint8_t
	{
		NONE                                = 0,
		CHECK_SELF_HP                       = 1,
		CHECK_DISTANCE_SPAWN_POINT          = 2,
		CHECK_DISTANCE_TARGET               = 3,
		COMPARE_MAX_AGGRO                   = 4,
		CHECK_TARGET_HP                     = 5,
		CHECK_ENEMY_COUNT                   = 6,
		CHECK_SELF_HP_PERCENT               = 7,
		CHECK_TARGET_HP_PERCENT             = 8,
		CHECK_SERVANT_COUNT                 = 9,
		RANDOM_RATIO                        = 10,
		CHECK_NEAR_ENEMY_COUNT              = 11,
		CHECK_TARGET_NEAR_ENEMY_COUNT       = 12,
		CHECK_SERVANT_ID                    = 13,
		CHECK_SELF_BUFF                     = 14,
		CHECK_TARGET_BUFF                   = 15,
		CHECK_ENEMY_COUNT_SELF_SKILL_AREA   = 16,
		CHECK_ENEMY_COUNT_TARGET_SKILL_AREA = 17,
		CHECK_SERVANT_HP_FOR_CHANGE         = 18,
		EndEnum                             = 19,
		E_AI_CONDITION_MAX                  = 20
	};

	/**
	 * Enum MirM.E_CreateAccount_Popup_Type
	 */
	enum class E_CreateAccount_Popup_Type : uint8_t
	{
		CreateAccount             = 0,
		Warnning                  = 1,
		Terms                     = 2,
		E_CreateAccount_Popup_MAX = 3
	};

	/**
	 * Enum MirM.E_CustomizeCategoryType
	 */
	enum class E_CustomizeCategoryType : uint8_t
	{
		None   = 0,
		Head   = 1,
		Hair   = 2,
		Body   = 3,
		Weapon = 4,
		Cap    = 5,
		E_MAX  = 6
	};

	/**
	 * Enum MirM.EDamageFontText_TYPE
	 */
	enum class EDamageFontText_TYPE : uint8_t
	{
		NORMAL              = 0,
		CRITICAL            = 1,
		HEAL                = 2,
		MISS                = 3,
		EVASION             = 4,
		NORMALSUFFERED      = 5,
		CRITICALSUFFERED    = 6,
		MANA                = 7,
		ResistSelf          = 8,
		Resist              = 9,
		ImmuneSelf          = 10,
		Immune              = 11,
		VAMPIRIC_HP         = 12,
		VAMPIRIC_MP         = 13,
		REFLECTION          = 14,
		REFLECTIONSelf      = 15,
		EDamageFontText_MAX = 16
	};

	/**
	 * Enum MirM.E_Quest_State
	 */
	enum class E_Quest_State : uint8_t
	{
		none        = 0,
		accept      = 1,
		complete    = 2,
		finish      = 3,
		E_Quest_MAX = 4
	};

	/**
	 * Enum MirM.E_DetailMapTab
	 */
	enum class E_DetailMapTab : uint8_t
	{
		Tab_Area           = 0,
		Tab_Npc            = 1,
		Tab_Monster        = 2,
		Tab_RewardEquip    = 3,
		Tab_RewardMaterial = 4,
		Tab_MAX            = 5
	};

	/**
	 * Enum MirM.EEquipEnchant_DescPrefabStr
	 */
	enum class EEquipEnchant_DescPrefabStr : uint8_t
	{
		NONE         = 0,
		CurrentLv    = 1,
		NextLvOption = 2,
		MAX          = 3
	};

	/**
	 * Enum MirM.EEquipEnchantPageStr
	 */
	enum class EEquipEnchantPageStr : uint8_t
	{
		NONE           = 0,
		LimitReinforce = 1,
		EmptyMaterial  = 2,
		EmptyTarget    = 3,
		LimitPercent   = 4,
		NeedMoreMat    = 5,
		FullMatSlot    = 6,
		MAX            = 7
	};

	/**
	 * Enum MirM.FacingCameraText_Rotate_TYPE
	 */
	enum class EFacingCameraText_Rotate_TYPE : uint8_t
	{
		FacingCameraText_Rotate_TYPE__FacingCamera                = 0,
		FacingCameraText_Rotate_TYPE__LookAtCamera                = 1,
		FacingCameraText_Rotate_TYPE__FacingCameraText_Rotate_MAX = 2
	};

	/**
	 * Enum MirM.EMapRealTimeType
	 */
	enum class EMapRealTimeType : uint8_t
	{
		NONE            = 0,
		Monster         = 1,
		PC_Normal       = 2,
		PC_PK_Enemy     = 3,
		PC_PK_MyTeam    = 4,
		PC_PK_OtherTeam = 5,
		PC_Party        = 6,
		PC_Guild        = 7,
		NPC_Movable     = 8,
		SIEGE_WEAPON    = 9,
		MERCENARY       = 10,
		FIXED_OBJECT    = 11,
		GuardTower      = 12,
		SeigeWall       = 13,
		GuardStone      = 14,
		GuildWarFlag    = 15,
		MAX             = 16
	};

	/**
	 * Enum MirM.EContentType
	 */
	enum class EContentType : uint8_t
	{
		Static_None       = 0,
		Gate              = 1,
		NPC               = 2,
		Collection        = 3,
		MonsterGroup      = 4,
		Monster           = 5,
		Switch            = 6,
		Fishing           = 7,
		DungeonGate       = 8,
		Sector            = 9,
		TeleportGate      = 10,
		SiegeTowerGate    = 11,
		Acher             = 12,
		Barricade         = 13,
		GuardTower        = 14,
		SeigeWall         = 15,
		GuardStone        = 16,
		GuildWarFlag      = 17,
		Occupation_Tower  = 18,
		SealingDevice     = 19,
		StreetStallSector = 20,
		Static_End        = 21,
		Dynamic_None      = 22,
		QuestTargetPos    = 23,
		BaseTreasureBox   = 24,
		GoldTreasureBox   = 25,
		RaidTreasureBox   = 26,
		WantedMan         = 27,
		SiegeWarfareAtk   = 28,
		SiegeWarfareDef   = 29,
		DemonSpirit       = 30,
		Dynamic_End       = 31,
		MAX               = 32
	};

	/**
	 * Enum MirM.Download_GroupType
	 */
	enum class EDownload_GroupType : uint8_t
	{
		Download_GroupType__Intro_Pak    = 0,
		Download_GroupType__Runtime_Test = 1,
		Download_GroupType__MAX          = 2
	};

	/**
	 * Enum MirM.E_ForceLearnState
	 */
	enum class E_ForceLearnState : uint8_t
	{
		None          = 0,
		NeedChLv      = 1,
		NeedForceLv   = 2,
		NeedForceExp  = 3,
		NeedSkillItem = 4,
		NeedForceItem = 5,
		Error         = 6,
		Max           = 7
	};

	/**
	 * Enum MirM.ShowLogType
	 */
	enum class EShowLogType : uint8_t
	{
		ShowLogType__ShowLogAll      = 0,
		ShowLogType__ShowLogSelect   = 1,
		ShowLogType__HideLog         = 2,
		ShowLogType__ShowLogType_MAX = 3
	};

	/**
	 * Enum MirM.DevType
	 */
	enum class EDevType : uint8_t
	{
		DevType__Dev         = 0,
		DevType__Default     = 1,
		DevType__Release     = 2,
		DevType__DevType_MAX = 3
	};

	/**
	 * Enum MirM.GameLanguage
	 */
	enum class EGameLanguage : uint8_t
	{
		GameLanguage__Chn              = 0,
		GameLanguage__Kor              = 1,
		GameLanguage__Eng              = 2,
		GameLanguage__GameLanguage_MAX = 3
	};

	/**
	 * Enum MirM.EGuildStorageLogType
	 */
	enum class EGuildStorageLogType : uint8_t
	{
		None_GuildStorageLog = 0,
		Donation_Goods       = 1,
		Donation_Item        = 2,
		Chanage_Item         = 3,
		Quest_Normal         = 4,
		Quest_Order          = 5,
		Open_Box1            = 6,
		Open_Box2            = 7,
		Open_Box3            = 8,
		Open_Box4            = 9,
		Complete_Dungeon1    = 10,
		Complete_Dungeon2    = 11,
		Truce_War            = 12,
		Reject_War           = 13,
		Enforce_Skill1       = 14,
		Enforce_Skill2       = 15,
		Noti_Bid             = 16,
		Declare_War          = 17,
		Declare_Truce        = 18,
		Open_Dungeon         = 19,
		Max_GuildStorageLog  = 20,
		MAX                  = 21
	};

	/**
	 * Enum MirM.E_WARRESULT
	 */
	enum class E_WARRESULT : uint8_t
	{
		NONE   = 0,
		WIN    = 1,
		BIGWIN = 2,
		LOSE   = 3,
		E_MAX  = 4
	};

	/**
	 * Enum MirM.E_BATTERY_STATE
	 */
	enum class E_BATTERY_STATE : uint8_t
	{
		CHARGE          = 0,
		TEN_PER         = 1,
		TWENTYFIVE_PER  = 2,
		FIFTY_PER       = 3,
		SEVENTYFIVE_PER = 4,
		HUNDRED_PER     = 5,
		E_BATTERY_MAX   = 6
	};

	/**
	 * Enum MirM.E_MONSTER_Gauge_TYPE
	 */
	enum class E_MONSTER_Gauge_TYPE : uint8_t
	{
		WEAK                = 0,
		NORMAL              = 1,
		ELITE               = 2,
		RARE                = 3,
		BOSS                = 4,
		WORLDBOSS           = 5,
		SUMMON              = 6,
		NONE                = 7,
		E_MONSTER_Gauge_MAX = 8
	};

	/**
	 * Enum MirM.E_NameTagProgressType
	 */
	enum class E_NameTagProgressType : uint8_t
	{
		HP    = 0,
		MP    = 1,
		E_MAX = 2
	};

	/**
	 * Enum MirM.E_HudUserProfileMenuButtonType
	 */
	enum class E_HudUserProfileMenuButtonType : uint8_t
	{
		Detail        = 0,
		AddFriend     = 1,
		PartyInvite   = 2,
		GuildInvite   = 3,
		PersonalTrade = 4,
		Whisper       = 5,
		Block         = 6,
		E_MAX         = 7
	};

	/**
	 * Enum MirM.E_CharacterStatus
	 */
	enum class E_CharacterStatus : uint8_t
	{
		BaseInfo  = 0,
		Stat      = 1,
		Record    = 2,
		Profesion = 3,
		E_MAX     = 4
	};

	/**
	 * Enum MirM.E_COMPARE_BTN
	 */
	enum class E_COMPARE_BTN : uint8_t
	{
		EQUIP         = 0,
		EXCHANGE      = 1,
		E_COMPARE_MAX = 2
	};

	/**
	 * Enum MirM.E_INVENTORY_EQUIP_ANIM
	 */
	enum class E_INVENTORY_EQUIP_ANIM : uint8_t
	{
		BASIC                 = 0,
		USEITEN               = 1,
		SELECTSLOT_ONPOPUP    = 2,
		END                   = 3,
		E_INVENTORY_EQUIP_MAX = 4
	};

	/**
	 * Enum MirM.E_ItemInfoGroupBGType
	 */
	enum class E_ItemInfoGroupBGType : uint8_t
	{
		Full       = 0,
		RightEmpty = 1,
		LeftEmpty  = 2,
		E_MAX      = 3
	};

	/**
	 * Enum MirM.E_InfoGroupNumPadState
	 */
	enum class E_InfoGroupNumPadState : uint8_t
	{
		None                = 0,
		Destory             = 1,
		Use                 = 2,
		MaterialStorageKeep = 3,
		SupplyStorageTake   = 4,
		E_MAX               = 5
	};

	/**
	 * Enum MirM.E_InfoGroupPopup_TYPE
	 */
	enum class E_InfoGroupPopup_TYPE : uint8_t
	{
		None                 = 0,
		General              = 1,
		EquipSingle          = 2,
		EquipDouble          = 3,
		Numpad               = 4,
		EquipReverseSingle   = 5,
		E_InfoGroupPopup_MAX = 6
	};

	/**
	 * Enum MirM.E_KillAndDeathType
	 */
	enum class E_KillAndDeathType : uint8_t
	{
		SiegeWarfare = 0,
		Max          = 1
	};

	/**
	 * Enum MirM.EListPopup_BasePrefab
	 */
	enum class EListPopup_BasePrefab : uint8_t
	{
		NONE      = 0,
		CurrentLv = 1,
		Rate      = 2,
		RateMin   = 3,
		HaveCnt   = 4,
		Makeable  = 5,
		MAX       = 6
	};

	/**
	 * Enum MirM.EMiniGameState
	 */
	enum class EMiniGameState : uint8_t
	{
		None            = 0,
		Prologue        = 1,
		Tutorial_Action = 2,
		Tutorial_Skill  = 3,
		Ready           = 4,
		Play            = 5,
		Result          = 6,
		Pause           = 7,
		Finish          = 8,
		Epilogue        = 9,
		MAX             = 10
	};

	/**
	 * Enum MirM.EANIM_GROUP_TYPE
	 */
	enum class EANIM_GROUP_TYPE : uint8_t
	{
		NONE        = 0,
		BODY        = 1,
		HEAD        = 2,
		HAIR        = 3,
		HEAD_ACC    = 4,
		WEAPON      = 5,
		WING        = 6,
		VEHICLE     = 7,
		SUB_WEAPON  = 8,
		FISHING_ROD = 9,
		MAX         = 10
	};

	/**
	 * Enum MirM.EMirAreaType
	 */
	enum class EMirAreaType : uint8_t
	{
		None         = 0,
		SecretValley = 1,
		MAX          = 2
	};

	/**
	 * Enum MirM.E_ARENA_PAGE
	 */
	enum class E_ARENA_PAGE : uint8_t
	{
		ARENA_INFO             = 0,
		ARENA_RANK             = 1,
		ARENA_SEASONSTART      = 2,
		ARENA_SEASONRESULT     = 3,
		ARENA_GUIDEPAGE        = 4,
		ARENA_SEASONRESULTINFO = 5,
		ARENA_MAX              = 6
	};

	/**
	 * Enum MirM.E_SEASON_INFO_TYPE
	 */
	enum class E_SEASON_INFO_TYPE : uint8_t
	{
		ATTACK_POINT      = 0,
		KILL_POINT        = 1,
		DAMAGE_POINT      = 2,
		E_SEASON_INFO_MAX = 3
	};

	/**
	 * Enum MirM.EAutoPlayStateType
	 */
	enum class EAutoPlayStateType : uint8_t
	{
		_NONE                         = 0,
		_MOVE                         = 1,
		_BATTLE_MOVE                  = 2,
		_TRIGGER                      = 3,
		_COLLECT                      = 4,
		_WAIT_SERVER_STEP             = 5,
		_WAIT_CINEMATIC               = 6,
		_GUIDE_HUNTING                = 7,
		_GUIDE_RETURN                 = 8,
		_CONDITION_DEATH              = 9,
		_RETURN_MOVE                  = 10,
		_SELL_ITEMS                   = 11,
		_BUY_HP_POTION                = 12,
		_BUY_MP_POTION                = 13,
		_SELL_ITEMS_MOVE              = 14,
		_BUY_POTION_MOVE              = 15,
		_REPAIR_ITEMS                 = 16,
		_REPAIR_ITEMS_MOVE            = 17,
		_DECOMPOSE_ITEMS              = 18,
		_DECOMPOSE_ITEMS_MOVE         = 19,
		_WAIT_RECOVER                 = 20,
		_WAIT_SPAWN_ANIMATION         = 21,
		_REPEAT                       = 22,
		_INVEN_AUTO_CLEANING          = 23,
		_CONDITION_TIME_LIMITED_PLACE = 24,
		_CONDITION_CELLPOS_SYNC       = 25,
		_CONDITION_STATE              = 26,
		_AI_TEST                      = 27,
		_WAIT_FIND_TARGET             = 28,
		_BATTLE_START                 = 29,
		_PHASE                        = 30,
		_PATTERN                      = 31,
		_USE_SKILL                    = 32,
		_CHASE_TARGET                 = 33,
		_KEEP_DISTANCE                = 34,
		_AWAY_FROM_TARGET             = 35,
		_SUMMON_WAIT                  = 36,
		_SUMMON_KEEP_DISTANCE         = 37,
		_SUMMON_TELEPORT_DISTANCE     = 38,
		_SUMMON_PHASE                 = 39,
		_DAMAGE_DELAY                 = 40,
		_DAMAGE_START                 = 41,
		_DAMAGE_WAIT                  = 42,
		_DAMAGE_END                   = 43,
		_END                          = 44,
		_MAX                          = 45
	};

	/**
	 * Enum MirM.EAutoPlayStateResult
	 */
	enum class EAutoPlayStateResult : uint8_t
	{
		_None         = 0,
		_TRUE         = 1,
		_FALSE        = 2,
		_RUNNING      = 3,
		_STOP         = 4,
		_COMPLETE     = 5,
		_WAIT_SERVER_ = 6,
		_INTERRUPT    = 7,
		_MAX          = 8
	};

	/**
	 * Enum MirM.E_CalCulaterTapType
	 */
	enum class E_CalCulaterTapType : uint8_t
	{
		None      = 0,
		BLACKIRON = 1,
		GOLDINGOT = 2,
		Max       = 3
	};

	/**
	 * Enum MirM.E_CHANGE_CELL_REASON
	 */
	enum class E_CHANGE_CELL_REASON : uint8_t
	{
		NONE     = 0,
		MOVE     = 1,
		ENTER    = 2,
		TELEPORT = 3,
		MAX      = 4
	};

	/**
	 * Enum MirM.E_NON_PLAYER_PART_TYPE
	 */
	enum class E_NON_PLAYER_PART_TYPE : uint8_t
	{
		BODY       = 0,
		PART_A     = 1,
		WEAPON     = 2,
		SUB_WEAPON = 3,
		MAX        = 4
	};

	/**
	 * Enum MirM.E_CharacterTable_PartIndex
	 */
	enum class E_CharacterTable_PartIndex : uint8_t
	{
		BODY = 0,
		HEAD = 1,
		HAIR = 2,
		WING = 3,
		MAX  = 4
	};

	/**
	 * Enum MirM.ESocketName
	 */
	enum class ESocketName : uint8_t
	{
		HEAD   = 0,
		SPINE  = 1,
		HANDES = 2,
		LHAND  = 3,
		RHAND  = 4,
		ROOT   = 5,
		MAX    = 6
	};

	/**
	 * Enum MirM.EDamageType
	 */
	enum class EDamageType : uint8_t
	{
		DAMAGE_NONE        = 0,
		DAMAGE_HIT         = 1,
		DAMAGE_MISS        = 2,
		DAMAGE_CRITICAL    = 3,
		HEAL_HP            = 4,
		HEAL_MP            = 5,
		AUTO_HEAL_HP       = 6,
		AUTO_HEAL_MP       = 7,
		DAMAGE_PERFECT     = 8,
		DAMAGE_GREAT       = 9,
		DAMAGE_GOOD        = 10,
		DAMAGE_VAMPIRIC_HP = 11,
		DAMAGE_VAMPIRIC_MP = 12,
		DAMAGE_REFLECTION  = 13,
		MAX                = 14
	};

	/**
	 * Enum MirM.EDetectHitType
	 */
	enum class EDetectHitType : uint8_t
	{
		USE_WEAPON   = 0,
		USE_BAREHAND = 1,
		USE_ARCAREA  = 2,
		USE_BOXAREA  = 3,
		USE_MAX      = 4
	};

	/**
	 * Enum MirM.E_PART_TYPE
	 */
	enum class E_PART_TYPE : uint8_t
	{
		BODY          = 0,
		HEAD          = 1,
		HAIR          = 2,
		HEAD_ACC      = 3,
		WEAPON        = 4,
		WING          = 5,
		WEAPON_SHEATH = 6,
		SUB_WEAPON    = 7,
		PART_A        = 8,
		HELMET        = 9,
		MAX           = 10
	};

	/**
	 * Enum MirM.EBalloonEmotion
	 */
	enum class EBalloonEmotion : uint8_t
	{
		None          = 0,
		Hide          = 1,
		InventoryFull = 2,
		Hungry        = 3,
		TeamHungry    = 4,
		MAX           = 5
	};

	/**
	 * Enum MirM.EVehicleState
	 */
	enum class EVehicleState : uint8_t
	{
		GetOff       = 0,
		GetOn        = 1,
		SendGetOff   = 2,
		SendGetOn    = 3,
		GetOn_Start  = 4,
		GetOn_Ing    = 5,
		GetOff_Ing   = 6,
		ReserveGetOn = 7,
		MAX          = 8
	};

	/**
	 * Enum MirM.EMirTeleportType
	 */
	enum class EMirTeleportType : uint8_t
	{
		NORMAL        = 0,
		VIEW_POINT    = 1,
		FIXED_POINT   = 2,
		SAVE_AREA     = 3,
		FRIEND        = 4,
		SECRET_VALLEY = 5,
		MAX           = 6
	};

	/**
	 * Enum MirM.EMirUIEventType
	 */
	enum class EMirUIEventType : uint8_t
	{
		None                 = 0,
		ActiveSkillLearn     = 1,
		ActiveSkillLevelUp   = 2,
		PassiveSkillLearn    = 3,
		PassiveSkillLevelUp  = 4,
		AcuPointLevelUp      = 5,
		MeridianLevelUp      = 6,
		TitleGain            = 7,
		OnlyFightingPowerUp  = 8,
		ItemReinforce        = 9,
		FavorabilityGradeUp  = 10,
		PetAndVehicleEatFood = 11,
		HiddenStoryGain      = 12,
		TreasureBoxOpen      = 13,
		ToastMessage         = 14,
		FishingToastMessage  = 15,
		Max                  = 16
	};

	/**
	 * Enum MirM.EMirSiegeResult
	 */
	enum class EMirSiegeResult : uint8_t
	{
		None        = 0,
		Victory_Atk = 1,
		Victory_Def = 2,
		MAX         = 3
	};

	/**
	 * Enum MirM.EMirStaticMeshPart
	 */
	enum class EMirStaticMeshPart : uint8_t
	{
		Part1 = 0,
		Part2 = 1,
		MAX   = 2
	};

	/**
	 * Enum MirM.EMirSiegeLocation
	 */
	enum class EMirSiegeLocation : uint8_t
	{
		OUTER_CASTLE = 0,
		INNER_CASTLE = 1,
		OUTER_PALACE = 2,
		INNER_PALACE = 3,
		HIDDEN_PATH  = 4,
		NONE         = 5,
		MAX          = 6
	};

	/**
	 * Enum MirM.ETEAM
	 */
	enum class ETEAM : uint8_t
	{
		NONE = 0,
		RED  = 1,
		BLUE = 2,
		MAX  = 3
	};

	/**
	 * Enum MirM.EMirMoveProcessMode
	 */
	enum class EMirMoveProcessMode : uint8_t
	{
		FIRST_MOVE_MODE  = 0,
		VERIFY_MOVE_MODE = 1,
		MAX              = 2
	};

	/**
	 * Enum MirM.EMirMoveInputType
	 */
	enum class EMirMoveInputType : uint8_t
	{
		NONE      = 0,
		PAD       = 1,
		DIRECTION = 2,
		PATH      = 3,
		TARGET    = 4,
		MAX       = 5
	};

	/**
	 * Enum MirM.EMirOctaDirection
	 */
	enum class EMirOctaDirection : uint8_t
	{
		TOP       = 0,
		TOPRIGHT  = 1,
		RIGHT     = 2,
		DOWNRIGHT = 3,
		DOWN      = 4,
		DOWNLEFT  = 5,
		LEFT      = 6,
		TOPLEFT   = 7,
		NONE      = 8,
		MAX       = 9
	};

	/**
	 * Enum MirM.ECellAttribute
	 */
	enum class ECellAttribute : uint8_t
	{
		ATTR_UNUSED                  = 0,
		ATTR_MOVE                    = 1,
		ATTR_BLOCK                   = 2,
		ATTR_SAFETYZONE              = 3,
		ATTR_OVERLAP                 = 4,
		ATTR_BORDER                  = 5,
		ATTR_ATTACKABLE_BLOCK        = 6,
		ATTR_COLLECT_FISHING         = 7,
		ATTR_ATTACK_ZONE_A           = 8,
		ATTR_ATTACK_ZONE_B           = 9,
		ATTR_ATTACK_ZONE_C           = 10,
		ATTR_ATTACK_ZONE_D           = 11,
		ATTR_ATTACK_ZONE_E           = 12,
		ATTR_ATTACK_ZONE_F           = 13,
		ATTR_ATTACK_ZONE_G           = 14,
		ATTR_ATTACK_ZONE_H           = 15,
		ATTR_ATTACK_ZONE_I           = 16,
		ATTR_MOVE_OFFENCE            = 17,
		ATTR_MOVE_DEFENCE            = 18,
		ATTR_NO_MOVEMENTS            = 19,
		ATTR_PREVENT_AUTOMOVE        = 20,
		ATTR_TOWN                    = 21,
		ATTR_EXTBLOCK_BOSSPLACE      = 22,
		ATTR_COLLECT_PLACEMENT       = 23,
		ATTR_BLOCK_DOOR              = 24,
		ATTR_EXTBLOCK_ALLOW_PATHFIND = 25,
		ATTR_PK_NO_PENALTY           = 26,
		ATTR_GNDMTRL_DEFAULT         = 27,
		ATTR_GNDMTRL_SOIL            = 28,
		ATTR_GNDMTRL_WATER           = 29,
		ATTR_GNDMTRL_GRASS           = 30,
		ATTR_GNDMTRL_STONE           = 31,
		ATTR_GNDMTRL_WOOD            = 32,
		ATTR_GNDMTRL_SNOW            = 33,
		ATTR_GNDMTRL_FIRE            = 34,
		ATTR_GNDMTRL_SWAMP           = 35,
		ATTR_PATH_FLAG               = 36,
		ATTR_PATH_CELL               = 37,
		ATTR_SKILL_TARGET            = 38,
		ATTR_LINKED_PATH_FLAG        = 39,
		ATTR_MAIN_PATH_FLAG          = 40,
		ATTR_SUB_PATH_FLAG           = 41,
		ATTR_FORCEUSE_NORMALPATH     = 42,
		ATTR_COLOR_YELLOW            = 43,
		ATTR_COLOR_CYAN              = 44,
		ATTR_COLOR_GRAY              = 45,
		ATTR_COLOR_GATE              = 46,
		ATTR_DEBUG                   = 47,
		ATTR_MAX                     = 48
	};

	/**
	 * Enum MirM.EQuestProgressType
	 */
	enum class EQuestProgressType : uint8_t
	{
		_None             = 0,
		_Accept           = 1,
		_SatisfyCondition = 2,
		_Reward           = 3,
		_MAX              = 4
	};

	/**
	 * Enum MirM.E_WeaponEquipPos
	 */
	enum class E_WeaponEquipPos : uint8_t
	{
		MainWeapon = 0,
		SubWeapon  = 1,
		Max        = 2
	};

	/**
	 * Enum MirM.E_AttackResult
	 */
	enum class E_AttackResult : uint8_t
	{
		Failed         = 0,
		Succeeded      = 1,
		Stuck          = 2,
		Drawn          = 3,
		MoveToTarget   = 4,
		ReservedAttack = 5,
		VehicleOff     = 6,
		E_MAX          = 7
	};

	/**
	 * Enum MirM.EQuestIconType
	 */
	enum class EQuestIconType : uint8_t
	{
		None                     = 0,
		ExclamationMark          = 1,
		QuestionMark             = 2,
		SpeechBubble             = 3,
		RepeatExclamationMark    = 4,
		SubExclamationMark       = 5,
		DailyExclamationMark     = 6,
		RepeatQuestionMark       = 7,
		SubQuestionMark          = 8,
		DailyQuestionMark        = 9,
		REPUTE_ExclamationMark   = 10,
		TUTORIAL_ExclamationMark = 11,
		GUILD_ExclamationMark    = 12,
		REPUTE_QuestionMark      = 13,
		TUTORIAL_QuestionMark    = 14,
		GUILD_QuestionMark       = 15,
		ProfesionExclamationMark = 16,
		ProfesionQuestionMark    = 17,
		MAX                      = 18
	};

	/**
	 * Enum MirM.GatherResultType
	 */
	enum class EGatherResultType : uint8_t
	{
		GatherResultType__Fail       = 0,
		GatherResultType__Success    = 1,
		GatherResultType__BigSuccess = 2,
		GatherResultType__MAX        = 3
	};

	/**
	 * Enum MirM.FishingResultType
	 */
	enum class EFishingResultType : uint8_t
	{
		FishingResultType__Ing        = 0,
		FishingResultType__Fail       = 1,
		FishingResultType__Success    = 2,
		FishingResultType__BigSuccess = 3,
		FishingResultType__MAX        = 4
	};

	/**
	 * Enum MirM.EAnimNotifyDestructStrengthType
	 */
	enum class EAnimNotifyDestructStrengthType : uint8_t
	{
		Light  = 0,
		Medium = 1,
		Heavy  = 2,
		MAX    = 3
	};

	/**
	 * Enum MirM.EAnimNotifyDestructCollisionType
	 */
	enum class EAnimNotifyDestructCollisionType : uint8_t
	{
		Line   = 0,
		Circle = 1,
		End    = 2,
		MAX    = 3
	};

	/**
	 * Enum MirM.EObjectTriggerActorType
	 */
	enum class EObjectTriggerActorType : uint8_t
	{
		None              = 0,
		Position          = 1,
		Gate              = 2,
		NPC               = 3,
		Collection        = 4,
		MonsterGroup      = 5,
		Monster           = 6,
		Switch            = 7,
		Fishing           = 8,
		AREAARROW         = 9,
		SiegeTowerGate    = 10,
		ACHER             = 11,
		BARRICADE         = 12,
		GUARDTOWER        = 13,
		SEIGEWALL         = 14,
		MapObjectControl  = 15,
		DestPointGuide    = 16,
		Telelport         = 17,
		DinnerPlace       = 18,
		GuildWarFlag      = 19,
		GUARDSTONE        = 20,
		LordStatue        = 21,
		Occupation_Tower  = 22,
		SealingDevice     = 23,
		DemonSummon       = 24,
		StreetStall       = 25,
		StreetStallSector = 26,
		End               = 27,
		DungeonGate       = 28,
		Cinematic         = 29,
		Sector            = 30,
		MonsterIllusion   = 31,
		DungeonWaypoint   = 32,
		MAX               = 33
	};

	/**
	 * Enum MirM.EMirObjectType
	 */
	enum class EMirObjectType : uint8_t
	{
		Character        = 0,
		Monster          = 1,
		DropItem         = 2,
		Collect          = 3,
		NPC              = 4,
		Summon           = 5,
		SiegeWeapon      = 6,
		FixedObject      = 7,
		Mercenary        = 8,
		TreasureBox      = 9,
		WarFlag          = 10,
		LordStatue       = 11,
		Occupation_Tower = 12,
		SealingDevice    = 13,
		DemonSummon      = 14,
		StreetStall      = 15,
		Pet              = 16,
		DummyCharacter   = 17,
		FollowingNPC     = 18,
		MAX              = 19
	};

	/**
	 * Enum MirM.EARENA_RESULT
	 */
	enum class EARENA_RESULT : uint8_t
	{
		WIN        = 0,
		DEFEAT     = 1,
		NONE       = 2,
		EARENA_MAX = 3
	};

	/**
	 * Enum MirM.EARENA_TEAM
	 */
	enum class EARENA_TEAM : uint8_t
	{
		BLUE       = 0,
		RED        = 1,
		NONE       = 2,
		EARENA_MAX = 3
	};

	/**
	 * Enum MirM.EARENA_STATE
	 */
	enum class EARENA_STATE : uint8_t
	{
		NONE         = 0,
		NONE_VISIBLE = 1,
		PROCESS      = 2,
		WAITING      = 3,
		END          = 4,
		EARENA_MAX   = 5
	};

	/**
	 * Enum MirM.EDungeonEntryRoomInvitePageContentType
	 */
	enum class EDungeonEntryRoomInvitePageContentType : uint8_t
	{
		AroundUser  = 0,
		GuildMember = 1,
		Friend      = 2,
		MAX         = 3
	};

	/**
	 * Enum MirM.E_EnchantStoneFramePageTabIdx
	 */
	enum class E_EnchantStoneFramePageTabIdx : uint8_t
	{
		Equip   = 0,
		Upgrade = 1,
		Compose = 2,
		E_MAX   = 3
	};

	/**
	 * Enum MirM.EEnchantStoneDirectWaitTimerIdx
	 */
	enum class EEnchantStoneDirectWaitTimerIdx : uint8_t
	{
		Timer1 = 0,
		Timer2 = 1,
		Timer3 = 2,
		Count  = 3,
		MAX    = 4
	};

	/**
	 * Enum MirM.EEnchantStoneExtraPageIdx
	 */
	enum class EEnchantStoneExtraPageIdx : uint8_t
	{
		Equip       = 0,
		SlotUnlock  = 1,
		SlotUnequip = 2,
		Upgrade     = 3,
		Compose     = 4,
		MAX         = 5
	};

	/**
	 * Enum MirM.EGameEventRewardReceiveState
	 */
	enum class EGameEventRewardReceiveState : uint8_t
	{
		None              = 0,
		AlreadyReceived   = 1,
		PossibleReceive   = 2,
		ImpossibleReceive = 3,
		NotYet            = 4,
		MAX               = 5
	};

	/**
	 * Enum MirM.EGameEventExtraPageIdx
	 */
	enum class EGameEventExtraPageIdx : uint8_t
	{
		RewardEvent     = 0,
		AttendanceWeek  = 1,
		AttendanceMonth = 2,
		Ranking         = 3,
		OnlineTime      = 4,
		Level           = 5,
		MAX             = 6
	};

	/**
	 * Enum MirM.E_GAME_PROCESS
	 */
	enum class E_GAME_PROCESS : uint8_t
	{
		NONE             = 0,
		INIT             = 1,
		START            = 2,
		PRE_LOAD_LEVEL   = 3,
		START_LOAD_LEVEL = 4,
		LOAD_COMPLETE    = 5,
		UPDATE           = 6,
		LEVEL_START      = 7,
		SHUTDOWN         = 8,
		RELEASE          = 9,
		LOGOUT           = 10,
		E_GAME_MAX       = 11
	};

	/**
	 * Enum MirM.E_MirGridNavCamType
	 */
	enum class E_MirGridNavCamType : uint8_t
	{
		Delete_Camera_Data = 0,
		Blue_Camera        = 1,
		Green_Camera       = 2,
		Yellow_Camera      = 3,
		Brown_Camera       = 4,
		Maroon_Camera      = 5,
		Gray_Camera        = 6,
		Purple_Camera      = 7,
		Navy_Camera        = 8,
		Teal_Camera        = 9,
		White_Camera       = 10,
		MAX                = 11
	};

	/**
	 * Enum MirM.EGuildDonationType
	 */
	enum class EGuildDonationType : uint8_t
	{
		Coin      = 0,
		BlackIron = 1,
		Gold      = 2,
		MAX       = 3
	};

	/**
	 * Enum MirM.EGuildMainFramePageTabIdx
	 */
	enum class EGuildMainFramePageTabIdx : uint8_t
	{
		Info         = 0,
		MembersFrame = 1,
		GuildStorage = 2,
		War          = 3,
		Skill        = 4,
		Benefit      = 5,
		GuildWarRank = 6,
		TabCount     = 7,
		MAX          = 8
	};

	/**
	 * Enum MirM.EGuildPageIdxOfMainWindow
	 */
	enum class EGuildPageIdxOfMainWindow : uint8_t
	{
		Info                     = 0,
		GuildMark                = 1,
		Donation                 = 2,
		RegisterSetting          = 3,
		MembersFrame             = 4,
		MembersManage            = 5,
		MembersManageContextMenu = 6,
		ClassEntrust             = 7,
		RegisterManage           = 8,
		RegisterUserContextMenu  = 9,
		War                      = 10,
		WarProclaim              = 11,
		WarSurrender             = 12,
		WarSurrenderAccept       = 13,
		GuildSkill               = 14,
		GuildSkillLearnAlert     = 15,
		Benefit                  = 16,
		ShareStorageRequest      = 17,
		WarRank                  = 18,
		StorageMove              = 19,
		GuildStorage             = 20,
		Max                      = 21
	};

	/**
	 * Enum MirM.EGuildPageIdxOfMakeAndRegisterWindow
	 */
	enum class EGuildPageIdxOfMakeAndRegisterWindow : uint8_t
	{
		Make               = 0,
		Make_Mark          = 1,
		Register_Frame     = 2,
		Register_Recommend = 3,
		Register_Apply     = 4,
		Max                = 5
	};

	/**
	 * Enum MirM.EGuildMembersSortTargetType
	 */
	enum class EGuildMembersSortTargetType : uint8_t
	{
		GuildClass    = 0,
		AccContribute = 1,
		ConnectTime   = 2,
		MAX           = 3
	};

	/**
	 * Enum MirM.EGuildClassAuthorityType
	 */
	enum class EGuildClassAuthorityType : uint8_t
	{
		None                   = 0,
		RegisterSetting        = 1,
		Promotion              = 2,
		Notice                 = 3,
		Disband                = 4,
		War                    = 5,
		RegisterApply          = 6,
		Entrust                = 7,
		Ban                    = 8,
		GuildSkillUpgrade      = 9,
		GuildDungeonOpen       = 10,
		OrderQuest             = 11,
		GuildMarkChange        = 12,
		CastleDungeonPayChange = 13,
		BlackIronShopRegister  = 14,
		MAX                    = 15
	};

	/**
	 * Enum MirM.EGuildClassID
	 */
	enum class EGuildClassID : uint8_t
	{
		None         = 0,
		Master       = 1,
		DeputyMaster = 2,
		Elder        = 3,
		NormalMember = 4,
		MAX          = 5
	};

	/**
	 * Enum MirM.EGuildMembersFramePageTabIdx
	 */
	enum class EGuildMembersFramePageTabIdx : uint8_t
	{
		Members       = 0,
		RegisterApply = 1,
		Storage       = 2,
		TabCount      = 3,
		MAX           = 4
	};

	/**
	 * Enum MirM.EContentTypeOfGuildQuestPage
	 */
	enum class EContentTypeOfGuildQuestPage : uint8_t
	{
		GuildMemberQuest = 0,
		GuildOrderQuest  = 1,
		TownQuest        = 2,
		MAX              = 3
	};

	/**
	 * Enum MirM.EGuildRecommendPageContentType
	 */
	enum class EGuildRecommendPageContentType : uint8_t
	{
		Recommend = 0,
		Found     = 1,
		MAX       = 2
	};

	/**
	 * Enum MirM.E_RankImg
	 */
	enum class E_RankImg : uint8_t
	{
		None   = 0,
		First  = 1,
		Second = 2,
		Third  = 3,
		E_MAX  = 4
	};

	/**
	 * Enum MirM.EIllusionDungeonEntryPageIdx
	 */
	enum class EIllusionDungeonEntryPageIdx : uint8_t
	{
		Floor = 0,
		Max   = 1
	};

	/**
	 * Enum MirM.INDICATOR_TYPE
	 */
	enum class EINDICATOR_TYPE : uint8_t
	{
		INDICATOR_TYPE__CIRCLE = 0,
		INDICATOR_TYPE__BOX    = 1,
		INDICATOR_TYPE__CONE   = 2,
		INDICATOR_TYPE__CONE01 = 3,
		INDICATOR_TYPE__CONE02 = 4,
		INDICATOR_TYPE__CONE03 = 5,
		INDICATOR_TYPE__MAX    = 6
	};

	/**
	 * Enum MirM.EIntensionPage
	 */
	enum class EIntensionPage : uint8_t
	{
		Enchant         = 0,
		MaterialCompose = 1,
		MAX             = 2
	};

	/**
	 * Enum MirM.E_LOG_CATEGORY
	 */
	enum class E_LOG_CATEGORY : uint8_t
	{
		TEMP                           = 0,
		MIR_NETWORK                    = 1,
		WINDOW_MANAGER                 = 2,
		SPAWN_MANAGER                  = 3,
		MIR_CHARACTER                  = 4,
		GAME_INSTANCE                  = 5,
		DATA_MANAGER                   = 6,
		NETWORK_MAMAGER                = 7,
		NETWORK_MAMAGER_BATTLE         = 8,
		QUEST                          = 9,
		QUEST_STATE                    = 10,
		RESOURCE_MANAGER               = 11,
		RESOURCE_LOADER                = 12,
		MIR_EDITOR_EXT                 = 13,
		MIR_GAME_MODE                  = 14,
		OBJECT_TRIGGER                 = 15,
		WINDOW                         = 16,
		UI                             = 17,
		ParkJiro                       = 18,
		INGAME                         = 19,
		COMBO_ATTACK                   = 20,
		PRE_LOAD                       = 21,
		MIR_PLAYER_CONTROLLER          = 22,
		LeeGhilSan                     = 23,
		QUALITY_CALCULATION            = 24,
		GUIDE_SYSTEM                   = 25,
		FileDownLoad                   = 26,
		CELL_MOVE                      = 27,
		PROTOCOL                       = 28,
		NETWORK_MAMAGER_BATTLE_PENDING = 29,
		LOGJSON                        = 30,
		SIEGE                          = 31,
		AUTOBATTLE                     = 32,
		ChoiMinbyeong                  = 33,
		STORY_MODE                     = 34,
		AVATAR                         = 35,
		KEY_BINDING                    = 36,
		SECRET_VALLEY                  = 37,
		ANIM_STATE                     = 38,
		DUNGEON_ARENA                  = 39,
		CHARACTER_PART                 = 40,
		KJWS78                         = 41,
		MY_BEHAVIOR                    = 42,
		SungKyoungRin                  = 43,
		E_LOG_MAX                      = 44
	};

	/**
	 * Enum MirM.EMotionBlurPart
	 */
	enum class EMotionBlurPart : uint8_t
	{
		BODY          = 0,
		HEAD          = 1,
		HAIR          = 2,
		WEAPON        = 3,
		WEAPON_SHEATH = 4,
		MAX           = 5
	};

	/**
	 * Enum MirM.EPartyDungeonEntryExtraPageIdx
	 */
	enum class EPartyDungeonEntryExtraPageIdx : uint8_t
	{
		Crew5           = 0,
		Crew5_RoomMake  = 1,
		Crew15          = 2,
		Crew15_RoomMake = 3,
		RoomInvite      = 4,
		Max             = 5
	};

	/**
	 * Enum MirM.EPartyDungeonPartyMemberChangeType
	 */
	enum class EPartyDungeonPartyMemberChangeType : uint8_t
	{
		None        = 0,
		OwnerChange = 1,
		ExileVote   = 2,
		MAX         = 3
	};

	/**
	 * Enum MirM.ELastZoomPlay
	 */
	enum class ELastZoomPlay : uint8_t
	{
		ZoomNone       = 0,
		ZoomButton     = 1,
		ZoomIn         = 2,
		ZoomOut        = 3,
		ZoomRestore    = 4,
		ZoomLengthMove = 5,
		MAX            = 6
	};

	/**
	 * Enum MirM.ECameraRotateRoll
	 */
	enum class ECameraRotateRoll : uint8_t
	{
		Horizon         = 0,
		HorizonReverse  = 1,
		Vertical        = 2,
		VerticalReverse = 3,
		MAX             = 4
	};

	/**
	 * Enum MirM.E_CameraSpeedType
	 */
	enum class E_CameraSpeedType : uint8_t
	{
		linear                = 0,
		easeInQuadratic       = 1,
		easeOutQuadratic      = 2,
		easeInAndOutQuadratic = 3,
		easeInCubic           = 4,
		easeOutCubic          = 5,
		easeInAndOutCubic     = 6,
		easeInQuartic         = 7,
		easeOutQuartic        = 8,
		easeInAndOutQuartic   = 9,
		easeInQuintic         = 10,
		easeOutQuintic        = 11,
		easeInAndOutQuintic   = 12,
		easeInSine            = 13,
		E_MAX                 = 14
	};

	/**
	 * Enum MirM.ETBoxAcquireDisplayState
	 */
	enum class ETBoxAcquireDisplayState : uint8_t
	{
		BASE       = 0,
		EQUIP_ITEM = 1,
		ETC_ITEM   = 2,
		MAX        = 3
	};

	/**
	 * Enum MirM.ETBoxRewardDisplayState
	 */
	enum class ETBoxRewardDisplayState : uint8_t
	{
		BASE  = 0,
		ITEM  = 1,
		CLOSE = 2,
		MAX   = 3
	};

	/**
	 * Enum MirM.E_AttackShakeType
	 */
	enum class E_AttackShakeType : uint8_t
	{
		None        = 0,
		Hit         = 1,
		Explosion_A = 2,
		Explosion_B = 3,
		MAX         = 4
	};

	/**
	 * Enum MirM.E_ProjectileSpeedType
	 */
	enum class E_ProjectileSpeedType : uint8_t
	{
		linear                = 0,
		easeInQuadratic       = 1,
		easeOutQuadratic      = 2,
		easeInAndOutQuadratic = 3,
		easeInCubic           = 4,
		easeOutCubic          = 5,
		easeInAndOutCubic     = 6,
		easeInQuartic         = 7,
		easeOutQuartic        = 8,
		easeInAndOutQuartic   = 9,
		easeInQuintic         = 10,
		easeOutQuintic        = 11,
		easeInAndOutQuintic   = 12,
		easeInSine            = 13,
		E_MAX                 = 14
	};

	/**
	 * Enum MirM.E_ActivateType
	 */
	enum class E_ActivateType : uint8_t
	{
		E_Activate = 0,
		E_Hit      = 1,
		E_MAX      = 2
	};

	/**
	 * Enum MirM.E_ProjectileType
	 */
	enum class E_ProjectileType : uint8_t
	{
		E_Move    = 0,
		E_Install = 1,
		E_Direct  = 2,
		E_MAX     = 3
	};

	/**
	 * Enum MirM.EQuestExtraPageIdx
	 */
	enum class EQuestExtraPageIdx : uint8_t
	{
		GuildQuest                     = 0,
		GuildQuestSelect               = 1,
		GuildQuestCompleteMemberReward = 2,
		MAX                            = 3
	};

	/**
	 * Enum MirM.EMirSealDeviceAnimState
	 */
	enum class EMirSealDeviceAnimState : uint8_t
	{
		IDLE   = 0,
		UNSEAL = 1,
		MAX    = 2
	};

	/**
	 * Enum MirM.E_SEASON_RESULT_TYPE
	 */
	enum class E_SEASON_RESULT_TYPE : uint8_t
	{
		WIN                 = 0,
		LOSE                = 1,
		DRAW                = 2,
		E_SEASON_RESULT_MAX = 3
	};

	/**
	 * Enum MirM.E_SECRETVALLEY_STATE
	 */
	enum class E_SECRETVALLEY_STATE : uint8_t
	{
		Protection = 0,
		Battle     = 1,
		Invincible = 2,
		Max        = 3
	};

	/**
	 * Enum MirM.ESignificanceObjectType
	 */
	enum class ESignificanceObjectType : uint8_t
	{
		None      = 0,
		Character = 1,
		DropItem  = 2,
		MAX       = 3
	};

	/**
	 * Enum MirM.E_MirSkillTabPageSubTabType
	 */
	enum class E_MirSkillTabPageSubTabType : uint8_t
	{
		MartialArts = 0,
		Force       = 1,
		MAX         = 2
	};

	/**
	 * Enum MirM.E_EaseType
	 */
	enum class E_EaseType : uint8_t
	{
		linear                = 0,
		easeInQuadratic       = 1,
		easeOutQuadratic      = 2,
		easeInAndOutQuadratic = 3,
		easeInCubic           = 4,
		easeOutCubic          = 5,
		easeInAndOutCubic     = 6,
		easeInQuartic         = 7,
		easeOutQuartic        = 8,
		easeInAndOutQuartic   = 9,
		easeInQuintic         = 10,
		easeOutQuintic        = 11,
		easeInAndOutQuintic   = 12,
		easeInSine            = 13,
		E_MAX                 = 14
	};

	/**
	 * Enum MirM.EOpactiyType
	 */
	enum class EOpactiyType : uint8_t
	{
		Hidden      = 0,
		Translucent = 1,
		MAX         = 2
	};

	/**
	 * Enum MirM.EMapPointAlramAnimType
	 */
	enum class EMapPointAlramAnimType : uint8_t
	{
		Normal  = 0,
		Routine = 1,
		Max     = 2
	};

	/**
	 * Enum MirM.ETownArsenalExtraPageIdx
	 */
	enum class ETownArsenalExtraPageIdx : uint8_t
	{
		WeaponSelect = 0,
		MAX          = 1
	};

	/**
	 * Enum MirM.EBoxCondition
	 */
	enum class EBoxCondition : uint8_t
	{
		OPEN_ABLE   = 0,
		OPEN_UNABLE = 1,
		OPEN_MAX    = 2
	};

	/**
	 * Enum MirM.ENotifyTBoxState
	 */
	enum class ENotifyTBoxState : uint8_t
	{
		CREATE  = 0,
		IDLE    = 1,
		OPEN    = 2,
		DESTROY = 3,
		MAX     = 4
	};

	/**
	 * Enum MirM.E_TreasureStorageAuctionJoin
	 */
	enum class E_TreasureStorageAuctionJoin : uint8_t
	{
		NoJoin     = 0,
		HighestBid = 1,
		FailBid    = 2,
		SuccessBid = 3,
		Max        = 4
	};

	/**
	 * Enum MirM.E_TutorialExtraType
	 */
	enum class E_TutorialExtraType : uint8_t
	{
		None  = 0,
		Open  = 1,
		Close = 2,
		E_MAX = 3
	};

	/**
	 * Enum MirM.E_MirTouchedBanner
	 */
	enum class E_MirTouchedBanner : uint8_t
	{
		None         = 0,
		FirstBanner  = 1,
		SecondBanner = 2,
		E_MAX        = 3
	};

	/**
	 * Enum MirM.E_CashShopProductExpireType
	 */
	enum class E_CashShopProductExpireType : uint8_t
	{
		None                 = 0,
		NormalProductExpire  = 1,
		LimitedProductExpire = 2,
		WeekProduct          = 3,
		E_MAX                = 4
	};

	/**
	 * Enum MirM.E_CashShopSpecialMark
	 */
	enum class E_CashShopSpecialMark : uint8_t
	{
		None      = 0,
		New       = 1,
		Recommand = 2,
		Event     = 3,
		E_MAX     = 4
	};

	/**
	 * Enum MirM.E_ExpRestoreTab
	 */
	enum class E_ExpRestoreTab : uint8_t
	{
		Normal  = 0,
		Premium = 1,
		Max     = 2
	};

	/**
	 * Enum MirM.E_BannerClickType
	 */
	enum class E_BannerClickType : uint8_t
	{
		Drag      = 0,
		Click     = 1,
		NextSlide = 2,
		BackSlide = 3,
		E_MAX     = 4
	};

	/**
	 * Enum MirM.E_BannerAnimationType
	 */
	enum class E_BannerAnimationType : uint8_t
	{
		Drag_StayIndex   = 0,
		Drag_ChangeIndex = 1,
		Slide_NextIndex  = 2,
		Slide_BackIndex  = 3,
		E_MAX            = 4
	};

	/**
	 * Enum MirM.E_CashShopStepProductBuyType
	 */
	enum class E_CashShopStepProductBuyType : uint8_t
	{
		Lock     = 0,
		Wait     = 1,
		Complete = 2,
		E_MAX    = 3
	};

	/**
	 * Enum MirM.E_PARTYPOPUP
	 */
	enum class E_PARTYPOPUP : uint8_t
	{
		PARTY_LEAVE  = 0,
		PARTY_CHANGE = 1,
		ROOM_LEAVE   = 2,
		ROOM_CHANGE  = 3,
		E_MAX        = 4
	};

	/**
	 * Enum MirM.ELauncherError
	 */
	enum class ELauncherError : uint8_t
	{
		NoConnetLauncher   = 0,
		MultyInstancePatch = 1,
		Max                = 2
	};

	/**
	 * Enum MirM.EVehicleFightingPowerUpdateType
	 */
	enum class EVehicleFightingPowerUpdateType : uint8_t
	{
		None               = 0,
		Equip_Vehicle      = 1,
		Substitute_Vehicle = 2,
		Equip_Equipment    = 3,
		Food               = 4,
		Max                = 5
	};

	/**
	 * Enum MirM.EMirShopAssistantState
	 */
	enum class EMirShopAssistantState : uint8_t
	{
		None      = 0,
		Appear    = 1,
		Idle      = 2,
		Promotion = 3,
		DisAppear = 4,
		Max       = 5
	};

	/**
	 * Enum MirM.EMirCheckBoxPopupType
	 */
	enum class EMirCheckBoxPopupType : uint8_t
	{
		EnchantStoneUpgrade    = 0,
		AdventureRegistCollect = 1,
		ProfesionCraft         = 2,
		Max                    = 3
	};

	/**
	 * Enum MirM.EMirStreetStallTriggerState
	 */
	enum class EMirStreetStallTriggerState : uint8_t
	{
		Enter = 0,
		Exit  = 1,
		Max   = 2
	};

	/**
	 * Enum MirM.EMirStreetStallState
	 */
	enum class EMirStreetStallState : uint8_t
	{
		None     = 0,
		Prepare  = 1,
		Business = 2,
		Close    = 3,
		Max      = 4
	};

	/**
	 * Enum MirM.E_EnchantStoneUpgradeGuideMsg
	 */
	enum class E_EnchantStoneUpgradeGuideMsg : uint8_t
	{
		None           = 0,
		SelectTarget   = 1,
		SelectMaterial = 2,
		MaxLevel       = 3,
		Max            = 4
	};

	/**
	 * Enum MirM.E_Mandala_TYPE
	 */
	enum class E_Mandala_TYPE : uint8_t
	{
		Battle        = 0,
		Master        = 1,
		E_Mandala_MAX = 2
	};

	/**
	 * Enum MirM.E_AutoScanTime
	 */
	enum class E_AutoScanTime : uint8_t
	{
		Short    = 0,
		Middle   = 1,
		Long     = 2,
		VeryLong = 3,
		Max      = 4
	};

	/**
	 * Enum MirM.EMandalaLineState
	 */
	enum class EMandalaLineState : uint8_t
	{
		DeActivate   = 0,
		ActivateAble = 1,
		Activate     = 2,
		MAX          = 3
	};

	/**
	 * Enum MirM.EMandalaNodeState
	 */
	enum class EMandalaNodeState : uint8_t
	{
		None        = 0,
		Activatable = 1,
		Activate    = 2,
		DeActivate  = 3,
		MAX         = 4
	};

	/**
	 * Enum MirM.ECameraType
	 */
	enum class ECameraType : uint8_t
	{
		Origin                  = 0,
		QuarterView             = 1,
		FreeCam                 = 2,
		TileCam                 = 3,
		TelePortCam             = 4,
		DirectJoomCam           = 5,
		DungeonArenaObserverCam = 6,
		MiniGameInitialCam      = 7,
		MiniGameStartCam        = 8,
		ChannelMoveCam          = 9,
		Max                     = 10
	};

	/**
	 * Enum MirM.ERecvRandomBoxType
	 */
	enum class ERecvRandomBoxType : uint8_t
	{
		Item       = 0,
		Pet        = 1,
		Reflection = 2,
		MAX        = 3
	};

	/**
	 * Enum MirM.EMirDemmonSpiritState
	 */
	enum class EMirDemmonSpiritState : uint8_t
	{
		None      = 0,
		Appear    = 1,
		Idle      = 2,
		Hit       = 3,
		DisAppear = 4,
		MAX       = 5
	};

	/**
	 * Enum MirM.EMirSealDeviceState
	 */
	enum class EMirSealDeviceState : uint8_t
	{
		Sealing         = 0,
		Try_To_UnSeal   = 1,
		UnSealing       = 2,
		Complete_UnSeal = 3,
		MAX             = 4
	};

	/**
	 * Enum MirM.EHUDInteractionGaugeType
	 */
	enum class EHUDInteractionGaugeType : uint8_t
	{
		SealingDevice = 0,
		MAX           = 1
	};

	/**
	 * Enum MirM.E_WORSHIP_PAGE_TYPE
	 */
	enum class E_WORSHIP_PAGE_TYPE : uint8_t
	{
		MoveWorship = 0,
		WorshipInfo = 1,
		MAX         = 2
	};

	/**
	 * Enum MirM.E_SiegeWeaponPositionType
	 */
	enum class E_SiegeWeaponPositionType : uint8_t
	{
		SiegeCanon_R_A                     = 0,
		SiegeCanon_R_B                     = 1,
		SiegeCanon_R_C                     = 2,
		SiegeCanon_R_D                     = 3,
		SiegeCanon_L_A                     = 4,
		SiegeCanon_L_B                     = 5,
		SiegeCanon_L_C                     = 6,
		SiegeCanon_L_D                     = 7,
		SiegeAvatar_R_A                    = 8,
		SiegeAvatar_R_B                    = 9,
		SiegeAvatar_R_C                    = 10,
		SiegeAvatar_L_A                    = 11,
		SiegeAvatar_L_B                    = 12,
		SiegeAvatar_L_C                    = 13,
		SiegeSecret_A                      = 14,
		SiegeSecret_B                      = 15,
		SiegeSecret_C                      = 16,
		SiegeSecret_D                      = 17,
		Offence_L                          = 18,
		Offence_C                          = 19,
		Offence_R                          = 20,
		SiegeOverView_Offence              = 21,
		SiegeOverView_Diffence_Castle      = 22,
		SiegeOverView_Diffence_SiegeSecret = 23,
		MAX                                = 24
	};

	/**
	 * Enum MirM.E_CharacterDismemberType
	 */
	enum class E_CharacterDismemberType : uint8_t
	{
		MONSTER = 0,
		MAX     = 1
	};

	/**
	 * Enum MirM.E_ITEMCOLLECION_TYPE
	 */
	enum class E_ITEMCOLLECION_TYPE : uint8_t
	{
		NONE                = 0,
		EVENT               = 1,
		E_ITEMCOLLECION_MAX = 2
	};

	/**
	 * Enum MirM.E_COLLECTION_MAIN_TAB
	 */
	enum class E_COLLECTION_MAIN_TAB : uint8_t
	{
		ITEM                  = 0,
		ITEMEVENT             = 1,
		PET                   = 2,
		MONSTER               = 3,
		E_COLLECTION_MAIN_MAX = 4
	};

	/**
	 * Enum MirM.E_AVATAR_TRANSFORMABLE_STATE
	 */
	enum class E_AVATAR_TRANSFORMABLE_STATE : uint8_t
	{
		NONE                       = 0,
		ALREADY_TRANSFORM          = 1,
		IMPOSSIBLE_AREA            = 2,
		COOLTIME                   = 3,
		DONTHAVE                   = 4,
		NEEDMOREITEM               = 5,
		ETC_ERROR                  = 6,
		E_AVATAR_TRANSFORMABLE_MAX = 7
	};

	/**
	 * Enum MirM.E_AVATAR_TRY_TYPE
	 */
	enum class E_AVATAR_TRY_TYPE : uint8_t
	{
		NONE             = 0,
		GOODS_TYPE       = 1,
		MERGE_TYPE       = 2,
		TICKET_TYPE      = 3,
		E_AVATAR_TRY_MAX = 4
	};

	/**
	 * Enum MirM.E_AVATAR_PAGE_TYPE
	 */
	enum class E_AVATAR_PAGE_TYPE : uint8_t
	{
		NONE              = 0,
		BASIC_TYPE        = 1,
		MERGE_TYPE        = 2,
		RESULT_TYPE       = 3,
		E_AVATAR_PAGE_MAX = 4
	};

	/**
	 * Enum MirM.E_REFLECTION_INFO_PAGE_TYPE
	 */
	enum class E_REFLECTION_INFO_PAGE_TYPE : uint8_t
	{
		REFLECTION_INFO            = 0,
		CHANGE_REFLECTION_INFO     = 1,
		E_REFLECTION_INFO_PAGE_MAX = 2
	};

	/**
	 * Enum MirM.E_REFLECTION_SUMMON_TYPE
	 */
	enum class E_REFLECTION_SUMMON_TYPE : uint8_t
	{
		CASH_SHOP               = 0,
		RANDOM_BOX              = 1,
		MIX                     = 2,
		CONFIRM_CHANGE          = 3,
		E_REFLECTION_SUMMON_MAX = 4
	};

	/**
	 * Enum MirM.E_REFLECTION_PAGE_TYPE
	 */
	enum class E_REFLECTION_PAGE_TYPE : uint8_t
	{
		MAIN_TYPE             = 0,
		MERGE_TYPE            = 1,
		HAVE_EFFECT_TYPE      = 2,
		CONFIRM_TYPE          = 3,
		SUMMON_RESULT_TYPE    = 4,
		MERGE_RESULT_TYPE     = 5,
		CONFIRM_RESULT_TYPE   = 6,
		E_REFLECTION_PAGE_MAX = 7
	};

	/**
	 * Enum MirM.E_SiegeResultType
	 */
	enum class E_SiegeResultType : uint8_t
	{
		VictoryMainAtkTeam = 0,
		VictorySubAtkTeam  = 1,
		VictoryDefTeam     = 2,
		DefeatMainAtkTeam  = 3,
		DefeatSubAtkTeam   = 4,
		DefeatDefTeam      = 5,
		Max                = 6
	};

	/**
	 * Enum MirM.E_ObjectInfoUIType
	 */
	enum class E_ObjectInfoUIType : uint8_t
	{
		NONE       = 0,
		MONSTER    = 1,
		VIEW_POINT = 2,
		NPC        = 3,
		PET        = 4,
		RELIC_ITEM = 5,
		Max        = 6
	};

	/**
	 * Enum MirM.E_SectorUserColorType
	 */
	enum class E_SectorUserColorType : uint8_t
	{
		Green = 0,
		Red   = 1,
		Blue  = 2,
		Max   = 3
	};

	/**
	 * Enum MirM.E_FAVORABILITY_REWARD_STATE
	 */
	enum class E_FAVORABILITY_REWARD_STATE : uint8_t
	{
		ImpossibleRecvReward = 0,
		PossibleRecvReward   = 1,
		CompleteRecvReward   = 2,
		Max                  = 3
	};

	/**
	 * Enum MirM.E_NOTI_Alarm
	 */
	enum class E_NOTI_Alarm : uint8_t
	{
		None       = 0,
		Normal     = 1,
		New        = 2,
		Upper      = 3,
		E_NOTI_MAX = 4
	};

	/**
	 * Enum MirM.E_MirCutSceneType
	 */
	enum class E_MirCutSceneType : uint8_t
	{
		NONE                   = 0,
		QUEST                  = 1,
		SW_ENTER               = 2,
		SW_DESTROY_DEF_TOWER   = 3,
		SW_IDLE_DEF_TOWER      = 4,
		SW_VICTORY_CELEBRATION = 5,
		GSW_START              = 6,
		GSW_END                = 7,
		INTRO_STORY            = 8,
		E_MAX                  = 9
	};

	/**
	 * Enum MirM.ECOLLECTION_STATE
	 */
	enum class ECOLLECTION_STATE : uint8_t
	{
		NONE            = 0,
		COMPLETE        = 1,
		PROCEEDING      = 2,
		ECOLLECTION_MAX = 3
	};

	/**
	 * Enum MirM.E_ImmovableReleaseType
	 */
	enum class E_ImmovableReleaseType : uint8_t
	{
		Ground = 0,
		Freeze = 1,
		E_MAX  = 2
	};

	/**
	 * Enum MirM.E_ImmovableDirState
	 */
	enum class E_ImmovableDirState : uint8_t
	{
		None  = 0,
		Enter = 1,
		Wait  = 2,
		Exit  = 3,
		E_MAX = 4
	};

	/**
	 * Enum MirM.EHUDTextGaugeType
	 */
	enum class EHUDTextGaugeType : uint8_t
	{
		Normal      = 0,
		TreasureBox = 1,
		Collect     = 2,
		Quest       = 3,
		ChannelMove = 4,
		MAX         = 5
	};

	/**
	 * Enum MirM.E_LoadingScreen
	 */
	enum class E_LoadingScreen : uint8_t
	{
		On    = 0,
		Off   = 1,
		E_MAX = 2
	};

	/**
	 * Enum MirM.E_BLESS_SUCCESS
	 */
	enum class E_BLESS_SUCCESS : uint8_t
	{
		NONE        = 0,
		EFFECT      = 1,
		EFFECT01    = 2,
		EFFECT02    = 3,
		E_BLESS_MAX = 4
	};

	/**
	 * Enum MirM.E_AutoSelectState
	 */
	enum class E_AutoSelectState : uint8_t
	{
		class_Warrior   = 0,
		class_Taoist    = 1,
		class_Wizard    = 2,
		class_All       = 3,
		Item_Equipment  = 4,
		Item_EquipStone = 5,
		Item_Etc        = 6,
		grade_NORMAL    = 7,
		grade_RARE      = 8,
		grade_UNIQUE    = 9,
		grade_LEGEND    = 10,
		costume_Weapon  = 11,
		costume_Body    = 12,
		costume_Head    = 13,
		grade_EPIC      = 14,
		Item_Material   = 15,
		max             = 16
	};

	/**
	 * Enum MirM.E_MakingPageStateType
	 */
	enum class E_MakingPageStateType : uint8_t
	{
		ALCHEMY    = 0,
		BLACKSMITH = 1,
		COOKING    = 2,
		PREVIEW    = 3,
		None       = 4,
		E_MAX      = 5
	};

	/**
	 * Enum MirM.E_SkillButtonType
	 */
	enum class E_SkillButtonType : uint8_t
	{
		NONE  = 0,
		HUD   = 1,
		EQUIP = 2,
		E_MAX = 3
	};

	/**
	 * Enum MirM.E_EnchantStateType
	 */
	enum class E_EnchantStateType : uint8_t
	{
		RotateCam                = 0,
		Enchant_TargetSlotChange = 1,
		Enchant_MatSlotChange    = 2,
		Enchant_MatSlotChange01  = 3,
		Enchant_MatSlotChange02  = 4,
		Enchant_MatSlotChange03  = 5,
		Enchant_MatSlotChange04  = 6,
		EnchantResult            = 7,
		Merge_TargetSlotChange   = 8,
		MergeResult              = 9,
		Resmelt_TargetSlotChange = 10,
		ResmeltResult            = 11,
		Bless_TargetSlotChange   = 12,
		BlessResult              = 13,
		E_MAX                    = 14
	};

	/**
	 * Enum MirM.E_HudSkillAutoType
	 */
	enum class E_HudSkillAutoType : uint8_t
	{
		Enable  = 0,
		Disable = 1,
		None    = 2,
		E_MAX   = 3
	};

	/**
	 * Enum MirM.E_HudQuickSlotAutoType
	 */
	enum class E_HudQuickSlotAutoType : uint8_t
	{
		Enable  = 0,
		Disable = 1,
		UnAble  = 2,
		E_MAX   = 3
	};

	/**
	 * Enum MirM.E_HudQuickSlotStatType
	 */
	enum class E_HudQuickSlotStatType : uint8_t
	{
		None        = 0,
		Release     = 1,
		Equip       = 2,
		UnEquipable = 3,
		E_MAX       = 4
	};

	/**
	 * Enum MirM.E_WORLDMAP_PIN_TYPE
	 */
	enum class E_WORLDMAP_PIN_TYPE : uint8_t
	{
		Pin_AreaGroup    = 0,
		Pin_Map          = 1,
		Pin_WorldBoss    = 2,
		Pin_Castle       = 3,
		Pin_Arrow        = 4,
		Pin_InDetailMap  = 5,
		Pin_Gate         = 6,
		Pin_NPC          = 7,
		Pin_Collection   = 8,
		Pin_MonsterGroup = 9,
		Pin_Monster      = 10,
		Pin_Switch       = 11,
		Pin_Fishing      = 12,
		Pin_DungeonGate  = 13,
		Pin_Sector       = 14,
		Pin_TeleportGate = 15,
		Pin_MAX          = 16
	};

	/**
	 * Enum MirM.E_CSPGrowthSlotState
	 */
	enum class E_CSPGrowthSlotState : uint8_t
	{
		None              = 0,
		BaseReadyCashNone = 1,
		BaseRecvCashNone  = 2,
		BaseNoneCashBuy   = 3,
		BaseReadyCashBuy  = 4,
		BaseRecvCashReady = 5,
		Complete          = 6,
		E_MAX             = 7
	};

	/**
	 * Enum MirM.E_CharacterStatType
	 */
	enum class E_CharacterStatType : uint8_t
	{
		Stat_Character        = 0,
		Equipment             = 1,
		Title                 = 2,
		Acupoints             = 3,
		Pet                   = 4,
		Stat_Pet              = 5,
		Vehicle               = 6,
		Stat_Vehicle          = 7,
		Skill_Vehicle         = 8,
		Item_Collection       = 9,
		Skill_Guild           = 10,
		Personal_Rank         = 11,
		Guild_Rank            = 12,
		Skill_Passive         = 13,
		Avatar_Stat           = 14,
		Buff                  = 15,
		Reflection            = 16,
		Reflection_Collection = 17,
		Mandala               = 18,
		Profesion_Rank        = 19,
		Profesion_Level       = 20,
		Max                   = 21
	};

	/**
	 * Enum MirM.E_SiegeTimeMesseageType
	 */
	enum class E_SiegeTimeMesseageType : uint8_t
	{
		Revive     = 0,
		SiegeEnd   = 1,
		Occupation = 2,
		E_MAX      = 3
	};

	/**
	 * Enum MirM.E_ExpandSlotType
	 */
	enum class E_ExpandSlotType : uint8_t
	{
		Inven            = 0,
		CharacterStorage = 1,
		AccountStorage   = 2,
		ShareStorage     = 3,
		EquipStone       = 4,
		E_MAX            = 5
	};

	/**
	 * Enum MirM.E_LimitedPackageState
	 */
	enum class E_LimitedPackageState : uint8_t
	{
		Unqualified = 0,
		Qualified   = 1,
		Expire      = 2,
		E_MAX       = 3
	};

	/**
	 * Enum MirM.E_ClacButtonState
	 */
	enum class E_ClacButtonState : uint8_t
	{
		ALLEnable    = 0,
		MinusDisable = 1,
		PlusDisable  = 2,
		ALLDisable   = 3,
		E_MAX        = 4
	};

	/**
	 * Enum MirM.ESORT_RATIO
	 */
	enum class ESORT_RATIO : uint8_t
	{
		ALL        = 0,
		COMPLETE   = 1,
		PROCEEDING = 2,
		ESORT_MAX  = 3
	};

	/**
	 * Enum MirM.ECOLLECTION_TAB_TYPE
	 */
	enum class ECOLLECTION_TAB_TYPE : uint8_t
	{
		NONE     = 0,
		NORMAL   = 1,
		RARE     = 2,
		UNIQUE   = 3,
		EVENT    = 4,
		BOOKMARK = 5,
		MAX      = 6
	};

	/**
	 * Enum MirM.E_INTERFACE_SCALE
	 */
	enum class E_INTERFACE_SCALE : uint8_t
	{
		PER     = 0,
		PER01   = 1,
		PER02   = 2,
		PER03   = 3,
		PER_MAX = 4
	};

	/**
	 * Enum MirM.E_DisplayMode
	 */
	enum class E_DisplayMode : uint8_t
	{
		FullScreen = 0,
		FullWindow = 1,
		Window     = 2,
		E_MAX      = 3
	};

	/**
	 * Enum MirM.E_ResolutionSetting
	 */
	enum class E_ResolutionSetting : uint8_t
	{
		CUSTOM = 0,
		HD     = 1,
		HDPLUS = 2,
		FHD    = 3,
		QHD    = 4,
		UHD    = 5,
		E_MAX  = 6
	};

	/**
	 * Enum MirM.E_ShowEffect
	 */
	enum class E_ShowEffect : uint8_t
	{
		SHOW_ALL   = 0,
		HIDE_OTHER = 1,
		OFF_OTHER  = 2,
		OFF_ALL    = 3,
		E_MAX      = 4
	};

	/**
	 * Enum MirM.E_FrameSetting
	 */
	enum class E_FrameSetting : uint8_t
	{
		FRAME          = 0,
		FRAME01        = 1,
		FRAME02        = 2,
		FRAME_INFINITY = 3,
		FRAME_MAX      = 4
	};

	/**
	 * Enum MirM.E_GraphicQuality
	 */
	enum class E_GraphicQuality : uint8_t
	{
		Low      = 0,
		Normal   = 1,
		High     = 2,
		VeryHigh = 3,
		E_MAX    = 4
	};

	/**
	 * Enum MirM.E_InventoryListType
	 */
	enum class E_InventoryListType : uint8_t
	{
		Inven                 = 0,
		Buy                   = 1,
		Sell                  = 2,
		Destroy               = 3,
		Decompose             = 4,
		Enchant               = 5,
		ExchangeSale          = 6,
		ExchangeReceive       = 7,
		PersonalTrade         = 8,
		Repair                = 9,
		CharacterStorageInven = 10,
		AccountStorageInven   = 11,
		CharaceterStorage     = 12,
		AccountStorage        = 13,
		MaterialStorageInven  = 14,
		SupplyStorageInven    = 15,
		ShareStorageInven     = 16,
		ShareStorage          = 17,
		E_MAX                 = 18
	};

	/**
	 * Enum MirM.E_NameTagType
	 */
	enum class E_NameTagType : uint8_t
	{
		None                        = 0,
		MyPlayer                    = 1,
		OtherPlayer                 = 2,
		NPC                         = 3,
		Monster                     = 4,
		MySummon                    = 5,
		OtherPlayerSummon           = 6,
		DropItem                    = 7,
		WarFlag                     = 8,
		Pet                         = 9,
		SecretValleyDominationStone = 10,
		OtherPet                    = 11,
		E_MAX                       = 12
	};

	/**
	 * Enum MirM.E_PartyInfoThumbNailTextType
	 */
	enum class E_PartyInfoThumbNailTextType : uint8_t
	{
		Category  = 0,
		Join      = 1,
		PartyName = 2,
		Loot      = 3,
		Level     = 4,
		E_MAX     = 5
	};

	/**
	 * Enum MirM.E_PartyUserInfoSelect
	 */
	enum class E_PartyUserInfoSelect : uint8_t
	{
		None        = 0,
		Exile       = 1,
		OwnerChange = 2,
		E_MAX       = 3
	};

	/**
	 * Enum MirM.E_TutorialExcetionType
	 */
	enum class E_TutorialExcetionType : uint8_t
	{
		NONE        = 0,
		PLAYERDEATH = 1,
		CHANGEMAP   = 2,
		MAX         = 3
	};

	/**
	 * Enum MirM.E_TutorialQuestObjectValueType
	 */
	enum class E_TutorialQuestObjectValueType : uint8_t
	{
		NONE                  = 0,
		EQUIP_ENCHANT         = 1,
		SUBQUEST_ACCEPT       = 2,
		AREAQUEST_ACCEPT      = 3,
		BUYSKILLBOOK          = 4,
		EQUIP_RESMELT         = 5,
		EQUIP_BLESS           = 6,
		ACUPOINT_LEVELUP      = 7,
		EQUIP_DECOMPOSE       = 8,
		GUILD_JOIN            = 9,
		ATTACK_FIELDBOSS      = 10,
		ATTACK_WORLDBOSS      = 11,
		ENTERDUNGEON_MONARCH  = 12,
		ENTERDUNGEON_BOSS     = 13,
		ENTERDUNGEON_ILLUSION = 14,
		MAX                   = 15
	};

	/**
	 * Enum MirM.E_WantedSortType
	 */
	enum class E_WantedSortType : uint8_t
	{
		Reward     = 0,
		ExpireTime = 1,
		E_MAX      = 2
	};

	/**
	 * Enum MirM.EHUDLocationMemoryAlertType
	 */
	enum class EHUDLocationMemoryAlertType : uint8_t
	{
		Memory_Confirm = 0,
		Memory_Move    = 1,
		Memory_Delete  = 2,
		Max            = 3
	};

	/**
	 * Enum MirM.ECharacter_ItemDataType
	 */
	enum class ECharacter_ItemDataType : uint8_t
	{
		Inven = 0,
		Pet   = 1,
		Max   = 2
	};

	/**
	 * Enum MirM.E_HiddenStoryPopupType
	 */
	enum class E_HiddenStoryPopupType : uint8_t
	{
		UseItemInInventory          = 0,
		SelectPageInAdventureWindow = 1,
		Max                         = 2
	};

	/**
	 * Enum MirM.E_AdventureProgressState
	 */
	enum class E_AdventureProgressState : uint8_t
	{
		ImpossibleRecvReward = 0,
		PossibleRecvReward   = 1,
		CompleteRecvReward   = 2,
		Max                  = 3
	};

	/**
	 * Enum MirM.E_AdventureCollectItemState
	 */
	enum class E_AdventureCollectItemState : uint8_t
	{
		ImpossibleCollect = 0,
		PossibleCollect   = 1,
		CompleteCollect   = 2,
		Max               = 3
	};

	/**
	 * Enum MirM.E_PVP_TYPE
	 */
	enum class E_PVP_TYPE : uint8_t
	{
		Pk        = 0,
		Wanted    = 1,
		E_PVP_MAX = 2
	};

	/**
	 * Enum MirM.E_GuideItemTabType
	 */
	enum class E_GuideItemTabType : uint8_t
	{
		Trainning = 0,
		Master    = 1,
		UseItem   = 2,
		Max       = 3
	};

	/**
	 * Enum MirM.E_MentorPageType
	 */
	enum class E_MentorPageType : uint8_t
	{
		None       = 0,
		MentorPage = 1,
		MenteePage = 2,
		E_MAX      = 3
	};

	/**
	 * Enum MirM.E_SiegeWarfareAutoMoveType
	 */
	enum class E_SiegeWarfareAutoMoveType : uint8_t
	{
		LeftWall           = 0,
		GateWall           = 1,
		RightWall          = 2,
		SecretWallOut      = 3,
		SecretWallIn       = 4,
		Left_guard_tower   = 5,
		Center_guard_tower = 6,
		Right_guard_tower  = 7,
		Palace_out         = 8,
		Palace_in          = 9,
		Barricade1         = 10,
		Barricade2         = 11,
		Barricade3         = 12,
		Barricade4         = 13,
		Watching_Point     = 14,
		Max                = 15
	};

	/**
	 * Enum MirM.E_HUDTabBboxState
	 */
	enum class E_HUDTabBboxState : uint8_t
	{
		None                = 0,
		Quest               = 1,
		Party               = 2,
		Town                = 3,
		DamageMeter         = 4,
		MonsterList         = 5,
		SpawnDungeon        = 6,
		ScanBox             = 7,
		GuildWarBoard       = 8,
		DemonBattleRanking  = 9,
		SiegeWarfareNav     = 10,
		SiegeWarfareMission = 11,
		E_MAX               = 12
	};

	/**
	 * Enum MirM.E_HUDAlarmIcon
	 */
	enum class E_HUDAlarmIcon : uint8_t
	{
		NONE         = 0,
		WorldBoss    = 1,
		SiegeWarfare = 2,
		Treasure     = 3,
		NpcList      = 4,
		CashShop     = 5,
		GuildShipWar = 6,
		LordBless    = 7,
		Arena        = 8,
		StreetStall  = 9,
		Max          = 10
	};

	/**
	 * Enum MirM.E_MirDayOfWeek
	 */
	enum class E_MirDayOfWeek : uint8_t
	{
		Sunday    = 0,
		Monday    = 1,
		Tuesday   = 2,
		Wednesday = 3,
		Thursday  = 4,
		Friday    = 5,
		Saturday  = 6,
		Daily     = 7,
		Max       = 8
	};

	/**
	 * Enum MirM.E_TownBoxType
	 */
	enum class E_TownBoxType : uint8_t
	{
		None        = 0,
		Specialties = 1,
		Arsenal     = 2,
		Dinner      = 3,
		BossSummon  = 4,
		E_MAX       = 5
	};

	/**
	 * Enum MirM.E_BUY_TYPE
	 */
	enum class E_BUY_TYPE : uint8_t
	{
		ABLEITEM  = 0,
		ALLITEM   = 1,
		E_BUY_MAX = 2
	};

	/**
	 * Enum MirM.E_EnchantStoneSlotState
	 */
	enum class E_EnchantStoneSlotState : uint8_t
	{
		None     = 0,
		Locked   = 1,
		Opened   = 2,
		Equipped = 3,
		E_MAX    = 4
	};

	/**
	 * Enum MirM.EMirSoundType
	 */
	enum class EMirSoundType : uint8_t
	{
		BGM    = 0,
		Effect = 1,
		Voice  = 2,
		Max    = 3
	};

	/**
	 * Enum MirM.E_UseGuildMemberPage
	 */
	enum class E_UseGuildMemberPage : uint8_t
	{
		GuildPage        = 0,
		GuildDungeonPage = 1,
		Max              = 2
	};

	/**
	 * Enum MirM.E_TownInfoType
	 */
	enum class E_TownInfoType : uint8_t
	{
		None       = 0,
		Castle     = 1,
		TownManage = 2,
		MoveIn     = 3,
		TownGet    = 4,
		E_MAX      = 5
	};

	/**
	 * Enum MirM.E_shift_btn
	 */
	enum class E_shift_btn : uint8_t
	{
		Left        = 0,
		Right       = 1,
		E_shift_MAX = 2
	};

	/**
	 * Enum MirM.E_PossibleTownBuild
	 */
	enum class E_PossibleTownBuild : uint8_t
	{
		Possible                     = 0,
		NotEnoughGuildGold           = 1,
		NotEnoughItem                = 2,
		FullWork                     = 3,
		FullBuilding                 = 4,
		Impossible                   = 5,
		NotEnoughBuildingLevel       = 6,
		NotEnoughGuildGuildNlackIron = 7,
		E_MAX                        = 8
	};

	/**
	 * Enum MirM.E_TownState
	 */
	enum class E_TownState : uint8_t
	{
		None                = 0,
		Empty               = 1,
		Auction             = 2,
		Normal              = 3,
		AdjustByCastleOwner = 4,
		AdjustByTownOwner   = 5,
		Deport              = 6,
		E_MAX               = 7
	};

	/**
	 * Enum MirM.E_MeridianLevelUp_State
	 */
	enum class E_MeridianLevelUp_State : uint8_t
	{
		Acupoint              = 0,
		Acupoint01            = 1,
		Acupoint02            = 2,
		Acupoint03            = 3,
		Acupoint04            = 4,
		Meridian              = 5,
		NextMeridian          = 6,
		AllMax                = 7,
		NONE                  = 8,
		E_MeridianLevelUp_MAX = 9
	};

	/**
	 * Enum MirM.E_Error_MeridianLevelUp
	 */
	enum class E_Error_MeridianLevelUp : uint8_t
	{
		NONE                       = 0,
		ER_Meridian_MaxLv          = 1,
		ER_Meridian_NeedAcupointLv = 2,
		ER_Meridian_NeedPlayerLv   = 3,
		ER_Meridian_NeedItem       = 4,
		ER_Meridian_NeedGoods      = 5,
		ER_ETCError                = 6,
		E_Error_MAX                = 7
	};

	/**
	 * Enum MirM.E_StorageType
	 */
	enum class E_StorageType : uint8_t
	{
		Personal = 0,
		Guild    = 1,
		Max      = 2
	};

	/**
	 * Enum MirM.E_MailRefreshType
	 */
	enum class E_MailRefreshType : uint8_t
	{
		Remove  = 0,
		Opened  = 1,
		Receive = 2,
		Max     = 3
	};

	/**
	 * Enum MirM.E_GuildStorageMenu
	 */
	enum class E_GuildStorageMenu : uint8_t
	{
		Material     = 0,
		Treasure     = 1,
		Share        = 2,
		ShareRequest = 3,
		History      = 4,
		Max          = 5
	};

	/**
	 * Enum MirM.E_GuildStorageType
	 */
	enum class E_GuildStorageType : uint8_t
	{
		Supply   = 0,
		Material = 1,
		Treasure = 2,
		Share    = 3,
		Max      = 4
	};

	/**
	 * Enum MirM.E_PrivateStorageType
	 */
	enum class E_PrivateStorageType : uint8_t
	{
		None      = 0,
		Character = 1,
		Account   = 2,
		Share     = 3,
		Supply    = 4,
		Max       = 5
	};

	/**
	 * Enum MirM.E_METERGY_USER_TYPE
	 */
	enum class E_METERGY_USER_TYPE : uint8_t
	{
		BESTUSER           = 0,
		MYCHARACTER        = 1,
		OTHERUSER          = 2,
		NONEUSER           = 3,
		E_METERGY_USER_MAX = 4
	};

	/**
	 * Enum MirM.E_AUTOMOVE_TYPE
	 */
	enum class E_AUTOMOVE_TYPE : uint8_t
	{
		GUIDE            = 0,
		STORAGE          = 1,
		EXCHANGE         = 2,
		CRIME            = 3,
		DECOMPOSITION    = 4,
		ITEMSELL         = 5,
		BOSS_DUNGEON     = 6,
		ILLUSION_DUNGEON = 7,
		MONARCHDUNGEON   = 8,
		GUILDDUNGEON     = 9,
		GUILDSHOP        = 10,
		CASTLEDUNGEON    = 11,
		REPUTEQUEST      = 12,
		WARMANAGER       = 13,
		WARGENERAL       = 14,
		AIDE             = 15,
		MAX              = 16
	};

	/**
	 * Enum MirM.E_NOTIRECOMMEND_TYPE
	 */
	enum class E_NOTIRECOMMEND_TYPE : uint8_t
	{
		FIELD    = 0,
		DUNGEON  = 1,
		WEAPON   = 2,
		ARMOR    = 3,
		HELMET   = 4,
		BELT     = 5,
		SHOES    = 6,
		NECKLACE = 7,
		BRACELET = 8,
		RING     = 9,
		MAX      = 10
	};

	/**
	 * Enum MirM.ETaskState
	 */
	enum class ETaskState : uint8_t
	{
		TASK_WAIT        = 0,
		TASK_DOWNLOADING = 1,
		TASK_COMPLETED   = 2,
		TASK_ERROR       = 3,
		TASK_MAX         = 4
	};

	/**
	 * Enum MirM.ER_DirectContent
	 */
	enum class ER_DirectContent : uint8_t
	{
		None              = 0,
		Lock_LimitLV      = 1,
		Lock_CommingSoon  = 2,
		NotFoundArea      = 3,
		NotFoundObject    = 4,
		AlreadyDestArea   = 5,
		None_MovePosition = 6,
		ETC_Error         = 7,
		ER_MAX            = 8
	};

	/**
	 * Enum MirM.ItemAddOptionType
	 */
	enum class EItemAddOptionType : uint8_t
	{
		ItemAddOptionType__None                  = 0,
		ItemAddOptionType__UNIQUE                = 1,
		ItemAddOptionType__Luck                  = 2,
		ItemAddOptionType__Reinforce             = 3,
		ItemAddOptionType__Reclaim               = 4,
		ItemAddOptionType__Curse                 = 5,
		ItemAddOptionType__Advanced              = 6,
		ItemAddOptionType__Collect               = 7,
		ItemAddOptionType__ItemAddOptionType_MAX = 8
	};

	/**
	 * Enum MirM.AutoItemSelect_State
	 */
	enum class EAutoItemSelect_State : uint8_t
	{
		AutoItemSelect_State__Selling             = 0,
		AutoItemSelect_State__Destroy             = 1,
		AutoItemSelect_State__Decomposion         = 2,
		AutoItemSelect_State__AutoHuntDecomposion = 3,
		AutoItemSelect_State__AutoHuntSelling     = 4,
		AutoItemSelect_State__AutoItemSelect_MAX  = 5
	};

	/**
	 * Enum MirM.Profesion_State
	 */
	enum class EProfesion_State : uint8_t
	{
		Profesion_State__Make          = 0,
		Profesion_State__Update        = 1,
		Profesion_State__Reset         = 2,
		Profesion_State__Profesion_MAX = 3
	};

	/**
	 * Enum MirM.EAutoMannerMode
	 */
	enum class EAutoMannerMode : uint8_t
	{
		On                 = 0,
		Except_Party_Guild = 1,
		Off                = 2,
		Max                = 3
	};

	/**
	 * Enum MirM.E_AutoBuyPotionCount
	 */
	enum class E_AutoBuyPotionCount : uint8_t
	{
		None = 0,
		Low  = 1,
		Mid  = 2,
		High = 3,
		Max  = 4
	};

	/**
	 * Enum MirM.E_AutoBuyPotionCondition
	 */
	enum class E_AutoBuyPotionCondition : uint8_t
	{
		NotUse = 0,
		Low    = 1,
		Mid    = 2,
		High   = 3,
		Max    = 4
	};

	/**
	 * Enum MirM.E_AutoGuideSettingPopupType
	 */
	enum class E_AutoGuideSettingPopupType : uint8_t
	{
		Decomposition = 0,
		AutoSell      = 1,
		Max           = 2
	};

	/**
	 * Enum MirM.EAutoGuideTagGroupType
	 */
	enum class EAutoGuideTagGroupType : uint8_t
	{
		Level     = 0,
		Equip     = 1,
		Material  = 2,
		Profesion = 3,
		Max       = 4
	};

	/**
	 * Enum MirM.EBalanceMode
	 */
	enum class EBalanceMode : uint8_t
	{
		Easy   = 0,
		Normal = 1,
		Hard   = 2,
		Expert = 3,
		Max    = 4
	};

	/**
	 * Enum MirM.EAutoReturnCondition
	 */
	enum class EAutoReturnCondition : uint8_t
	{
		InvenSlot       = 0,
		InvenWeight     = 1,
		Hp              = 2,
		Mp              = 3,
		EquipDurability = 4,
		EXPCondition    = 5,
		Max             = 6
	};

	/**
	 * Enum MirM.EAutoReturnCount
	 */
	enum class EAutoReturnCount : uint8_t
	{
		Return          = 0,
		Return01        = 1,
		Return02        = 2,
		Return_Infinite = 3,
		Max             = 4
	};

	/**
	 * Enum MirM.EAutoReviveType
	 */
	enum class EAutoReviveType : uint8_t
	{
		Village     = 0,
		Immediately = 1,
		Max         = 2
	};

	/**
	 * Enum MirM.EAutoSearchRange
	 */
	enum class EAutoSearchRange : uint8_t
	{
		Short   = 0,
		Middle  = 1,
		Long    = 2,
		Unlimit = 3,
		Max     = 4
	};

	/**
	 * Enum MirM.EAutoSearchTarget
	 */
	enum class EAutoSearchTarget : uint8_t
	{
		Enemy            = 0,
		EnemyWithCollect = 1,
		Collect          = 2,
		Max              = 3
	};

	/**
	 * Enum MirM.EAscendingOrderSortType
	 */
	enum class EAscendingOrderSortType : uint8_t
	{
		Ascending  = 0,
		Descending = 1,
		MAX        = 2
	};

	/**
	 * Enum MirM.ETalkSelectType
	 */
	enum class ETalkSelectType : uint8_t
	{
		Buy                       = 0,
		Sell                      = 1,
		Quest                     = 2,
		QuestStart                = 3,
		SinPoint_Decrease         = 4,
		Repute_Quest              = 5,
		Exchange                  = 6,
		Profession_Upgrrade       = 7,
		Profession_Reset          = 8,
		Profession_Product        = 9,
		Decomposition             = 10,
		PersonalStorage           = 11,
		GuildStorage              = 12,
		Durability_Repair         = 13,
		Durability_Restore        = 14,
		Illusion_Dungeon          = 15,
		ConditionCharge           = 16,
		ConditionRecovery         = 17,
		war_tender                = 18,
		war_alliance              = 19,
		war_offence               = 20,
		war_defence               = 21,
		MonarchDungeon            = 22,
		town_manager              = 23,
		town_item_craft           = 24,
		town_arsenal              = 25,
		town_dinner               = 26,
		town_quest                = 27,
		GuildDungeon              = 28,
		tax_manage                = 29,
		offence_weapon            = 30,
		defence_weapon            = 31,
		town_specialties          = 32,
		town_specialties_delivery = 33,
		town_dungeon              = 34,
		castledungeon_all         = 35,
		castledungeon_owner       = 36,
		castledungeon_fee         = 37,
		SiegeNpcTeleport          = 38,
		war_observer              = 39,
		favorability              = 40,
		Max                       = 41
	};

	/**
	 * Enum MirM.E_ExchangePurchaseSortType
	 */
	enum class E_ExchangePurchaseSortType : uint8_t
	{
		Level = 0,
		Grade = 1,
		Price = 2,
		E_MAX = 3
	};

	/**
	 * Enum MirM.E_ExchangeRegistrationTime
	 */
	enum class E_ExchangeRegistrationTime : uint8_t
	{
		None   = 0,
		OneDay = 1,
		TwoDay = 2,
		E_MAX  = 3
	};

	/**
	 * Enum MirM.ProtectedSlot
	 */
	enum class EProtectedSlot : uint8_t
	{
		ProtectedSlot__OnPrtectedSlot    = 0,
		ProtectedSlot__UseItem           = 1,
		ProtectedSlot__ProtectedSlot_MAX = 2
	};

	/**
	 * Enum MirM.ItemTypeInfo
	 */
	enum class EItemTypeInfo : uint8_t
	{
		ItemTypeInfo__Enchant_AbleList = 0,
		ItemTypeInfo__Bless_AbleList   = 1,
		ItemTypeInfo__Resmelt_AbleList = 2,
		ItemTypeInfo__ItemTypeInfo_MAX = 3
	};

	/**
	 * Enum MirM.E_Reinforce_Result
	 */
	enum class E_Reinforce_Result : uint8_t
	{
		Reinforce_None        = 0,
		Reinforce_Success     = 1,
		Reinforce_Fail        = 2,
		Reinforce_Fail_Down   = 3,
		Reinforce_Big_Success = 4,
		Reinforce_MAX         = 5
	};

	/**
	 * Enum MirM.E_EnchantPage
	 */
	enum class E_EnchantPage : uint8_t
	{
		ENCHANT = 0,
		RESMELT = 1,
		BLESS   = 2,
		CONSUME = 3,
		E_MAX   = 4
	};

	/**
	 * Enum MirM.E_InventoryStatAbility
	 */
	enum class E_InventoryStatAbility : uint8_t
	{
		NONE     = 0,
		INCREASE = 1,
		DECREASE = 2,
		E_MAX    = 3
	};

	/**
	 * Enum MirM.E_InventoryExtendType
	 */
	enum class E_InventoryExtendType : uint8_t
	{
		Space  = 0,
		Weight = 1,
		E_MAX  = 2
	};

	/**
	 * Enum MirM.E_ItemTradeType
	 */
	enum class E_ItemTradeType : uint8_t
	{
		Buy             = 0,
		Selling         = 1,
		Destroy         = 2,
		Destroy_Multi   = 3,
		Destroy_Confirm = 4,
		Decompose       = 5,
		E_MAX           = 6
	};

	/**
	 * Enum MirM.E_InventorySortType
	 */
	enum class E_InventorySortType : uint8_t
	{
		Level       = 0,
		Grade       = 1,
		BattlePower = 2,
		Enchant     = 3,
		ETC_Level   = 4,
		ETC_Grade   = 5,
		ETC_Amount  = 6,
		ETC_Type    = 7,
		E_MAX       = 8
	};

	/**
	 * Enum MirM.E_Inventory_Pos
	 */
	enum class E_Inventory_Pos : uint8_t
	{
		None                  = 0,
		Bag                   = 1,
		ExchangeSale          = 2,
		ExchangeReceive       = 3,
		StorageKeep           = 4,
		StorageTake           = 5,
		Durability            = 6,
		PersonalTrade         = 7,
		GuildStorage          = 8,
		GuildStorageUserInven = 9,
		VehicleInven          = 10,
		Max                   = 11
	};

	/**
	 * Enum MirM.E_InventorySortOrder
	 */
	enum class E_InventorySortOrder : uint8_t
	{
		Ascending = 0,
		Dscending = 1,
		E_MAX     = 2
	};

	/**
	 * Enum MirM.E_InventoryTapType
	 */
	enum class E_InventoryTapType : uint8_t
	{
		All              = 0,
		Equipment        = 1,
		DragonStone      = 2,
		Costume          = 3,
		VehicleEquipment = 4,
		Etc              = 5,
		Weapon           = 6,
		Armor            = 7,
		Accessory        = 8,
		CharacterStorage = 9,
		AccountStorage   = 10,
		ShareStorage     = 11,
		Max              = 12
	};

	/**
	 * Enum MirM.E_PopupType
	 */
	enum class E_PopupType : uint8_t
	{
		Normal                   = 0,
		Progress                 = 1,
		PartyInvitation          = 2,
		InventorySpaceExtend     = 3,
		InventoryWeightExtend    = 4,
		WicknessedRecover        = 5,
		AutoGuideStatePopup      = 6,
		ItemAutoSelectPopup      = 7,
		TotalAndConsumPopup      = 8,
		NumExtendPopup           = 9,
		MoveStorage              = 10,
		PartyExileVote           = 11,
		SimplePurchase           = 12,
		RandomBoxSelectItemPopup = 13,
		RandomBoxRewardItemPopup = 14,
		TreasureBoxAlarmPopup    = 15,
		EditableTextPopup        = 16,
		WantedRegistRewardPopup  = 17,
		HiddenStoryPagePopup     = 18,
		ItemRegistSelectPopup    = 19,
		GuildInvitation          = 20,
		OfflineAutoHunt          = 21,
		DungeonInvitation        = 22,
		ItemCountConfirm         = 23,
		GoodsConfirmPopup        = 24,
		IconGoodsConfirmPopup    = 25,
		HiddenStoryCluePopup     = 26,
		CharacterDeletePopup     = 27,
		ContentsGuidePopup       = 28,
		SkillExp                 = 29,
		Learn                    = 30,
		EquipUseItem             = 31,
		ItemTrade                = 32,
		E_MAX                    = 33
	};

	/**
	 * Enum MirM.E_PopupButtonType
	 */
	enum class E_PopupButtonType : uint8_t
	{
		OnlyConfirm           = 0,
		WithCancel            = 1,
		None                  = 2,
		OnlyCancel            = 3,
		OnlyConfirmAndNoClose = 4,
		E_MAX                 = 5
	};

	/**
	 * Enum MirM.E_VehicleEquipSlotType
	 */
	enum class E_VehicleEquipSlotType : uint8_t
	{
		None          = 0,
		InvenSlot     = 1,
		EquipmentSlot = 2,
		E_MAX         = 3
	};

	/**
	 * Enum MirM.EVehicleHaveState
	 */
	enum class EVehicleHaveState : uint8_t
	{
		None           = 0,
		PossibleSummon = 1,
		Have           = 2,
		Max            = 3
	};

	/**
	 * Enum MirM.E_VehicleMenuType
	 */
	enum class E_VehicleMenuType : uint8_t
	{
		None    = 0,
		Vehicle = 1,
		Equip   = 2,
		E_MAX   = 3
	};

	/**
	 * Enum MirM.EVehicleSlotButtonType
	 */
	enum class EVehicleSlotButtonType : uint8_t
	{
		AcquisitionMethod = 0,
		Summon            = 1,
		Equip             = 2,
		Max               = 3
	};

	/**
	 * Enum MirM.ERotatingShaft
	 */
	enum class ERotatingShaft : uint8_t
	{
		Rotating_X_axis = 0,
		Rotating_Y_axis = 1,
		Rotating_Z_axis = 2,
		Rotating_MAX    = 3
	};

	/**
	 * Enum MirM.E_SlotState
	 */
	enum class E_SlotState : uint8_t
	{
		Empty    = 0,
		Normal   = 1,
		NotStack = 2,
		E_MAX    = 3
	};

	/**
	 * Enum MirM.E_MonsterSlotSize
	 */
	enum class E_MonsterSlotSize : uint8_t
	{
		Slotsize  = 0,
		SmallSize = 1,
		BigSize   = 2,
		E_MAX     = 3
	};

	/**
	 * Enum MirM.E_MonsterSlotType
	 */
	enum class E_MonsterSlotType : uint8_t
	{
		None     = 0,
		Register = 1,
		Select   = 2,
		E_MAX    = 3
	};

	/**
	 * Enum MirM.E_ANIMSTATE
	 */
	enum class E_ANIMSTATE : uint8_t
	{
		NONE     = 0,
		PROCEED  = 1,
		SUCCECSS = 2,
		E_MAX    = 3
	};

	/**
	 * Enum MirM.E_Login_Type
	 */
	enum class E_Login_Type : uint8_t
	{
		None            = 0,
		Quick           = 1,
		Normal          = 2,
		SeverChange     = 3,
		DevelopmentTest = 4,
		RetryConnect    = 5,
		ChannelChange   = 6,
		CharacterChange = 7,
		E_Login_MAX     = 8
	};

	/**
	 * Enum MirM.EMirQuestProgressHUDAnimationType
	 */
	enum class EMirQuestProgressHUDAnimationType : uint8_t
	{
		Hide = 0,
		Show = 1,
		MAX  = 2
	};

	/**
	 * Enum MirM.E_OPTION_SOUND_TYPE
	 */
	enum class E_OPTION_SOUND_TYPE : uint8_t
	{
		Master = 0,
		Bgm    = 1,
		Effect = 2,
		Voice  = 3,
		MAX    = 4
	};

	/**
	 * Enum MirM.ERewardTypeOfDungeonsBrowser
	 */
	enum class ERewardTypeOfDungeonsBrowser : uint8_t
	{
		DropItemReward  = 0,
		ClearRewardItem = 1,
		MAX             = 2
	};

	/**
	 * Enum MirM.EContentTypeOfDungeonsBrowser
	 */
	enum class EContentTypeOfDungeonsBrowser : uint8_t
	{
		Browser         = 0,
		EntryAsk        = 1,
		ReceiveEntryAsk = 2,
		MAX             = 3
	};

	/**
	 * Enum MirM.E_PartyActionState
	 */
	enum class E_PartyActionState : uint8_t
	{
		None               = 0,
		OwnerChange        = 1,
		PartyMemeberExile  = 2,
		VoteExileMemeber   = 3,
		PartyMemeberSummon = 4,
		E_MAX              = 5
	};

	/**
	 * Enum MirM.E_PartyInfoGroupButtonType
	 */
	enum class E_PartyInfoGroupButtonType : uint8_t
	{
		MovetoPartyCategoryLocation = 0,
		PartyPr                     = 1,
		PartyMemeberSummon          = 2,
		PartyMemeberExile           = 3,
		ExitParty                   = 4,
		MovetoPartyOwner            = 5,
		VoteExileMemeber            = 6,
		OwnerChange                 = 7,
		PratySetting                = 8,
		E_MAX                       = 9
	};

	/**
	 * Enum MirM.E_PartyInvitePopupType
	 */
	enum class E_PartyInvitePopupType : uint8_t
	{
		Area   = 0,
		Friend = 1,
		Guild  = 2,
		None   = 3,
		E_MAX  = 4
	};

	/**
	 * Enum MirM.E_PERSONAL_RANK_TYPE
	 */
	enum class E_PERSONAL_RANK_TYPE : uint8_t
	{
		LEVEL               = 0,
		POWER               = 1,
		E_PERSONAL_RANK_MAX = 2
	};

	/**
	 * Enum MirM.EPetTabType
	 */
	enum class EPetTabType : uint8_t
	{
		Slot    = 0,
		Inven   = 1,
		EndEnum = 2,
		MAX     = 3
	};

	/**
	 * Enum MirM.EPetEquipButtonType
	 */
	enum class EPetEquipButtonType : uint8_t
	{
		NA      = 0,
		Equip   = 1,
		Unequip = 2,
		Cancel  = 3,
		MAX     = 4
	};

	/**
	 * Enum MirM.PrefabMessageType
	 */
	enum class EPrefabMessageType : uint8_t
	{
		PrefabMessageType__WINDOW                = 0,
		PrefabMessageType__WINDOWONLY            = 1,
		PrefabMessageType__ALLWINDOWS            = 2,
		PrefabMessageType__PrefabMessageType_MAX = 3
	};

	/**
	 * Enum MirM.E_PROFESSIONINFO
	 */
	enum class E_PROFESSIONINFO : uint8_t
	{
		MINE  = 0,
		OTHER = 1,
		E_MAX = 2
	};

	/**
	 * Enum MirM.EMirPromotionShopState
	 */
	enum class EMirPromotionShopState : uint8_t
	{
		Rotate    = 0,
		Wait      = 1,
		Promotion = 2,
		Max       = 3
	};

	/**
	 * Enum MirM.EQuestState
	 */
	enum class EQuestState : uint8_t
	{
		None                     = 0,
		QuestPlaying             = 1,
		Rewardable               = 2,
		Completed                = 3,
		NeedMoreLV               = 4,
		NeedPrevQuest            = 5,
		ImpossibleQuest          = 6,
		NeedMoreGuildLV          = 7,
		NeedMoreGuildLV2         = 8,
		NeedPrevTuto             = 9,
		NeedPrevAreaQuest        = 10,
		QUEST_START_ITEM         = 11,
		NeedMoreProfesionLV      = 12,
		NeedMoreFieldBossKill    = 13,
		NeedMoreArenaBattleCount = 14,
		MAX                      = 15
	};

	/**
	 * Enum MirM.EQuestFilterType
	 */
	enum class EQuestFilterType : uint8_t
	{
		ALL        = 0,
		PROCEEDING = 1,
		ACCEPTABLE = 2,
		Max        = 3
	};

	/**
	 * Enum MirM.E_PotionUseOrderingData
	 */
	enum class E_PotionUseOrderingData : uint8_t
	{
		Higher = 0,
		Lower  = 1,
		E_MAX  = 2
	};

	/**
	 * Enum MirM.E_SCAN_TYPE
	 */
	enum class E_SCAN_TYPE : uint8_t
	{
		NORMAL_MONSTER   = 0,
		UNIQUE_MONSTER   = 1,
		BOSS_MONSTER     = 2,
		ALERT_USER       = 3,
		REVENGE_USER     = 4,
		ENEMY_GUILD_USER = 5,
		CHAO_USER        = 6,
		WANTED_USER      = 7,
		ENAMY_TEAM       = 8,
		MONSTER_SUMMON   = 9,
		NORMAL_USER      = 10,
		EndEnum          = 11,
		E_SCAN_MAX       = 12
	};

	/**
	 * Enum MirM.E_DROP_ITEM_GET_TYPE
	 */
	enum class E_DROP_ITEM_GET_TYPE : uint8_t
	{
		CHAR_OR_PET         = 0,
		PET                 = 1,
		NOT_GET             = 2,
		E_DROP_ITEM_GET_MAX = 3
	};

	/**
	 * Enum MirM.E_HUD_TARGET_VIEW_TYPE
	 */
	enum class E_HUD_TARGET_VIEW_TYPE : uint8_t
	{
		LIST                  = 0,
		TAP                   = 1,
		E_HUD_TARGET_VIEW_MAX = 2
	};

	/**
	 * Enum MirM.E_POTION_SETTING_TYPE
	 */
	enum class E_POTION_SETTING_TYPE : uint8_t
	{
		HP      = 0,
		MP      = 1,
		BUFF    = 2,
		RARE_HP = 3,
		RARE_MP = 4,
		MAX     = 5
	};

	/**
	 * Enum MirM.E_LocalSaveDataType
	 */
	enum class E_LocalSaveDataType : uint8_t
	{
		Game   = 0,
		Option = 1,
		Guide  = 2,
		E_MAX  = 3
	};

	/**
	 * Enum MirM.E_SetUpStreetStallExtraType
	 */
	enum class E_SetUpStreetStallExtraType : uint8_t
	{
		BlackSmith = 0,
		Alchemy    = 1,
		HandWork   = 2,
		Enchant    = 3,
		Max        = 4
	};

	/**
	 * Enum MirM.E_SWAutoMove
	 */
	enum class E_SWAutoMove : uint8_t
	{
		left_wall           = 0,
		right_wall          = 1,
		center_wall         = 2,
		left_1_guard_tower  = 3,
		left_2_guard_tower  = 4,
		right_1_guard_tower = 5,
		right_2_guard_tower = 6,
		palace              = 7,
		E_MAX               = 8
	};

	/**
	 * Enum MirM.E_SiegeWarfareHudMessage
	 */
	enum class E_SiegeWarfareHudMessage : uint8_t
	{
		None        = 0,
		BattleStart = 1,
		BattleEnd   = 2,
		E_MAX       = 3
	};

	/**
	 * Enum MirM.ESiegeWarfareScheduleStateType
	 */
	enum class ESiegeWarfareScheduleStateType : uint8_t
	{
		SiegeWarfareDateTime = 0,
		Tender               = 1,
		Prepare              = 2,
		EnterSiegeWarfare    = 3,
		SiegeWarfareProgress = 4,
		SiegeWarfareAllince  = 5,
		MAX                  = 6
	};

	/**
	 * Enum MirM.ESkillEventType
	 */
	enum class ESkillEventType : uint8_t
	{
		None    = 0,
		Learn   = 1,
		Levelup = 2,
		MAX     = 3
	};

	/**
	 * Enum MirM.E_MirSkillFramePageTabIdx
	 */
	enum class E_MirSkillFramePageTabIdx : uint8_t
	{
		MartialArts = 0,
		Force       = 1,
		MAX         = 2
	};

	/**
	 * Enum MirM.EMirProgressBarFillType
	 */
	enum class EMirProgressBarFillType : uint8_t
	{
		LeftToRight    = 0,
		RightToLeft    = 1,
		FillFromCenter = 2,
		TopToBottom    = 3,
		BottomToTop    = 4,
		RoundToLeft    = 5,
		RoundToRight   = 6,
		MAX            = 7
	};

	/**
	 * Enum MirM.ESpawnableEventMode
	 */
	enum class ESpawnableEventMode : uint8_t
	{
		Gacha      = 0,
		PetEnchant = 1,
		Vehicle    = 2,
		MultiGacha = 3,
		MAX        = 4
	};

	/**
	 * Enum MirM.ESpawnableEventButtonType
	 */
	enum class ESpawnableEventButtonType : uint8_t
	{
		None        = 0,
		Close       = 1,
		OpenAll     = 2,
		OpenThisNow = 3,
		ShowNext    = 4,
		Ok          = 5,
		SkipOpenAll = 6,
		MAX         = 7
	};

	/**
	 * Enum MirM.EBiddingCategoryTextType
	 */
	enum class EBiddingCategoryTextType : uint8_t
	{
		GuildName  = 0,
		MasterName = 1,
		Title      = 2,
		MAX        = 3
	};

	/**
	 * Enum MirM.E_BiddingStateTextType
	 */
	enum class E_BiddingStateTextType : uint8_t
	{
		MasterName  = 0,
		MasterCost  = 1,
		TenderCount = 2,
		Divide_Cost = 3,
		Enter_Check = 4,
		GuildName   = 5,
		E_MAX       = 6
	};

	/**
	 * Enum MirM.E_DivideTaxElementTextType
	 */
	enum class E_DivideTaxElementTextType : uint8_t
	{
		grade        = 0,
		name         = 1,
		contribution = 2,
		gold         = 3,
		E_MAX        = 4
	};

	/**
	 * Enum MirM.E_DivideTax_NumPadTextType
	 */
	enum class E_DivideTax_NumPadTextType : uint8_t
	{
		basic           = 0,
		CurrentTax      = 1,
		TotalTax        = 2,
		ChangeTaxNum    = 3,
		E_DivideTax_MAX = 4
	};

	/**
	 * Enum MirM.EGuild_DpInfoTextType
	 */
	enum class EGuild_DpInfoTextType : uint8_t
	{
		GuildName   = 0,
		GuildLevel  = 1,
		MasterName  = 2,
		MemberCount = 3,
		EGuild_MAX  = 4
	};

	/**
	 * Enum MirM.ETalkboxCameraType
	 */
	enum class ETalkboxCameraType : uint8_t
	{
		Player = 0,
		Npc    = 1,
		Scene  = 2,
		MAX    = 3
	};

	/**
	 * Enum MirM.ETalkboxType
	 */
	enum class ETalkboxType : uint8_t
	{
		TB_None   = 0,
		TB_Normal = 1,
		TB_Quest  = 2,
		TB_Reward = 3,
		TB_MAX    = 4
	};

	/**
	 * Enum MirM.E_TeamTag
	 */
	enum class E_TeamTag : uint8_t
	{
		ally_atk      = 0,
		ally_def      = 1,
		enemy_atk     = 2,
		enemy_def     = 3,
		watch_atk     = 4,
		watch_def     = 5,
		play_myself   = 6,
		watch_myself  = 7,
		guildwar_red  = 8,
		guildwar_blue = 9,
		Arena_myself  = 10,
		max           = 11
	};

	/**
	 * Enum MirM.EUSER_TITLEARCHIEVEPOSSIBLECOMPLETION
	 */
	enum class EUSER_TITLEARCHIEVEPOSSIBLECOMPLETION : uint8_t
	{
		POSSIBLECOMPLETE   = 0,
		IMPOSSIBLECOMPLETE = 1,
		MAX                = 2
	};

	/**
	 * Enum MirM.EUSER_TITLEACHIEVE_TAB_TYPE
	 */
	enum class EUSER_TITLEACHIEVE_TAB_TYPE : uint8_t
	{
		NONE     = 0,
		UPGROWTH = 1,
		BATTLE   = 2,
		LIFE     = 3,
		GUILD    = 4,
		SPECIAL  = 5,
		MAX      = 6
	};

	/**
	 * Enum MirM.EUSER_TITLE_PAGE_TYPE
	 */
	enum class EUSER_TITLE_PAGE_TYPE : uint8_t
	{
		NONE      = 0,
		ADVENTURE = 1,
		ACHIEVE   = 2,
		TITLE     = 3,
		MAX       = 4
	};

	/**
	 * Enum MirM.EWantedProgressState
	 */
	enum class EWantedProgressState : uint8_t
	{
		Progress = 0,
		Success  = 1,
		Fail     = 2,
		MAX      = 3
	};

	/**
	 * Enum MirM.EWantedRequestState
	 */
	enum class EWantedRequestState : uint8_t
	{
		Registable   = 0,
		Progress     = 1,
		UnRegistable = 2,
		MAX          = 3
	};

	/**
	 * Enum MirM.EWantedMenuIndex
	 */
	enum class EWantedMenuIndex : uint8_t
	{
		None    = 0,
		List    = 1,
		Request = 2,
		Reward  = 3,
		MAX     = 4
	};

	/**
	 * Enum MirM.EWFMapPageState
	 */
	enum class EWFMapPageState : uint8_t
	{
		NONE     = 0,
		FieldMap = 1,
		WorldMap = 2,
		MAX      = 3
	};

	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * ScriptStruct MirM.CFlagValues
	 * Size -> 0x0020
	 */
	struct FCFlagValues
	{
	public:
		TArray<ECFlag>                                             CFlagValueList;                                          // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		class FString                                              Parameters;                                              // 0x0010(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.AterImageData
	 * Size -> 0x0028
	 */
	struct FAterImageData
	{
	public:
		bool                                                       bUseTexture;                                             // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_WKKK[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Opacity;                                                 // 0x0004(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      LifeTime;                                                // 0x0008(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Speed;                                                   // 0x000C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		uint32_t                                                   count;                                                   // 0x0010(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Interval;                                                // 0x0014(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FColor                                              MeshColor;                                               // 0x0018(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      StartPosition;                                           // 0x001C(0x0004) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class UAnimationAsset*                                     CurrentAsset;                                            // 0x0020(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.AnimParticle
	 * Size -> 0x0048
	 */
	struct FAnimParticle
	{
	public:
		bool                                                       bAwakeSkill;                                             // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BW4C[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    Min_Skill_LV;                                            // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Max_Skill_LV;                                            // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bShowOnlyMyCharacter;                                    // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0P87[0x3];                                   // 0x000D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class UParticleSystem*                                     PSTemplate;                                              // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             LocationOffset;                                          // 0x0018(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            RotationOffset;                                          // 0x0024(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             Scale;                                                   // 0x0030(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bApplyOwnerScale;                                        // 0x003C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       Attached;                                                // 0x003D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GB0I[0x2];                                   // 0x003E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FName                                                SocketName;                                              // 0x0040(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.MirDirectingLightShowInfo
	 * Size -> 0x0001
	 */
	struct FMirDirectingLightShowInfo
	{
	public:
		bool                                                       Only_Owner_Player_;                                      // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.HuntingGuide_TableEntity
	 * Size -> 0x0080 (FullSize[0x0088] - InheritedSize[0x0008])
	 */
	struct FHuntingGuide_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    ID;                                                      // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    map_id;                                                  // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    sector_id;                                               // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    moveitem_id;                                             // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    description_id;                                          // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    position_id;                                             // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             hunting_location;                                        // 0x0020(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    mob_min_lv;                                              // 0x002C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    mob_max_lv;                                              // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    recommandpower;                                          // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    rewardmax_exp;                                           // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    rewardmax_gold;                                          // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<E_GRADE>                                            grade;                                                   // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            drop_rewarddp_id;                                        // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            collect_rewarddp_id;                                     // 0x0060(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		E_HUNTINGTAG_TYPE                                          huntingtag_type;                                         // 0x0070(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FOJJ[0x7];                                   // 0x0071(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              map_thumbnail;                                           // 0x0078(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.GrowthRate_Guide_TableEntity
	 * Size -> 0x0018 (FullSize[0x0020] - InheritedSize[0x0008])
	 */
	struct FGrowthRate_Guide_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    ID;                                                      // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    growth_group;                                            // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    group_stringid;                                          // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_GROWTH_TYPE                                              growth_type;                                             // 0x0014(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_D963[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    category_stringid;                                       // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    guide_location;                                          // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.Item_Guide_TableEntity
	 * Size -> 0x0070 (FullSize[0x0078] - InheritedSize[0x0008])
	 */
	struct FItem_Guide_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    item_id;                                                 // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_ITEM_MAINTYPE                                            item_maintype;                                           // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_EQUIP_TYPE                                               equip_type;                                              // 0x000D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_CLASS_TYPE                                               class_type;                                              // 0x000E(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X4N7[0x1];                                   // 0x000F(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    tier;                                                    // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_GRADE                                                    grade;                                                   // 0x0014(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RYEM[0x3];                                   // 0x0015(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    require_lv;                                              // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    itemfightingpower;                                       // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_HUNTINGTAG_TYPE                                          huntingtag_type;                                         // 0x0020(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LGQJ[0x7];                                   // 0x0021(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<E_ITEM_LOCATION_TYPE>                               item_location_type;                                      // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            location_title;                                          // 0x0038(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            location_des;                                            // 0x0048(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            item_location_value;                                     // 0x0058(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            item_location_value2;                                    // 0x0068(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.Profesion_Data
	 * Size -> 0x0010
	 */
	struct FProfesion_Data
	{
	public:
		int32_t                                                    Type;                                                    // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    cur_level;                                               // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Exp;                                                     // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    grade;                                                   // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.Notification_List_TableEntity
	 * Size -> 0x0030 (FullSize[0x0038] - InheritedSize[0x0008])
	 */
	struct FNotification_List_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    ID;                                                      // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_NOTI_TYPE                                                noti_type;                                               // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       notilist;                                                // 0x000D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_H4QH[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    noti_title;                                              // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    noti_description;                                        // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              noti_symbol;                                             // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    noti_priority;                                           // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    noti_location;                                           // 0x002C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       iscontentopenalarm;                                      // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4OST[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    system_manager_id;                                       // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.AvatarHaveInfo
	 * Size -> 0x0020
	 */
	struct FAvatarHaveInfo
	{
	public:
		int32_t                                                    TableId_;                                                // 0x0000(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Keep_Count_;                                             // 0x0004(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    EquipSlot_;                                              // 0x0008(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    AddCount_;                                               // 0x000C(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7V9X[0x10];                                  // 0x0010(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.AvatarResultInfo
	 * Size -> 0x0008
	 */
	struct FAvatarResultInfo
	{
	public:
		unsigned char                                              UnknownData_0PFX[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.DungeonControlRowForBP
	 * Size -> 0x0010
	 */
	struct FDungeonControlRowForBP
	{
	public:
		unsigned char                                              UnknownData_BL9I[0x10];                                  // 0x0000(0x0010) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.Dungeon_Control_TableEntity
	 * Size -> 0x0128 (FullSize[0x0130] - InheritedSize[0x0008])
	 */
	struct FDungeon_Control_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    ID;                                                      // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    dungeon_name_id;                                         // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    dungeon_description_id;                                  // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9T7Y[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int32_t>                                            dungeon_out_description_id;                              // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		class FString                                              ui_thumbnail_path;                                       // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    dungeon_thema_group;                                     // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    bossmonster_id;                                          // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_DUNGEON_TYPE                                             dungeon_type;                                            // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_ROOM_CHECK                                               room_check;                                              // 0x0041(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_DUNGEON_DIFFICULTY                                       dungeon_difficulty;                                      // 0x0042(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2G68[0x1];                                   // 0x0043(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    dungeonopen_clear_id;                                    // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_DUNGEON_ENTRANCE_TYPE                                    dungeon_entrance_type;                                   // 0x0048(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       dungeon_out_position_use;                                // 0x0049(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FTHB[0x2];                                   // 0x004A(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    entrance_map_id;                                         // 0x004C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    entrance_position;                                       // 0x0050(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    out_map_id;                                              // 0x0054(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    out_position;                                            // 0x0058(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_GROUP_CHECK                                              group_check;                                             // 0x005C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_PARTY_CHECK                                              party_check;                                             // 0x005D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FB0E[0x2];                                   // 0x005E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    min_crew;                                                // 0x0060(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    max_crew;                                                // 0x0064(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    map_max_usercount;                                       // 0x0068(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       automatching;                                            // 0x006C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       manual_enter;                                            // 0x006D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       pk_setup;                                                // 0x006E(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_PK_TYPE                                                  pk_type;                                                 // 0x006F(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       pk_penalty;                                              // 0x0070(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       durability_down;                                         // 0x0071(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FAS9[0x2];                                   // 0x0072(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    playcount_limit;                                         // 0x0074(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_OPENCONDITION_TYPE                                       opencondition_type;                                      // 0x0078(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_32Z3[0x3];                                   // 0x0079(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    opencondition_value;                                     // 0x007C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    require_level;                                           // 0x0080(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A02R[0x4];                                   // 0x0084(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<E_ITEM_MAINTYPE>                                    item_maintype;                                           // 0x0088(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            item_type;                                               // 0x0098(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            requireitem_count;                                       // 0x00A8(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    recommend_power;                                         // 0x00B8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    mob_minlv;                                               // 0x00BC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    mob_maxlv;                                               // 0x00C0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RD1W[0x4];                                   // 0x00C4(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int32_t>                                            dungeon_buff_id;                                         // 0x00C8(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    timelimit;                                               // 0x00D8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_DUNGEON_CLEAR_TYPE                                       dungeon_clear_type;                                      // 0x00DC(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3J9X[0x3];                                   // 0x00DD(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    rewardmax_exp;                                           // 0x00E0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    rewardmax_gold;                                          // 0x00E4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    rewardmax_forceexp;                                      // 0x00E8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    rewardgiudedp;                                           // 0x00EC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            rewarddp_id;                                             // 0x00F0(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<E_END_REWARD_TYPE>                                  end_reward_type;                                         // 0x0100(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            reward_id;                                               // 0x0110(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    warningtime;                                             // 0x0120(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    warningtime_message_id;                                  // 0x0124(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    success_finish_time;                                     // 0x0128(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    fail_finish_time;                                        // 0x012C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.PartLoadingData
	 * Size -> 0x0020
	 */
	struct FPartLoadingData
	{
	public:
		unsigned char                                              UnknownData_N97R[0x20];                                  // 0x0000(0x0020) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.ChattingTabInfo
	 * Size -> 0x0018
	 */
	struct FChattingTabInfo
	{
	public:
		EChatTabType                                               Tab_;                                                    // 0x0000(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_VE0M[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    SaveMaxLine_;                                            // 0x0004(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UChattingData*>                               MessageList_;                                            // 0x0008(0x0010) ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.ChatWhisper
	 * Size -> 0x0030
	 */
	struct FChatWhisper
	{
	public:
		int32_t                                                    SaveMaxLine_;                                            // 0x0000(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1MSE[0x4];                                   // 0x0004(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              strTargetNickName_;                                      // 0x0008(0x0010) BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<class UChattingData*>                               MessageList_;                                            // 0x0018(0x0010) BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int64_t                                                    lastUpdateTime_;                                         // 0x0028(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.Character_Data
	 * Size -> 0x0AD8
	 */
	struct FCharacter_Data
	{
	public:
		unsigned char                                              UnknownData_NYX2[0x18];                                  // 0x0000(0x0018) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              nickname;                                                // 0x0018(0x0010) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ID;                                                      // 0x0028(0x0004) BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OPP5[0xAAC];                                 // 0x002C(0x0AAC) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.REACTION_DATA
	 * Size -> 0x0030
	 */
	struct FREACTION_DATA
	{
	public:
		E_REACTION_TYPE                                            ReactionType;                                            // 0x0000(0x0001) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5IB3[0x3];                                   // 0x0001(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      Value1;                                                  // 0x0004(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      Value2;                                                  // 0x0008(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FRotator                                            Direction;                                               // 0x000C(0x000C) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic
		struct FVector                                             FinalPos;                                                // 0x0018(0x000C) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             StartPos;                                                // 0x0024(0x000C) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.CharacterEffectData
	 * Size -> 0x0010
	 */
	struct FCharacterEffectData
	{
	public:
		class UParticleSystem*                                     Particle;                                                // 0x0000(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FName                                                SocketName;                                              // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.Item_TableEntity
	 * Size -> 0x0150 (FullSize[0x0158] - InheritedSize[0x0008])
	 */
	struct FItem_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    ID;                                                      // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    item_group_id;                                           // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    tradeunable_itemid;                                      // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    name_id;                                                 // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    des_id;                                                  // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KUEM[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int32_t>                                            item_resource_id;                                        // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    require_lv;                                              // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    force_lv;                                                // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_GRADE                                                    grade;                                                   // 0x0038(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5XEX[0x3];                                   // 0x0039(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    tier;                                                    // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_WEAPON_TYPE                                              weapon_type;                                             // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_CHARACTER_TYPE                                           character_type;                                          // 0x0041(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_CLASS_TYPE                                               class_type;                                              // 0x0042(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_GENDER_TYPE                                              gender_type;                                             // 0x0043(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_INVENTORY_TYPE                                           inventory_type;                                          // 0x0044(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_ITEM_MAINTYPE                                            item_maintype;                                           // 0x0045(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FUZP[0x2];                                   // 0x0046(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    item_type;                                               // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_EXCHANGE_TYPE                                            exchange_type;                                           // 0x004C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       lock_type;                                               // 0x004D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_PARTS_HIDE                                               parts_hide;                                              // 0x004E(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_EQUIP_TYPE                                               equip_type;                                              // 0x004F(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_REINFORCE_TYPE                                           reinforce_type;                                          // 0x0050(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L36N[0x3];                                   // 0x0051(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    randombox_id;                                            // 0x0054(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    stack;                                                   // 0x0058(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    durability;                                              // 0x005C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       trade;                                                   // 0x0060(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       character_storage;                                       // 0x0061(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       account_storage;                                         // 0x0062(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       destroy;                                                 // 0x0063(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       sell;                                                    // 0x0064(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       decompositionyn;                                         // 0x0065(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       pk_drop;                                                 // 0x0066(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       repair;                                                  // 0x0067(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       encyclopediayn;                                          // 0x0068(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8EC9[0x3];                                   // 0x0069(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    sell_price;                                              // 0x006C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    item_luck_id;                                            // 0x0070(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    repair_price;                                            // 0x0074(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    weight;                                                  // 0x0078(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    reinforce_limit;                                         // 0x007C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    socket_count;                                            // 0x0080(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_PERIOD_TYPE                                              period_type;                                             // 0x0084(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L2O4[0x3];                                   // 0x0085(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              period_value;                                            // 0x0088(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    main_option_id;                                          // 0x0098(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YAXC[0x4];                                   // 0x009C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int32_t>                                            option_id;                                               // 0x00A0(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    set_passive_id;                                          // 0x00B0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    reinforce_option_id;                                     // 0x00B4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    passive_id;                                              // 0x00B8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    learnskill_id;                                           // 0x00BC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    get_skillexp;                                            // 0x00C0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    expand_value;                                            // 0x00C4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    get_exp;                                                 // 0x00C8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    getvehicle_id;                                           // 0x00CC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_EXCHANGE_PRICETYPE                                       exchange_pricetype;                                      // 0x00D0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E06V[0x3];                                   // 0x00D1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    exchange_fixedprice;                                     // 0x00D4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    exchange_minprice;                                       // 0x00D8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    exchange_defaultprice;                                   // 0x00DC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       itemfightingpower;                                       // 0x00E0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_SPAWN_TYPE                                               spawn_type;                                              // 0x00E1(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YF12[0x2];                                   // 0x00E2(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    spawnitemid;                                             // 0x00E4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    reinforce_effect_id;                                     // 0x00E8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_GUILD_MATERIAL                                           guild_material;                                          // 0x00EC(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       enchant;                                                 // 0x00ED(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4IPO[0x2];                                   // 0x00EE(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    create_enchant_rate;                                     // 0x00F0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    enchant_group_id;                                        // 0x00F4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       system_chat;                                             // 0x00F8(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LO2Q[0x3];                                   // 0x00F9(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    collect_item_ability_id;                                 // 0x00FC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       equipstoneyn;                                            // 0x0100(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_KH5E[0x3];                                   // 0x0101(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    equipstoneslotid;                                        // 0x0104(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    equipstone_ability_id;                                   // 0x0108(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    equipstone_enchantrate_groupid;                          // 0x010C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    equipstone_enchantvalue_groupid;                         // 0x0110(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    box_group_id;                                            // 0x0114(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    lost_story_id;                                           // 0x0118(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    intimacy;                                                // 0x011C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    subscription_id;                                         // 0x0120(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_CAP_COSTUME_TYPE                                         cap_costume_type;                                        // 0x0124(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       quickset;                                                // 0x0125(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       quickautoset;                                            // 0x0126(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0SKS[0x1];                                   // 0x0127(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    start_quest_id;                                          // 0x0128(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       info_button;                                             // 0x012C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_L454[0x3];                                   // 0x012D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    cuthairid;                                               // 0x0130(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       usecuthair;                                              // 0x0134(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_C2B2[0x3];                                   // 0x0135(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    groomhair_resource_id;                                   // 0x0138(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    subequipment_id;                                         // 0x013C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    instant_avatar_id;                                       // 0x0140(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    mandala_material;                                        // 0x0144(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       collection_yn;                                           // 0x0148(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DQHO[0x3];                                   // 0x0149(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    gettitle_id;                                             // 0x014C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    profesion_exp_incrase;                                   // 0x0150(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_T2SV[0x4];                                   // 0x0154(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.ExchangeItemCount
	 * Size -> 0x0168
	 */
	struct FExchangeItemCount
	{
	public:
		struct FItem_TableEntity                                   ItemTableEntity_;                                        // 0x0000(0x0158) Edit, BlueprintVisible, NativeAccessSpecifierPublic
		int32_t                                                    ItemCount_;                                              // 0x0158(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    ItemID_;                                                 // 0x015C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Price_;                                                  // 0x0160(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Reinforce_;                                              // 0x0164(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.Exchange_TableEntity
	 * Size -> 0x0018 (FullSize[0x0020] - InheritedSize[0x0008])
	 */
	struct FExchange_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    exchangecategoryid;                                      // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_CATEGORYBUTTON                                           categorybutton;                                          // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_EXCHANGE_CLASS_SORTING                                   exchange_class_sorting;                                  // 0x000D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_EXCHANGE_SORTING_TYPE                                    exchange_sorting_type;                                   // 0x000E(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_EXCHANGE_SORTING_ORDER                                   exchange_sorting_order;                                  // 0x000F(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_CATEGORY_TYPE                                            category_type;                                           // 0x0010(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_EXCHANGE_TYPE                                            exchange_type;                                           // 0x0011(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       detailbutton_yn;                                         // 0x0012(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OQNM[0x1];                                   // 0x0013(0x0001) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    categorybutton_stringid;                                 // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    detailbutton_stringid;                                   // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_M79R[0x4];                                   // 0x001C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.FieldMapContentVisibilityObj
	 * Size -> 0x0040
	 */
	struct FFieldMapContentVisibilityObj
	{
	public:
		TArray<class UFieldMapContentObj*>                         Contents;                                                // 0x0000(0x0010) Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_N449[0x30];                                  // 0x0010(0x0030) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.Map_TableEntity
	 * Size -> 0x0140 (FullSize[0x0148] - InheritedSize[0x0008])
	 */
	struct FMap_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    map_id;                                                  // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    mapname_id;                                              // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    map_groupid;                                             // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    floor_groupid;                                           // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    map_buffgroupid;                                         // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    groupname_id;                                            // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    mainname_id;                                             // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    world_mapname_id;                                        // 0x0024(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    info_minlv;                                              // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    info_maxlv;                                              // 0x002C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    map_listorder;                                           // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_MAP_TYPE                                                 map_type;                                                // 0x0034(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_OPENDUNGEON_CONTENT_TYPE                                 opendungeon_content_type;                                // 0x0035(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BVMJ[0x2];                                   // 0x0036(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    require_level;                                           // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    require_quest;                                           // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_REQUIRE_CASTLE_TYPE                                      require_castle_type;                                     // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       dungeon_placement_use;                                   // 0x0041(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_S77N[0x2];                                   // 0x0042(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    placement_group_id;                                      // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       auto_heal_area;                                          // 0x0048(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_AREAINFO                                                 areainfo;                                                // 0x0049(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_SIEGE_TYPE                                               siege_type;                                              // 0x004A(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       map_loading;                                             // 0x004B(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IQ89[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              resource_path;                                           // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              mapimage_path;                                           // 0x0060(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              loading_image;                                           // 0x0070(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              navigation_path;                                         // 0x0080(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector                                             start_position;                                          // 0x0090(0x000C) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       main_light;                                              // 0x009C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_98KJ[0x3];                                   // 0x009D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		float                                                      main_light_intensity;                                    // 0x00A0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      sub_light_intensity;                                     // 0x00A4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    min_x;                                                   // 0x00A8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    min_y;                                                   // 0x00AC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    max_x;                                                   // 0x00B0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    max_y;                                                   // 0x00B4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<int32_t>                                            window_id;                                               // 0x00B8(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		class FString                                              bgm_resource_path;                                       // 0x00C8(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FVector2D                                           worldmap_position;                                       // 0x00D8(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    worldmap_button;                                         // 0x00E0(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    destinationposition;                                     // 0x00E4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    vehicle_type;                                            // 0x00E8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    map_camera_yaw;                                          // 0x00EC(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       map_fog_active;                                          // 0x00F0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HSU1[0x3];                                   // 0x00F1(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    width_area_count;                                        // 0x00F4(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    length_area_count;                                       // 0x00F8(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_UPMB[0x4];                                   // 0x00FC(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              resource_path_m;                                         // 0x0100(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       trade_yn;                                                // 0x0110(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       movesync;                                                // 0x0111(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       npc_search;                                              // 0x0112(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       default_active_map;                                      // 0x0113(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       position_save_use;                                       // 0x0114(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       moveitem_use;                                            // 0x0115(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       partymove_use;                                           // 0x0116(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       etcmove_use;                                             // 0x0117(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    view_point_id;                                           // 0x0118(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       logout_autobattle;                                       // 0x011C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_R2JT[0x3];                                   // 0x011D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    max_usercount;                                           // 0x0120(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       multichannel;                                            // 0x0124(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RXTF[0x3];                                   // 0x0125(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              monster_spawn_fx;                                        // 0x0128(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      fieldmap_scale;                                          // 0x0138(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       avatar_use;                                              // 0x013C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       autohunt;                                                // 0x013D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       pk_setup;                                                // 0x013E(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_PK_TYPE                                                  pk_type;                                                 // 0x013F(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       death_penalty;                                           // 0x0140(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       pk_penalty;                                              // 0x0141(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_PK_PENALTY_EXCEPT_TIME                                   pk_penalty_except_time;                                  // 0x0142(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_REPUTE_PENALTY_EXCEPT_TARGET                             repute_penalty_except_target;                            // 0x0143(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       quarterview_camera;                                      // 0x0144(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       priority_closetarget;                                    // 0x0145(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       mannermode;                                              // 0x0146(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       monsterexpcorrection;                                    // 0x0147(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.PakDataInfo
	 * Size -> 0x0048
	 */
	struct FPakDataInfo
	{
	public:
		class FString                                              Name_;                                                   // 0x0000(0x0010) BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Hash_;                                                   // 0x0010(0x0010) BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    Size_;                                                   // 0x0020(0x0008) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              MountPosition_;                                          // 0x0028(0x0010) BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              PakHash_;                                                // 0x0038(0x0010) BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.Skill_Passive_TableEntity
	 * Size -> 0x0088 (FullSize[0x0090] - InheritedSize[0x0008])
	 */
	struct FSkill_Passive_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    passive_id;                                              // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    passive_group_id;                                        // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_PAS_CLASS_TYPE                                           pas_class_type;                                          // 0x0010(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_U2M6[0x3];                                   // 0x0011(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    passive_lv;                                              // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    passive_max_lv;                                          // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    passive_lv_exp;                                          // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              passive_icon;                                            // 0x0020(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    passive_name_id;                                         // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    commondescription_id;                                    // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    passive_des_id;                                          // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    list_order;                                              // 0x003C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_SKILL_TYPE                                               skill_type;                                              // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_K5PX[0x3];                                   // 0x0041(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    ability_id;                                              // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    skill_group_id;                                          // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NHB3[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<E_SKILL_REINFORCE_TYPE>                             skill_reinforce_type;                                    // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            skill_reinforce_value;                                   // 0x0060(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            slot_number;                                             // 0x0070(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		E_BUFF_INDICATOR_PRINT_TYPE                                buff_indicator_print_type;                               // 0x0080(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7MPH[0x3];                                   // 0x0081(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    buff_indicator_name_id;                                  // 0x0084(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    buff_indicator_desc_id;                                  // 0x0088(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_FF1D[0x4];                                   // 0x008C(0x0004) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.Skill_Force_Level_TableEntity
	 * Size -> 0x0020 (FullSize[0x0028] - InheritedSize[0x0008])
	 */
	struct FSkill_Force_Level_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    passive_id;                                              // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    passive_group_id;                                        // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    passive_lv;                                              // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    passive_lv_exp;                                          // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    require_level;                                           // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    require_item_id;                                         // 0x001C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    require_item_count;                                      // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    item_id;                                                 // 0x0024(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.MirHitSound
	 * Size -> 0x0010
	 */
	struct FMirHitSound
	{
	public:
		E_CLASS_TYPE                                               ClassType;                                               // 0x0000(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_WEAPON_TYPE                                              WeaponType;                                              // 0x0001(0x0001) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3Z6H[0x6];                                   // 0x0002(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class USoundBase*                                          sound;                                                   // 0x0008(0x0008) Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.WorldBossSchedule
	 * Size -> 0x0020
	 */
	struct FWorldBossSchedule
	{
	public:
		E_MirDayOfWeek                                             DayOfWeek_;                                              // 0x0000(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_C1DS[0x7];                                   // 0x0001(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		struct FDateTime                                           NotiTime_;                                               // 0x0008(0x0008) Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           SpawnTime_;                                              // 0x0010(0x0008) Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		struct FDateTime                                           RunawayTime_;                                            // 0x0018(0x0008) Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.TeleportAreaMemory
	 * Size -> 0x0018
	 */
	struct FTeleportAreaMemory
	{
	public:
		class FString                                              strName_;                                                // 0x0000(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    map_id_;                                                 // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    tile_index_;                                             // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.PotionSettingData
	 * Size -> 0x000C
	 */
	struct FPotionSettingData
	{
	public:
		int32_t                                                    PotionItemId;                                            // 0x0000(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    PotionPercent;                                           // 0x0004(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       bIsUse;                                                  // 0x0008(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_TVD7[0x3];                                   // 0x0009(0x0003) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.ComposeMaterialInfo
	 * Size -> 0x0020
	 */
	struct FComposeMaterialInfo
	{
	public:
		int32_t                                                    TargetID_;                                               // 0x0000(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TabCategory_;                                            // 0x0004(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NeedMaterialID_;                                         // 0x0008(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NeedMaterialCount_;                                      // 0x000C(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    CurrentHaveNeedMaterialCount_;                           // 0x0010(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    MakeAbleCount_;                                          // 0x0014(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    TotalMakeAbleCount_;                                     // 0x0018(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    NeedBlackIronCount_;                                     // 0x001C(0x0004) BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.Mentor_Buff_TableEntity
	 * Size -> 0x0050 (FullSize[0x0058] - InheritedSize[0x0008])
	 */
	struct FMentor_Buff_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    ID;                                                      // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_MENTOR_TARGET                                            mentor_target;                                           // 0x000C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		E_BUFFUSE_TYPE                                             buffuse_type;                                            // 0x000D(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7JN9[0x2];                                   // 0x000E(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    need_mentor_point;                                       // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_PHBU[0x4];                                   // 0x0014(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int32_t>                                            skill_id;                                                // 0x0018(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            ability_name_id;                                         // 0x0028(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            ability_string_id;                                       // 0x0038(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<class FString>                                      ability_icon;                                            // 0x0048(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
	};

	/**
	 * ScriptStruct MirM.AnimMachineStateIndex
	 * Size -> 0x0008
	 */
	struct FAnimMachineStateIndex
	{
	public:
		unsigned char                                              UnknownData_JA2A[0x8];                                   // 0x0000(0x0008) MISSED OFFSET (PADDING)
	};

	/**
	 * ScriptStruct MirM.Dungeon_Boss_TableEntity
	 * Size -> 0x0128 (FullSize[0x0130] - InheritedSize[0x0008])
	 */
	struct FDungeon_Boss_TableEntity : public FTableRowBase
	{
	public:
		int32_t                                                    ID;                                                      // 0x0008(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    dungeon_group_id;                                        // 0x000C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    start_map_id;                                            // 0x0010(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    start_position;                                          // 0x0014(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      death_penalty_time;                                      // 0x0018(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       monster_respawn;                                         // 0x001C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Q0FL[0x3];                                   // 0x001D(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    boss_reward_drop;                                        // 0x0020(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    gate_celltransform_id;                                   // 0x0024(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    keepgate_object;                                         // 0x0028(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ENSW[0x4];                                   // 0x002C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int32_t>                                            clear_description;                                       // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<E_CLEAR_TYPE>                                       clear_type;                                              // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<int32_t>                                            clear_quantity;                                          // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
