#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function MirM.MirPrefab.SendPrefabMessage
	 */
	struct UMirPrefab_SendPrefabMessage_Params
	{
	public:
		class FName                                                TargetTag;                                               // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		EPrefabMessageType                                         PrefabMessageSendType;                                   // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                PrefabMessage;                                           // 0x000C(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              PrefabParameters;                                        // 0x0018(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.ReceivePrefabMessage
	 */
	struct UMirPrefab_ReceivePrefabMessage_Params
	{
	public:
		class FName                                                Tag;                                                     // 0x0000(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FName                                                PrefabMessage;                                           // 0x0008(0x0008)  (ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              PrefabParameters;                                        // 0x0010(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.OnStartCustomEntryEvent
	 */
	struct UMirPrefab_OnStartCustomEntryEvent_Params
	{	};

	/**
	 * Function MirM.MirPrefab.OnSkipCustomEntryEvent
	 */
	struct UMirPrefab_OnSkipCustomEntryEvent_Params
	{	};

	/**
	 * Function MirM.MirPrefab.OnSetVisible
	 */
	struct UMirPrefab_OnSetVisible_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.OnReceivePrefabMessage
	 */
	struct UMirPrefab_OnReceivePrefabMessage_Params
	{
	public:
		class FName                                                PrefabMessage;                                           // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              PrefabParameters;                                        // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.OnInitailizeWidget
	 */
	struct UMirPrefab_OnInitailizeWidget_Params
	{
	public:
		class FString                                              Parameters;                                              // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.OnChangeCflag
	 */
	struct UMirPrefab_OnChangeCflag_Params
	{
	public:
		struct FCFlagValues                                        CFlagValues;                                             // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.IsInitialized
	 */
	struct UMirPrefab_IsInitialized_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.GetTutorialDynamicTargetConditionValue
	 */
	struct UMirPrefab_GetTutorialDynamicTargetConditionValue_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.GetMirWindow
	 */
	struct UMirPrefab_GetMirWindow_Params
	{
	public:
		class AMirWindow*                                          ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.ClickForTutorial
	 */
	struct UMirPrefab_ClickForTutorial_Params
	{
	public:
		int32_t                                                    ExtraTypeNo;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPrefab.ChangeCflag
	 */
	struct UMirPrefab_ChangeCflag_Params
	{
	public:
		struct FCFlagValues                                        CFlagValues;                                             // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureCollectIcon.SetIcon
	 */
	struct UAdventureCollectIcon_SetIcon_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CollectionItemId;                                        // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ItemId;                                                  // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		E_AdventureCollectItemState                                State;                                                   // 0x000C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureCollectIcon.ClickButton
	 */
	struct UAdventureCollectIcon_ClickButton_Params
	{	};

	/**
	 * Function MirM.AdventureCollectItemRegist.Init
	 */
	struct UAdventureCollectItemRegist_Init_Params
	{
	public:
		int32_t                                                    Index;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CollectionItemId;                                        // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    ItemId;                                                  // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    CategoryId;                                              // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureCollectItemRegist.Confirm
	 */
	struct UAdventureCollectItemRegist_Confirm_Params
	{	};

	/**
	 * Function MirM.AdventureCollectItemRegist.Close
	 */
	struct UAdventureCollectItemRegist_Close_Params
	{	};

	/**
	 * Function MirM.AdventureCollectItemRegSlot.SelectSlot
	 */
	struct UAdventureCollectItemRegSlot_SelectSlot_Params
	{	};

	/**
	 * Function MirM.AdventureCollectItemRegSlot.OnSetSelectImage
	 */
	struct UAdventureCollectItemRegSlot_OnSetSelectImage_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureCollectItemRegSlot.Init
	 */
	struct UAdventureCollectItemRegSlot_Init_Params
	{
	public:
		class UAdventureCollectItemRegist*                         Parent;                                                  // 0x0000(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    SlotIndex;                                               // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int64_t                                                    ItemUid;                                                 // 0x0010(0x0008)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsTradable;                                              // 0x0018(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureCollectItemRegSlot.GetItemUId
	 */
	struct UAdventureCollectItemRegSlot_GetItemUId_Params
	{
	public:
		int64_t                                                    ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPage.OpenExtraPage
	 */
	struct UMirPage_OpenExtraPage_Params
	{
	public:
		int32_t                                                    ExtraPageIdx;                                            // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Parameter;                                               // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UMirPage*                                            ReturnValue;                                             // 0x0018(0x0008)  (ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPage.OnSetActive
	 */
	struct UMirPage_OnSetActive_Params
	{
	public:
		bool                                                       IsActive;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Parameters;                                              // 0x0008(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPage.OnResumeState
	 */
	struct UMirPage_OnResumeState_Params
	{	};

	/**
	 * Function MirM.MirPage.OnPauseState
	 */
	struct UMirPage_OnPauseState_Params
	{	};

	/**
	 * Function MirM.MirPage.OnCreateMirPage
	 */
	struct UMirPage_OnCreateMirPage_Params
	{
	public:
		class FString                                              Parameters;                                              // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.MirPage.OnCloseNotify
	 */
	struct UMirPage_OnCloseNotify_Params
	{	};

	/**
	 * Function MirM.MirPage.GetZorder
	 */
	struct UMirPage_GetZorder_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureJournalPage.SelectAdventureJournalPage
	 */
	struct UAdventureJournalPage_SelectAdventureJournalPage_Params
	{	};

	/**
	 * Function MirM.AdventureJournalPage.CloseObjectInfoPop
	 */
	struct UAdventureJournalPage_CloseObjectInfoPop_Params
	{	};

	/**
	 * Function MirM.AdventureJournalPage.Close
	 */
	struct UAdventureJournalPage_Close_Params
	{	};

	/**
	 * Function MirM.AdventureJournalPage.ClickWorldBossBtn
	 */
	struct UAdventureJournalPage_ClickWorldBossBtn_Params
	{	};

	/**
	 * Function MirM.AdventureMonsterIcon.SetIcon
	 */
	struct UAdventureMonsterIcon_SetIcon_Params
	{
	public:
		int32_t                                                    LocalCollectMonsterTableId;                              // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsFirstKill;                                             // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureMonsterIcon.ClickButton
	 */
	struct UAdventureMonsterIcon_ClickButton_Params
	{	};

	/**
	 * Function MirM.AdventureNPCIcon.SetIcon
	 */
	struct UAdventureNPCIcon_SetIcon_Params
	{
	public:
		int32_t                                                    NPCIntimacyId;                                           // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      Percent;                                                 // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureNPCIcon.OnGaugeColor
	 */
	struct UAdventureNPCIcon_OnGaugeColor_Params
	{
	public:
		E_INTIMACY_GRADE_TYPE                                      GradeType;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureNPCIcon.ClickButton
	 */
	struct UAdventureNPCIcon_ClickButton_Params
	{	};

	/**
	 * Function MirM.AdventureProgressIcon.SetIcon
	 */
	struct UAdventureProgressIcon_SetIcon_Params
	{
	public:
		int32_t                                                    CollectionTableId;                                       // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Index;                                                   // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    TotalPercent;                                            // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		E_AdventureProgressState                                   ProgressState;                                           // 0x000C(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureProgressIcon.ClickButton
	 */
	struct UAdventureProgressIcon_ClickButton_Params
	{	};

	/**
	 * Function MirM.AdventureViewPointIcon.SetIcon
	 */
	struct UAdventureViewPointIcon_SetIcon_Params
	{
	public:
		int32_t                                                    ViewPointId;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsFind;                                                  // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AdventureViewPointIcon.ClickIcon
	 */
	struct UAdventureViewPointIcon_ClickIcon_Params
	{	};

	/**
	 * Function MirM.AlarmManager.UnLockContentsAlarm
	 */
	struct UAlarmManager_UnLockContentsAlarm_Params
	{
	public:
		int32_t                                                    systemindex;                                             // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.SetIgnoreAlarm
	 */
	struct UAlarmManager_SetIgnoreAlarm_Params
	{
	public:
		E_NOTI_TYPE                                                Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.SetCollapseAlarm
	 */
	struct UAlarmManager_SetCollapseAlarm_Params
	{
	public:
		E_NOTI_TYPE                                                Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.ReleaseIgnoreAlarm
	 */
	struct UAlarmManager_ReleaseIgnoreAlarm_Params
	{
	public:
		E_NOTI_TYPE                                                Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.ReleaseCollapseAlarm
	 */
	struct UAlarmManager_ReleaseCollapseAlarm_Params
	{
	public:
		E_NOTI_TYPE                                                Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.IsIgnoreAlarm
	 */
	struct UAlarmManager_IsIgnoreAlarm_Params
	{
	public:
		E_NOTI_TYPE                                                Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.IsCollapseAlarm
	 */
	struct UAlarmManager_IsCollapseAlarm_Params
	{
	public:
		E_NOTI_TYPE                                                Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.GetAlarmStateWithParameter
	 */
	struct UAlarmManager_GetAlarmStateWithParameter_Params
	{
	public:
		E_NOTI_TYPE                                                Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class FString                                              Param;                                                   // 0x0008(0x0010)  (Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		E_NOTI_Alarm                                               ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.GetAlarmState
	 */
	struct UAlarmManager_GetAlarmState_Params
	{
	public:
		TArray<E_NOTI_TYPE>                                        Types;                                                   // 0x0000(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
		E_NOTI_Alarm                                               ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.GetAlarmManager
	 */
	struct UAlarmManager_GetAlarmManager_Params
	{
	public:
		class UAlarmManager*                                       ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.GetAlarm
	 */
	struct UAlarmManager_GetAlarm_Params
	{
	public:
		E_NOTI_TYPE                                                Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		E_NOTI_Alarm                                               ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmManager.ConfirmNewAlarm
	 */
	struct UAlarmManager_ConfirmNewAlarm_Params
	{
	public:
		E_NOTI_TYPE                                                Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		E_NOTI_Alarm                                               ReturnValue;                                             // 0x0001(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.BaseAlarmPrefab.Confirm_NOTI_Alarm
	 */
	struct UBaseAlarmPrefab_Confirm_NOTI_Alarm_Params
	{	};

	/**
	 * Function MirM.BaseAlarmPrefab.AlarmChanged_impl
	 */
	struct UBaseAlarmPrefab_AlarmChanged_impl_Params
	{	};

	/**
	 * Function MirM.AlarmPrefab.SetForcedChangeAlarmState
	 */
	struct UAlarmPrefab_SetForcedChangeAlarmState_Params
	{
	public:
		E_NOTI_Alarm                                               State;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmPrefab.ResetAlarmList
	 */
	struct UAlarmPrefab_ResetAlarmList_Params
	{
	public:
		TArray<E_NOTI_TYPE>                                        vals;                                                    // 0x0000(0x0010)  (Parm, ZeroConstructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AlarmPrefab.ReleaseForcedChangeAlarmState
	 */
	struct UAlarmPrefab_ReleaseForcedChangeAlarmState_Params
	{	};

	/**
	 * Function MirM.AlarmPrefab.OnPreSet
	 */
	struct UAlarmPrefab_OnPreSet_Params
	{	};

	/**
	 * Function MirM.AlarmPrefab.IsForcedState
	 */
	struct UAlarmPrefab_IsForcedState_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.SortItemGuideDataList
	 */
	struct UAutoGuide_HuntingPage_SortItemGuideDataList_Params
	{	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.SetTagType
	 */
	struct UAutoGuide_HuntingPage_SetTagType_Params
	{
	public:
		EAutoGuideTagGroupType                                     Type;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.SetTabName
	 */
	struct UAutoGuide_HuntingPage_SetTabName_Params
	{
	public:
		int32_t                                                    Idx;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    nameid;                                                  // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.SetSlotVisibility
	 */
	struct UAutoGuide_HuntingPage_SetSlotVisibility_Params
	{
	public:
		int32_t                                                    Idx;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bVisible;                                                // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.SetSlot
	 */
	struct UAutoGuide_HuntingPage_SetSlot_Params
	{
	public:
		int32_t                                                    Idx;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FHuntingGuide_TableEntity                           tableData;                                               // 0x0008(0x0088)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       isRecommend;                                             // 0x0090(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.SetItemSlotVisibility
	 */
	struct UAutoGuide_HuntingPage_SetItemSlotVisibility_Params
	{
	public:
		int32_t                                                    Idx;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bVisible;                                                // 0x0004(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.SetItemSlot
	 */
	struct UAutoGuide_HuntingPage_SetItemSlot_Params
	{
	public:
		int32_t                                                    Idx;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FItem_Guide_TableEntity                             tableData;                                               // 0x0008(0x0078)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       isRecommend;                                             // 0x0080(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.SetGuidePage
	 */
	struct UAutoGuide_HuntingPage_SetGuidePage_Params
	{
	public:
		E_HUNTINGTAG_TYPE                                          eTagType;                                                // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    PageIdx;                                                 // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       bRefresh;                                                // 0x0008(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.RefreshPage
	 */
	struct UAutoGuide_HuntingPage_RefreshPage_Params
	{
	public:
		bool                                                       isHunting;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    RecommendID;                                             // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    PageIdx;                                                 // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.OpenItemInfoPopup
	 */
	struct UAutoGuide_HuntingPage_OpenItemInfoPopup_Params
	{
	public:
		struct FItem_Guide_TableEntity                             tableData;                                               // 0x0000(0x0078)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.OnClickSearchButton
	 */
	struct UAutoGuide_HuntingPage_OnClickSearchButton_Params
	{
	public:
		class FText                                                txtSearchWord;                                           // 0x0000(0x0018)  (Parm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0018(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.OnChangedPage
	 */
	struct UAutoGuide_HuntingPage_OnChangedPage_Params
	{
	public:
		int32_t                                                    currentPageIdx;                                          // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    totalPageCnt;                                            // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.GetSlotCount
	 */
	struct UAutoGuide_HuntingPage_GetSlotCount_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.GetShowOnlyRecommendState
	 */
	struct UAutoGuide_HuntingPage_GetShowOnlyRecommendState_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.GetItemSlotCount
	 */
	struct UAutoGuide_HuntingPage_GetItemSlotCount_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingPage.ChangeTabIdx
	 */
	struct UAutoGuide_HuntingPage_ChangeTabIdx_Params
	{
	public:
		int32_t                                                    tabIdx;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.SetTitle
	 */
	struct UAutoGuide_HuntingSlot_SetTitle_Params
	{
	public:
		int32_t                                                    nameid;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.SetThumbIcon
	 */
	struct UAutoGuide_HuntingSlot_SetThumbIcon_Params
	{
	public:
		class FString                                              strImgPath;                                              // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.SetSlotData
	 */
	struct UAutoGuide_HuntingSlot_SetSlotData_Params
	{
	public:
		struct FHuntingGuide_TableEntity                           tableData;                                               // 0x0000(0x0088)  (ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0088(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.SetRewardScroll
	 */
	struct UAutoGuide_HuntingSlot_SetRewardScroll_Params
	{	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.SetContentsRecommend
	 */
	struct UAutoGuide_HuntingSlot_SetContentsRecommend_Params
	{
	public:
		bool                                                       isRecommend;                                             // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.SetContentsPower
	 */
	struct UAutoGuide_HuntingSlot_SetContentsPower_Params
	{
	public:
		int32_t                                                    power;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.SetContentsLevel
	 */
	struct UAutoGuide_HuntingSlot_SetContentsLevel_Params
	{
	public:
		bool                                                       bUse;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Min;                                                     // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Max;                                                     // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.OnClickSlot
	 */
	struct UAutoGuide_HuntingSlot_OnClickSlot_Params
	{	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.OnChangedData
	 */
	struct UAutoGuide_HuntingSlot_OnChangedData_Params
	{	};

	/**
	 * Function MirM.AutoGuide_HuntingSlot.callbackRewardScroll
	 */
	struct UAutoGuide_HuntingSlot_callbackRewardScroll_Params
	{
	public:
		int32_t                                                    ItemIndex;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UWidget*                                             ListItemWidget;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetTitle
	 */
	struct UAutoGuide_HuntingStageInfo_SetTitle_Params
	{
	public:
		int32_t                                                    nameid;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetThumbIcon
	 */
	struct UAutoGuide_HuntingStageInfo_SetThumbIcon_Params
	{
	public:
		class FString                                              strImgPath;                                              // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetSlotData
	 */
	struct UAutoGuide_HuntingStageInfo_SetSlotData_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetShowOnlyMyClass
	 */
	struct UAutoGuide_HuntingStageInfo_SetShowOnlyMyClass_Params
	{
	public:
		bool                                                       isOnlyMyClass;                                           // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetRewardScroll
	 */
	struct UAutoGuide_HuntingStageInfo_SetRewardScroll_Params
	{	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetRewardItemInfos
	 */
	struct UAutoGuide_HuntingStageInfo_SetRewardItemInfos_Params
	{	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetMyPower
	 */
	struct UAutoGuide_HuntingStageInfo_SetMyPower_Params
	{
	public:
		int32_t                                                    power;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetContentsPower
	 */
	struct UAutoGuide_HuntingStageInfo_SetContentsPower_Params
	{
	public:
		int32_t                                                    power;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetContentsLevel
	 */
	struct UAutoGuide_HuntingStageInfo_SetContentsLevel_Params
	{
	public:
		bool                                                       bUse;                                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Min;                                                     // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    Max;                                                     // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.SetCollectItemInfos
	 */
	struct UAutoGuide_HuntingStageInfo_SetCollectItemInfos_Params
	{	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.OnClickAutoHunt
	 */
	struct UAutoGuide_HuntingStageInfo_OnClickAutoHunt_Params
	{	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.OnChangedData
	 */
	struct UAutoGuide_HuntingStageInfo_OnChangedData_Params
	{	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.Init
	 */
	struct UAutoGuide_HuntingStageInfo_Init_Params
	{
	public:
		int32_t                                                    inMapID;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0004(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.CheckHaveViewPoint
	 */
	struct UAutoGuide_HuntingStageInfo_CheckHaveViewPoint_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_HuntingStageInfo.callbackRewardScroll
	 */
	struct UAutoGuide_HuntingStageInfo_callbackRewardScroll_Params
	{
	public:
		int32_t                                                    ItemIndex;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UWidget*                                             ListItemWidget;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoGageGroupPrefab.SetGrowthScrollItem
	 */
	struct UAutoGuide_InfoGageGroupPrefab_SetGrowthScrollItem_Params
	{
	public:
		int32_t                                                    ItemIndex;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UWidget*                                             ListItemWidget;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoGageGroupPrefab.SetGrowthGroupID
	 */
	struct UAutoGuide_InfoGageGroupPrefab_SetGrowthGroupID_Params
	{
	public:
		int32_t                                                    GroupID;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		float                                                      ReturnValue;                                             // 0x0004(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoGageGroupPrefab.SetGroupOpenState
	 */
	struct UAutoGuide_InfoGageGroupPrefab_SetGroupOpenState_Params
	{
	public:
		bool                                                       IsOpen;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoGageGroupPrefab.OnClickOpenGroup
	 */
	struct UAutoGuide_InfoGageGroupPrefab_OnClickOpenGroup_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoGageGroupPrefab.GetTotalValue
	 */
	struct UAutoGuide_InfoGageGroupPrefab_GetTotalValue_Params
	{
	public:
		float                                                      ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoGageGroupPrefab.GetOpenContentCount
	 */
	struct UAutoGuide_InfoGageGroupPrefab_GetOpenContentCount_Params
	{
	public:
		int32_t                                                    ReturnValue;                                             // 0x0000(0x0004)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoGageParticlePrefab.SetGrowRateType
	 */
	struct UAutoGuide_InfoGageParticlePrefab_SetGrowRateType_Params
	{
	public:
		E_GROWTH_TYPE                                              InType;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       maxlevel;                                                // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoGageParticlePrefab.OnMove
	 */
	struct UAutoGuide_InfoGageParticlePrefab_OnMove_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoGageParticlePrefab.OnChangeValue
	 */
	struct UAutoGuide_InfoGageParticlePrefab_OnChangeValue_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoGageParticlePrefab.InitGageValue
	 */
	struct UAutoGuide_InfoGageParticlePrefab_InitGageValue_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoGageParticlePrefab.GetGrowrateTable
	 */
	struct UAutoGuide_InfoGageParticlePrefab_GetGrowrateTable_Params
	{
	public:
		E_GROWTH_TYPE                                              InType;                                                  // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		struct FGrowthRate_Guide_TableEntity                       Out_FGrowthRate_Guide_TableEntity;                       // 0x0008(0x0020)  (Parm, OutParm, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0028(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoGageParticlePrefab.CheckContentOpen
	 */
	struct UAutoGuide_InfoGageParticlePrefab_CheckContentOpen_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.SetVisibleSocialPanel
	 */
	struct UAutoGuide_InfoPage_SetVisibleSocialPanel_Params
	{
	public:
		bool                                                       IsVisible;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.SetUserCharInfo
	 */
	struct UAutoGuide_InfoPage_SetUserCharInfo_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.SetNotiScrollItem
	 */
	struct UAutoGuide_InfoPage_SetNotiScrollItem_Params
	{
	public:
		int32_t                                                    ItemIndex;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UWidget*                                             ListItemWidget;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.SetNotiBoard
	 */
	struct UAutoGuide_InfoPage_SetNotiBoard_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.SetInvenBoard
	 */
	struct UAutoGuide_InfoPage_SetInvenBoard_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.SetGrowthScrollItem
	 */
	struct UAutoGuide_InfoPage_SetGrowthScrollItem_Params
	{
	public:
		int32_t                                                    ItemIndex;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UWidget*                                             ListItemWidget;                                          // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.SetGrowthGraph
	 */
	struct UAutoGuide_InfoPage_SetGrowthGraph_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.SetGrowthBoard
	 */
	struct UAutoGuide_InfoPage_SetGrowthBoard_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.SetCharStatus
	 */
	struct UAutoGuide_InfoPage_SetCharStatus_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.PreloadCanvas
	 */
	struct UAutoGuide_InfoPage_PreloadCanvas_Params
	{
	public:
		class FString                                              Path;                                                    // 0x0000(0x0010)  (Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       ReturnValue;                                             // 0x0010(0x0001)  (Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.OnSetGuideInvenItem
	 */
	struct UAutoGuide_InfoPage_OnSetGuideInvenItem_Params
	{
	public:
		int32_t                                                    ItemIndex;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UListItemPrefab*                                     ItemWidget;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.OnSelectGuideItem
	 */
	struct UAutoGuide_InfoPage_OnSelectGuideItem_Params
	{
	public:
		int32_t                                                    ItemIndex;                                               // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		class UListItemPrefab*                                     ItemWidget;                                              // 0x0008(0x0008)  (Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.OnClickStatusDetail
	 */
	struct UAutoGuide_InfoPage_OnClickStatusDetail_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.OnClickShowSocialActions
	 */
	struct UAutoGuide_InfoPage_OnClickShowSocialActions_Params
	{
	public:
		bool                                                       inVisible;                                               // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.OnClickPlaySocialAction
	 */
	struct UAutoGuide_InfoPage_OnClickPlaySocialAction_Params
	{
	public:
		int32_t                                                    Idx;                                                     // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.OnClickNotiTab
	 */
	struct UAutoGuide_InfoPage_OnClickNotiTab_Params
	{
	public:
		int32_t                                                    tabIdx;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.OnClickInvenTab
	 */
	struct UAutoGuide_InfoPage_OnClickInvenTab_Params
	{
	public:
		E_InventoryTapType                                         inTab;                                                   // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.OnClickInfoMainTab
	 */
	struct UAutoGuide_InfoPage_OnClickInfoMainTab_Params
	{
	public:
		int32_t                                                    tabIdx;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_InfoPage.InitSocialActionSlots
	 */
	struct UAutoGuide_InfoPage_InitSocialActionSlots_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.InitGuideInfoPage
	 */
	struct UAutoGuide_InfoPage_InitGuideInfoPage_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.DrawTriangleWithCenter
	 */
	struct UAutoGuide_InfoPage_DrawTriangleWithCenter_Params
	{	};

	/**
	 * Function MirM.AutoGuide_InfoPage.ClearRenderTarget
	 */
	struct UAutoGuide_InfoPage_ClearRenderTarget_Params
	{
	public:
		struct FLinearColor                                        BaseColor;                                               // 0x0000(0x0010)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_ItemAcquireListPref.SetSubTitle
	 */
	struct UAutoGuide_ItemAcquireListPref_SetSubTitle_Params
	{
	public:
		int32_t                                                    strId;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_ItemAcquireListPref.SetRecommend
	 */
	struct UAutoGuide_ItemAcquireListPref_SetRecommend_Params
	{
	public:
		bool                                                       bOn;                                                     // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_ItemAcquireListPref.SetMainTitle
	 */
	struct UAutoGuide_ItemAcquireListPref_SetMainTitle_Params
	{
	public:
		int32_t                                                    strId;                                                   // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_ItemAcquireListPref.SetAcquireData
	 */
	struct UAutoGuide_ItemAcquireListPref_SetAcquireData_Params
	{
	public:
		E_ITEM_LOCATION_TYPE                                       LocationType;                                            // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    locationValue;                                           // 0x0004(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    locationValue2;                                          // 0x0008(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    MainTitleId;                                             // 0x000C(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		int32_t                                                    SubTitleID;                                              // 0x0010(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_ItemAcquirePage.SetDisableSubButtonList
	 */
	struct UAutoGuide_ItemAcquirePage_SetDisableSubButtonList_Params
	{
	public:
		bool                                                       IsDisableExchangeBtn;                                    // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsDisableCollectBtn;                                     // 0x0001(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsDisableGetPathBtn;                                     // 0x0002(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
		bool                                                       IsDisableUsePathBtn;                                     // 0x0003(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_ItemAcquirePage.SetCompare
	 */
	struct UAutoGuide_ItemAcquirePage_SetCompare_Params
	{
	public:
		bool                                                       isActiveCompare;                                         // 0x0000(0x0001)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_ItemAcquirePage.OnClickEnableInfo
	 */
	struct UAutoGuide_ItemAcquirePage_OnClickEnableInfo_Params
	{
	public:
		int32_t                                                    ItemId;                                                  // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_ItemAcquirePage.OnClickAcquirInfo
	 */
	struct UAutoGuide_ItemAcquirePage_OnClickAcquirInfo_Params
	{
	public:
		int32_t                                                    ItemIdx;                                                 // 0x0000(0x0004)  (Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function MirM.AutoGuide_ItemAcquirePage.InitIuid
	 */
	struct UAutoGuide_ItemAcquirePage_InitIuid_Params
	{
	public:
