#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Classes
	// --------------------------------------------------
	/**
	 * Class ProtocolPlugins.BasePacket
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UBasePacket : public UObject
	{
	public:
		unsigned char                                              UnknownData_HMNR[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.WebBasePacket
	 * Size -> 0x0008 (FullSize[0x0030] - InheritedSize[0x0028])
	 */
	class UWebBasePacket : public UObject
	{
	public:
		unsigned char                                              UnknownData_8064[0x8];                                   // 0x0028(0x0008) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_account_storage_buy_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_account_storage_buy_cs : public UBasePacket
	{
	public:
		int64_t                                                    npc_uid;                                                 // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_account_storage_buy_sc
	 * Size -> 0x0040 (FullSize[0x0070] - InheritedSize[0x0030])
	 */
	class Ump_account_storage_buy_sc : public UBasePacket
	{
	public:
		bool                                                       flag_goods_info;                                         // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9LGB[0xF];                                   // 0x0031(0x000F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_account_storage_item;                               // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_NTKS[0x1F];                                  // 0x0041(0x001F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_account_storage_info;                               // 0x0060(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QQLV[0xF];                                   // 0x0061(0x000F) MISSED OFFSET (PADDING)

	public:
		bool has_goods_info();
		bool has_account_storage_item();
		bool has_account_storage_info();
		struct Fmps_update_goods get_goods_info();
		struct Fmps_inventory get_account_storage_item();
		struct Fmps_account_storage get_account_storage_info();
		struct Fmps_update_goods alloc_goods_info();
		struct Fmps_inventory alloc_account_storage_item();
		struct Fmps_account_storage alloc_account_storage_info();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_achieve_add_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_achieve_add_cs : public UBasePacket
	{
	public:
		int32_t                                                    gid;                                                     // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Value;                                                   // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_achieve_add_sc
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class Ump_achieve_add_sc : public UBasePacket
	{
	public:
		bool                                                       flag_achieve_info;                                       // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_V90L[0xF];                                   // 0x0031(0x000F) MISSED OFFSET (PADDING)

	public:
		bool has_achieve_info();
		struct Fmps_achieve_info get_achieve_info();
		struct Fmps_achieve_info alloc_achieve_info();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_achieve_get_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_achieve_get_cs : public UBasePacket
	{
	public:
		int32_t                                                    achieve_type;                                            // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_8AKR[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_achieve_get_sc
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class Ump_achieve_get_sc : public UBasePacket
	{
	public:
		int32_t                                                    achieve_type;                                            // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ORCH[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct Fmps_achieve_info>                           list;                                                    // 0x0038(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_achieve_reward_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_achieve_reward_cs : public UBasePacket
	{
	public:
		int32_t                                                    gid;                                                     // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Index;                                                   // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_achieve_reward_sc
	 * Size -> 0x0070 (FullSize[0x00A0] - InheritedSize[0x0030])
	 */
	class Ump_achieve_reward_sc : public UBasePacket
	{
	public:
		bool                                                       flag_item_add;                                           // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_G03M[0x4F];                                  // 0x0031(0x004F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_title_info;                                         // 0x0080(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B8XD[0xB];                                   // 0x0081(0x000B) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_achieve_info;                                       // 0x008C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_RGX9[0x13];                                  // 0x008D(0x0013) MISSED OFFSET (PADDING)

	public:
		bool has_title_info();
		bool has_item_add();
		bool has_achieve_info();
		struct Fmps_title_info get_title_info();
		struct Fmps_item_add get_item_add();
		struct Fmps_achieve_info get_achieve_info();
		struct Fmps_title_info alloc_title_info();
		struct Fmps_item_add alloc_item_add();
		struct Fmps_achieve_info alloc_achieve_info();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_acupoints_levelup_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_acupoints_levelup_cs : public UBasePacket
	{
	public:
		int32_t                                                    meridians_id;                                            // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    acupoints_index;                                         // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_acupoints_levelup_sc
	 * Size -> 0x0078 (FullSize[0x00A8] - InheritedSize[0x0030])
	 */
	class Ump_acupoints_levelup_sc : public UBasePacket
	{
	public:
		bool                                                       flag_meridians;                                          // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Y41I[0x1F];                                  // 0x0031(0x001F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_info;                                               // 0x0050(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_C3UL[0x4F];                                  // 0x0051(0x004F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag;                                                    // 0x00A0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_Y1CU[0x7];                                   // 0x00A1(0x0007) MISSED OFFSET (PADDING)

	public:
		bool has_meridians();
		bool has_info();
		struct Fmps_meridians get_meridians();
		struct Fmps_item_add get_info();
		struct Fmps_meridians alloc_meridians();
		struct Fmps_item_add alloc_info();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_ai_game_login_cs
	 * Size -> 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
	 */
	class Ump_ai_game_login_cs : public UBasePacket
	{
	public:
		int64_t                                                    auid;                                                    // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    indun_uid;                                               // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              access_token;                                            // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              Version;                                                 // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       is_siege_bot;                                            // 0x0060(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       is_test_bot;                                             // 0x0061(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7P7A[0x2];                                   // 0x0062(0x0002) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    ai_service_index;                                        // 0x0064(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       flag_start_position;                                     // 0x0068(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3SD8[0x17];                                  // 0x0069(0x0017) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int64_t                                                    start_channel_uid;                                       // 0x0080(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		bool has_start_position();
		struct Fmps_zone_info get_start_position();
		struct Fmps_zone_info alloc_start_position();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_ai_game_login_sc
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_ai_game_login_sc : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_ai_service_start_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_ai_service_start_cs : public UBasePacket
	{
	public:
		int32_t                                                    object_map_id;                                           // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AG1F[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_ai_service_start_sc
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_ai_service_start_sc : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_ai_setup_config_cs
	 * Size -> 0x0030 (FullSize[0x0060] - InheritedSize[0x0030])
	 */
	class Ump_ai_setup_config_cs : public UBasePacket
	{
	public:
		bool                                                       flag_config_data;                                        // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_3IQZ[0x2F];                                  // 0x0031(0x002F) MISSED OFFSET (PADDING)

	public:
		bool has_config_data();
		struct Fmps_ai_setup_config get_config_data();
		struct Fmps_ai_setup_config alloc_config_data();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_ai_setup_config_sc
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_ai_setup_config_sc : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_ai_setup_config_info_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_ai_setup_config_info_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_ai_setup_config_info_sc
	 * Size -> 0x0030 (FullSize[0x0060] - InheritedSize[0x0030])
	 */
	class Ump_ai_setup_config_info_sc : public UBasePacket
	{
	public:
		bool                                                       flag_config_data;                                        // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_QSAW[0x2F];                                  // 0x0031(0x002F) MISSED OFFSET (PADDING)

	public:
		bool has_config_data();
		struct Fmps_ai_setup_config get_config_data();
		struct Fmps_ai_setup_config alloc_config_data();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_alert_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_alert_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_alert_sc
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_alert_sc : public UBasePacket
	{
	public:
		Empe_arena_battle_alert                                    alert_cmd;                                               // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              win_team;                                                // 0x0031(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_EC2L[0x6];                                   // 0x0032(0x0006) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int64_t>                                            list_mvp;                                                // 0x0038(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_match_regist_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_match_regist_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_match_regist_sc
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_match_regist_sc : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_match_regist_cancel_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_match_regist_cancel_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_match_regist_cancel_sc
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_match_regist_cancel_sc : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_matching_count_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_matching_count_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_matching_count_sc
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_matching_count_sc : public UBasePacket
	{
	public:
		int32_t                                                    remain_count;                                            // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_W2ZL[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_revive_count_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_revive_count_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_revive_count_sc
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_revive_count_sc : public UBasePacket
	{
	public:
		int32_t                                                    revive_count;                                            // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6SI4[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_score_board_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_score_board_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_score_board_sc
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_score_board_sc : public UBasePacket
	{
	public:
		TArray<struct Fmps_arena_character>                        character_score;                                         // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    a_team_count;                                            // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    b_team_count;                                            // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_season_reward_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_season_reward_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_battle_season_reward_sc
	 * Size -> 0x0050 (FullSize[0x0080] - InheritedSize[0x0030])
	 */
	class Ump_arena_battle_season_reward_sc : public UBasePacket
	{
	public:
		bool                                                       flag_season_reward_info;                                 // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DSA7[0x4F];                                  // 0x0031(0x004F) MISSED OFFSET (PADDING)

	public:
		bool has_season_reward_info();
		struct Fmps_item_add get_season_reward_info();
		struct Fmps_item_add alloc_season_reward_info();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_join_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_arena_join_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_arena_join_sc
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_arena_join_sc : public UBasePacket
	{
	public:
		unsigned char                                              join_count;                                              // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_IOYR[0x7];                                   // 0x0031(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_attack_speed_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_attack_speed_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_attack_speed_sc
	 * Size -> 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
	 */
	class Ump_attack_speed_sc : public UBasePacket
	{
	public:
		int64_t                                                    uid;                                                     // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    skill_id;                                                // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_YH3C[0x4];                                   // 0x003C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int64_t                                                    skill_uid;                                               // 0x0040(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		float                                                      atk_speed;                                               // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_LKZY[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_auth_check_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_auth_check_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_auth_check_sc
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_auth_check_sc : public UBasePacket
	{
	public:
		int32_t                                                    Number;                                                  // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Seed;                                                    // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_avatar_cool_time_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_avatar_cool_time_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_avatar_cool_time_sc
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_avatar_cool_time_sc : public UBasePacket
	{
	public:
		int64_t                                                    cool_time;                                               // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_avatar_mix_cs
	 * Size -> 0x0018 (FullSize[0x0048] - InheritedSize[0x0030])
	 */
	class Ump_avatar_mix_cs : public UBasePacket
	{
	public:
		TArray<int32_t>                                            material_avatar_id;                                      // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    grade;                                                   // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    count;                                                   // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_avatar_mix_sc
	 * Size -> 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
	 */
	class Ump_avatar_mix_sc : public UBasePacket
	{
	public:
		TArray<struct Fmps_obtain_avatar>                          reward_avatar;                                           // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct Fmps_avatar>                                 use_avatar;                                              // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_avatar_slot_set_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_avatar_slot_set_cs : public UBasePacket
	{
	public:
		int32_t                                                    avatar_id;                                               // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		Empe_avatar_pos                                            Pos;                                                     // 0x0034(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DWS6[0x3];                                   // 0x0035(0x0003) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_avatar_slot_set_sc
	 * Size -> 0x0050 (FullSize[0x0080] - InheritedSize[0x0030])
	 */
	class Ump_avatar_slot_set_sc : public UBasePacket
	{
	public:
		bool                                                       flag_equip_avatar;                                       // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_E5WF[0x27];                                  // 0x0031(0x0027) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_release_avatar;                                     // 0x0058(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7E4N[0x27];                                  // 0x0059(0x0027) MISSED OFFSET (PADDING)

	public:
		bool has_release_avatar();
		bool has_equip_avatar();
		struct Fmps_avatar get_release_avatar();
		struct Fmps_avatar get_equip_avatar();
		struct Fmps_avatar alloc_release_avatar();
		struct Fmps_avatar alloc_equip_avatar();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_blackiron_sell_info_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_blackiron_sell_info_cs : public UBasePacket
	{
	public:
		int64_t                                                    nuid;                                                    // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_blackiron_sell_info_sc
	 * Size -> 0x0040 (FullSize[0x0070] - InheritedSize[0x0030])
	 */
	class Ump_blackiron_sell_info_sc : public UBasePacket
	{
	public:
		TArray<struct Fmps_item_id>                                sell_list;                                               // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    sell_end_time;                                           // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    sell_regist_key;                                         // 0x0044(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    sell_total_count;                                        // 0x0048(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_HFOD[0x4];                                   // 0x004C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              guild_name;                                              // 0x0050(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		TArray<unsigned char>                                      guild_mark;                                              // 0x0060(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_blackiron_sell_regist_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_blackiron_sell_regist_cs : public UBasePacket
	{
	public:
		int32_t                                                    blackiron_sell_count;                                    // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    blackiron_sell_price;                                    // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_blackiron_sell_regist_sc
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_blackiron_sell_regist_sc : public UBasePacket
	{
	public:
		int32_t                                                    guild_blackiron_count;                                   // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_9OZR[0x4];                                   // 0x0034(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_buy_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_buy_cs : public UBasePacket
	{
	public:
		int32_t                                                    cash_shop_table_id;                                      // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              buy_count;                                               // 0x0034(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_BJYJ[0x3];                                   // 0x0035(0x0003) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_buy_sc
	 * Size -> 0x0148 (FullSize[0x0178] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_buy_sc : public UBasePacket
	{
	public:
		bool                                                       flag_buy_item;                                           // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7TL1[0x4F];                                  // 0x0031(0x004F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct Fmps_cart_item>                              cart_item_list;                                          // 0x0080(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       flag_buy_count;                                          // 0x0090(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_7U5B[0x13];                                  // 0x0091(0x0013) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_cash_info;                                          // 0x00A4(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6WP3[0x13];                                  // 0x00A5(0x0013) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct Fmps_obtain_pet_info>                        pet_info_list;                                           // 0x00B8(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct Fmps_temp_pet>                               list_temp_pet;                                           // 0x00C8(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       flag_package_product;                                    // 0x00D8(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_H7HU[0x17];                                  // 0x00D9(0x0017) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_seasonpass;                                         // 0x00F0(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4V1D[0x4F];                                  // 0x00F1(0x004F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct Fmps_obtain_avatar>                          avatar_info_list;                                        // 0x0140(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct Fmps_obtain_reflection>                      reflection_info_list;                                    // 0x0150(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct Fmps_temp_reflection>                        temp_reflection_list;                                    // 0x0160(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    inven_size;                                              // 0x0170(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_5C0P[0x4];                                   // 0x0174(0x0004) MISSED OFFSET (PADDING)

	public:
		bool has_seasonpass();
		bool has_package_product();
		bool has_cash_info();
		bool has_buy_item();
		bool has_buy_count();
		struct Fmps_seasonpass get_seasonpass();
		struct Fmps_cash_package_product get_package_product();
		struct Fmps_cash_info get_cash_info();
		struct Fmps_item_add get_buy_item();
		struct Fmps_cash_shop_buy_count get_buy_count();
		struct Fmps_seasonpass alloc_seasonpass();
		struct Fmps_cash_package_product alloc_package_product();
		struct Fmps_cash_info alloc_cash_info();
		struct Fmps_item_add alloc_buy_item();
		struct Fmps_cash_shop_buy_count alloc_buy_count();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_cart_get_cs
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_cart_get_cs : public UBasePacket
	{
	public:
		int64_t                                                    uid;                                                     // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       is_all;                                                  // 0x0038(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GL4K[0x7];                                   // 0x0039(0x0007) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_cart_get_sc
	 * Size -> 0x0080 (FullSize[0x00B0] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_cart_get_sc : public UBasePacket
	{
	public:
		bool                                                       flag_get_item;                                           // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_B0G5[0x4F];                                  // 0x0031(0x004F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<int64_t>                                            get_cart_item_list;                                      // 0x0080(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    cash;                                                    // 0x0090(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_P00N[0x4];                                   // 0x0094(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       isFull;                                                  // 0x0098(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_2CRS[0x7];                                   // 0x0099(0x0007) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct Fmps_cash_shop_buy_count>                    list_buy_count;                                          // 0x00A0(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		bool has_get_item();
		struct Fmps_item_add get_get_item();
		struct Fmps_item_add alloc_get_item();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_daily_get_cs
	 * Size -> 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_daily_get_cs : public UBasePacket
	{
	public:
		int32_t                                                    TID;                                                     // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Index;                                                   // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    sub_index;                                               // 0x0038(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		bool                                                       flag_cash_info;                                          // 0x003C(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_GGZX[0x13];                                  // 0x003D(0x0013) MISSED OFFSET (PADDING)

	public:
		bool has_cash_info();
		struct Fmps_cash_info get_cash_info();
		struct Fmps_cash_info alloc_cash_info();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_daily_get_sc
	 * Size -> 0x0080 (FullSize[0x00B0] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_daily_get_sc : public UBasePacket
	{
	public:
		bool                                                       flag_info_item;                                          // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_A9S1[0x4F];                                  // 0x0031(0x004F) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_info_product;                                       // 0x0080(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_6MMA[0x17];                                  // 0x0081(0x0017) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		bool                                                       flag_cash_info;                                          // 0x0098(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0MZ7[0x17];                                  // 0x0099(0x0017) MISSED OFFSET (PADDING)

	public:
		bool has_info_product();
		bool has_info_item();
		bool has_cash_info();
		struct Fmps_cash_package_product get_info_product();
		struct Fmps_item_add get_info_item();
		struct Fmps_cash_info get_cash_info();
		struct Fmps_cash_package_product alloc_info_product();
		struct Fmps_item_add alloc_info_item();
		struct Fmps_cash_info alloc_cash_info();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_exchange_reset_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_exchange_reset_cs : public UBasePacket
	{
	public:
		int32_t                                                    sell_category_id;                                        // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		Empe_cash_exchange_type                                    reset_type;                                              // 0x0034(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_SC46[0x3];                                   // 0x0035(0x0003) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_exchange_reset_sc
	 * Size -> 0x0068 (FullSize[0x0098] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_exchange_reset_sc : public UBasePacket
	{
	public:
		TArray<struct Fmps_cash_exchange_product>                  product;                                                 // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       flag_item_add;                                           // 0x0040(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_4PSC[0x57];                                  // 0x0041(0x0057) MISSED OFFSET (PADDING)

	public:
		bool has_item_add();
		struct Fmps_item_add get_item_add();
		struct Fmps_item_add alloc_item_add();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_info_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_info_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_info_sc
	 * Size -> 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_info_sc : public UBasePacket
	{
	public:
		TArray<struct Fmps_cash_shop_buy_count>                    buy_count_list;                                          // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct Fmps_cart_item>                              cart_item_list;                                          // 0x0040(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		bool                                                       flag_cash_info;                                          // 0x0050(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_1A4O[0x17];                                  // 0x0051(0x0017) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<struct Fmps_cash_exchange_product>                  exchange_product;                                        // 0x0068(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		TArray<struct Fmps_cash_package_product>                   package_product;                                         // 0x0078(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		bool has_cash_info();
		struct Fmps_cash_info get_cash_info();
		struct Fmps_cash_info alloc_cash_info();
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_limited_product_cs
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_limited_product_cs : public UBasePacket
	{
	public:
		int32_t                                                    limited_type;                                            // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    Value;                                                   // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_cash_shop_limited_product_sc
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class Ump_cash_shop_limited_product_sc : public UBasePacket
	{
	public:
		TArray<struct Fmps_cash_limited_product>                   Info;                                                    // 0x0030(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_castle_dungeon_entrance_fee_change_cs
	 * Size -> 0x0020 (FullSize[0x0050] - InheritedSize[0x0030])
	 */
	class Ump_castle_dungeon_entrance_fee_change_cs : public UBasePacket
	{
	public:
		int64_t                                                    cuid;                                                    // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    nuid;                                                    // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    Guid;                                                    // 0x0040(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		Empe_siege_castle_type                                     castle_type;                                             // 0x0048(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_0XE8[0x3];                                   // 0x0049(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    entrance_fee;                                            // 0x004C(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_castle_dungeon_entrance_fee_change_sc
	 * Size -> 0x0008 (FullSize[0x0038] - InheritedSize[0x0030])
	 */
	class Ump_castle_dungeon_entrance_fee_change_sc : public UBasePacket
	{
	public:
		Empe_siege_castle_type                                     castle_type;                                             // 0x0030(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_OKHR[0x3];                                   // 0x0031(0x0003) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		int32_t                                                    entrance_fee;                                            // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_castle_owner_info_cs
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
	class Ump_castle_owner_info_cs : public UBasePacket
	{
	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_castle_owner_info_sc
	 * Size -> 0x0058 (FullSize[0x0088] - InheritedSize[0x0030])
	 */
	class Ump_castle_owner_info_sc : public UBasePacket
	{
	public:
		int32_t                                                    map_id;                                                  // 0x0030(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    castle_id;                                               // 0x0034(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int64_t                                                    owner_guid;                                              // 0x0038(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    tax_rate;                                                // 0x0040(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_X23G[0x4];                                   // 0x0044(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		class FString                                              guild_name;                                              // 0x0048(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		class FString                                              master_name;                                             // 0x0058(0x0010) Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		int32_t                                                    def_count;                                               // 0x0068(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_ETNG[0x4];                                   // 0x006C(0x0004) MISSED OFFSET (FIX SPACE BETWEEN PREVIOUS PROPERTY)
		TArray<unsigned char>                                      guild_mark;                                              // 0x0070(0x0010) Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic
		int32_t                                                    master_class;                                            // 0x0080(0x0004) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_AVY0[0x4];                                   // 0x0084(0x0004) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_castle_set_tax_distribution_cs
	 * Size -> 0x0010 (FullSize[0x0040] - InheritedSize[0x0030])
	 */
	class Ump_castle_set_tax_distribution_cs : public UBasePacket
	{
	public:
		int64_t                                                    nuid;                                                    // 0x0030(0x0008) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		Empe_siege_castle_type                                     castle_type;                                             // 0x0038(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		Empe_castle_tax_distribution                               tax_distribution;                                        // 0x0039(0x0001) Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic
		unsigned char                                              UnknownData_DKM3[0x6];                                   // 0x003A(0x0006) MISSED OFFSET (PADDING)

	public:
		static UClass* StaticClass();
	};

	/**
	 * Class ProtocolPlugins.mp_castle_set_tax_distribution_sc
	 * Size -> 0x0000 (FullSize[0x0030] - InheritedSize[0x0030])
	 */
