#pragma once

/**
 * Name: MIRM
 * Version: 0623
 */

#ifdef _MSC_VER
	#pragma pack(push, 0x01)
#endif

namespace CG
{
	// --------------------------------------------------
	// # Structs
	// --------------------------------------------------
	/**
	 * Function ProtocolPlugins.mp_account_storage_buy_sc.has_goods_info
	 */
	struct Ump_account_storage_buy_sc_has_goods_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_account_storage_buy_sc.has_account_storage_item
	 */
	struct Ump_account_storage_buy_sc_has_account_storage_item_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_account_storage_buy_sc.has_account_storage_info
	 */
	struct Ump_account_storage_buy_sc_has_account_storage_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_account_storage_buy_sc.get_goods_info
	 */
	struct Ump_account_storage_buy_sc_get_goods_info_Params
	{
	public:
		struct Fmps_update_goods                                   ReturnValue;                                             // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_account_storage_buy_sc.get_account_storage_item
	 */
	struct Ump_account_storage_buy_sc_get_account_storage_item_Params
	{
	public:
		struct Fmps_inventory                                      ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_account_storage_buy_sc.get_account_storage_info
	 */
	struct Ump_account_storage_buy_sc_get_account_storage_info_Params
	{
	public:
		struct Fmps_account_storage                                ReturnValue;                                             // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_account_storage_buy_sc.alloc_goods_info
	 */
	struct Ump_account_storage_buy_sc_alloc_goods_info_Params
	{
	public:
		struct Fmps_update_goods                                   ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_account_storage_buy_sc.alloc_account_storage_item
	 */
	struct Ump_account_storage_buy_sc_alloc_account_storage_item_Params
	{
	public:
		struct Fmps_inventory                                      ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_account_storage_buy_sc.alloc_account_storage_info
	 */
	struct Ump_account_storage_buy_sc_alloc_account_storage_info_Params
	{
	public:
		struct Fmps_account_storage                                ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_add_sc.has_achieve_info
	 */
	struct Ump_achieve_add_sc_has_achieve_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_add_sc.get_achieve_info
	 */
	struct Ump_achieve_add_sc_get_achieve_info_Params
	{
	public:
		struct Fmps_achieve_info                                   ReturnValue;                                             // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_add_sc.alloc_achieve_info
	 */
	struct Ump_achieve_add_sc_alloc_achieve_info_Params
	{
	public:
		struct Fmps_achieve_info                                   ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_reward_sc.has_title_info
	 */
	struct Ump_achieve_reward_sc_has_title_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_reward_sc.has_item_add
	 */
	struct Ump_achieve_reward_sc_has_item_add_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_reward_sc.has_achieve_info
	 */
	struct Ump_achieve_reward_sc_has_achieve_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_reward_sc.get_title_info
	 */
	struct Ump_achieve_reward_sc_get_title_info_Params
	{
	public:
		struct Fmps_title_info                                     ReturnValue;                                             // 0x0000(0x0008)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_reward_sc.get_item_add
	 */
	struct Ump_achieve_reward_sc_get_item_add_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_reward_sc.get_achieve_info
	 */
	struct Ump_achieve_reward_sc_get_achieve_info_Params
	{
	public:
		struct Fmps_achieve_info                                   ReturnValue;                                             // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_reward_sc.alloc_title_info
	 */
	struct Ump_achieve_reward_sc_alloc_title_info_Params
	{
	public:
		struct Fmps_title_info                                     ReturnValue;                                             // 0x0000(0x0008)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_reward_sc.alloc_item_add
	 */
	struct Ump_achieve_reward_sc_alloc_item_add_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_achieve_reward_sc.alloc_achieve_info
	 */
	struct Ump_achieve_reward_sc_alloc_achieve_info_Params
	{
	public:
		struct Fmps_achieve_info                                   ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_acupoints_levelup_sc.has_meridians
	 */
	struct Ump_acupoints_levelup_sc_has_meridians_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_acupoints_levelup_sc.has_info
	 */
	struct Ump_acupoints_levelup_sc_has_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_acupoints_levelup_sc.get_meridians
	 */
	struct Ump_acupoints_levelup_sc_get_meridians_Params
	{
	public:
		struct Fmps_meridians                                      ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_acupoints_levelup_sc.get_info
	 */
	struct Ump_acupoints_levelup_sc_get_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_acupoints_levelup_sc.alloc_meridians
	 */
	struct Ump_acupoints_levelup_sc_alloc_meridians_Params
	{
	public:
		struct Fmps_meridians                                      ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_acupoints_levelup_sc.alloc_info
	 */
	struct Ump_acupoints_levelup_sc_alloc_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_ai_game_login_cs.has_start_position
	 */
	struct Ump_ai_game_login_cs_has_start_position_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_ai_game_login_cs.get_start_position
	 */
	struct Ump_ai_game_login_cs_get_start_position_Params
	{
	public:
		struct Fmps_zone_info                                      ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_ai_game_login_cs.alloc_start_position
	 */
	struct Ump_ai_game_login_cs_alloc_start_position_Params
	{
	public:
		struct Fmps_zone_info                                      ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_ai_setup_config_cs.has_config_data
	 */
	struct Ump_ai_setup_config_cs_has_config_data_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_ai_setup_config_cs.get_config_data
	 */
	struct Ump_ai_setup_config_cs_get_config_data_Params
	{
	public:
		struct Fmps_ai_setup_config                                ReturnValue;                                             // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_ai_setup_config_cs.alloc_config_data
	 */
	struct Ump_ai_setup_config_cs_alloc_config_data_Params
	{
	public:
		struct Fmps_ai_setup_config                                ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_ai_setup_config_info_sc.has_config_data
	 */
	struct Ump_ai_setup_config_info_sc_has_config_data_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_ai_setup_config_info_sc.get_config_data
	 */
	struct Ump_ai_setup_config_info_sc_get_config_data_Params
	{
	public:
		struct Fmps_ai_setup_config                                ReturnValue;                                             // 0x0000(0x0028)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_ai_setup_config_info_sc.alloc_config_data
	 */
	struct Ump_ai_setup_config_info_sc_alloc_config_data_Params
	{
	public:
		struct Fmps_ai_setup_config                                ReturnValue;                                             // 0x0000(0x0028)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_arena_battle_season_reward_sc.has_season_reward_info
	 */
	struct Ump_arena_battle_season_reward_sc_has_season_reward_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_arena_battle_season_reward_sc.get_season_reward_info
	 */
	struct Ump_arena_battle_season_reward_sc_get_season_reward_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_arena_battle_season_reward_sc.alloc_season_reward_info
	 */
	struct Ump_arena_battle_season_reward_sc_alloc_season_reward_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_avatar_slot_set_sc.has_release_avatar
	 */
	struct Ump_avatar_slot_set_sc_has_release_avatar_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_avatar_slot_set_sc.has_equip_avatar
	 */
	struct Ump_avatar_slot_set_sc_has_equip_avatar_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_avatar_slot_set_sc.get_release_avatar
	 */
	struct Ump_avatar_slot_set_sc_get_release_avatar_Params
	{
	public:
		struct Fmps_avatar                                         ReturnValue;                                             // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_avatar_slot_set_sc.get_equip_avatar
	 */
	struct Ump_avatar_slot_set_sc_get_equip_avatar_Params
	{
	public:
		struct Fmps_avatar                                         ReturnValue;                                             // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_avatar_slot_set_sc.alloc_release_avatar
	 */
	struct Ump_avatar_slot_set_sc_alloc_release_avatar_Params
	{
	public:
		struct Fmps_avatar                                         ReturnValue;                                             // 0x0000(0x0020)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_avatar_slot_set_sc.alloc_equip_avatar
	 */
	struct Ump_avatar_slot_set_sc_alloc_equip_avatar_Params
	{
	public:
		struct Fmps_avatar                                         ReturnValue;                                             // 0x0000(0x0020)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.has_seasonpass
	 */
	struct Ump_cash_shop_buy_sc_has_seasonpass_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.has_package_product
	 */
	struct Ump_cash_shop_buy_sc_has_package_product_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.has_cash_info
	 */
	struct Ump_cash_shop_buy_sc_has_cash_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.has_buy_item
	 */
	struct Ump_cash_shop_buy_sc_has_buy_item_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.has_buy_count
	 */
	struct Ump_cash_shop_buy_sc_has_buy_count_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.get_seasonpass
	 */
	struct Ump_cash_shop_buy_sc_get_seasonpass_Params
	{
	public:
		struct Fmps_seasonpass                                     ReturnValue;                                             // 0x0000(0x0040)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.get_package_product
	 */
	struct Ump_cash_shop_buy_sc_get_package_product_Params
	{
	public:
		struct Fmps_cash_package_product                           ReturnValue;                                             // 0x0000(0x0014)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.get_cash_info
	 */
	struct Ump_cash_shop_buy_sc_get_cash_info_Params
	{
	public:
		struct Fmps_cash_info                                      ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.get_buy_item
	 */
	struct Ump_cash_shop_buy_sc_get_buy_item_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.get_buy_count
	 */
	struct Ump_cash_shop_buy_sc_get_buy_count_Params
	{
	public:
		struct Fmps_cash_shop_buy_count                            ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.alloc_seasonpass
	 */
	struct Ump_cash_shop_buy_sc_alloc_seasonpass_Params
	{
	public:
		struct Fmps_seasonpass                                     ReturnValue;                                             // 0x0000(0x0040)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.alloc_package_product
	 */
	struct Ump_cash_shop_buy_sc_alloc_package_product_Params
	{
	public:
		struct Fmps_cash_package_product                           ReturnValue;                                             // 0x0000(0x0014)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.alloc_cash_info
	 */
	struct Ump_cash_shop_buy_sc_alloc_cash_info_Params
	{
	public:
		struct Fmps_cash_info                                      ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.alloc_buy_item
	 */
	struct Ump_cash_shop_buy_sc_alloc_buy_item_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_buy_sc.alloc_buy_count
	 */
	struct Ump_cash_shop_buy_sc_alloc_buy_count_Params
	{
	public:
		struct Fmps_cash_shop_buy_count                            ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_cart_get_sc.has_get_item
	 */
	struct Ump_cash_shop_cart_get_sc_has_get_item_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_cart_get_sc.get_get_item
	 */
	struct Ump_cash_shop_cart_get_sc_get_get_item_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_cart_get_sc.alloc_get_item
	 */
	struct Ump_cash_shop_cart_get_sc_alloc_get_item_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_cs.has_cash_info
	 */
	struct Ump_cash_shop_daily_get_cs_has_cash_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_cs.get_cash_info
	 */
	struct Ump_cash_shop_daily_get_cs_get_cash_info_Params
	{
	public:
		struct Fmps_cash_info                                      ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_cs.alloc_cash_info
	 */
	struct Ump_cash_shop_daily_get_cs_alloc_cash_info_Params
	{
	public:
		struct Fmps_cash_info                                      ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_sc.has_info_product
	 */
	struct Ump_cash_shop_daily_get_sc_has_info_product_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_sc.has_info_item
	 */
	struct Ump_cash_shop_daily_get_sc_has_info_item_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_sc.has_cash_info
	 */
	struct Ump_cash_shop_daily_get_sc_has_cash_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_sc.get_info_product
	 */
	struct Ump_cash_shop_daily_get_sc_get_info_product_Params
	{
	public:
		struct Fmps_cash_package_product                           ReturnValue;                                             // 0x0000(0x0014)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_sc.get_info_item
	 */
	struct Ump_cash_shop_daily_get_sc_get_info_item_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_sc.get_cash_info
	 */
	struct Ump_cash_shop_daily_get_sc_get_cash_info_Params
	{
	public:
		struct Fmps_cash_info                                      ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_sc.alloc_info_product
	 */
	struct Ump_cash_shop_daily_get_sc_alloc_info_product_Params
	{
	public:
		struct Fmps_cash_package_product                           ReturnValue;                                             // 0x0000(0x0014)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_sc.alloc_info_item
	 */
	struct Ump_cash_shop_daily_get_sc_alloc_info_item_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_daily_get_sc.alloc_cash_info
	 */
	struct Ump_cash_shop_daily_get_sc_alloc_cash_info_Params
	{
	public:
		struct Fmps_cash_info                                      ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_exchange_reset_sc.has_item_add
	 */
	struct Ump_cash_shop_exchange_reset_sc_has_item_add_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_exchange_reset_sc.get_item_add
	 */
	struct Ump_cash_shop_exchange_reset_sc_get_item_add_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_exchange_reset_sc.alloc_item_add
	 */
	struct Ump_cash_shop_exchange_reset_sc_alloc_item_add_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_info_sc.has_cash_info
	 */
	struct Ump_cash_shop_info_sc_has_cash_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_info_sc.get_cash_info
	 */
	struct Ump_cash_shop_info_sc_get_cash_info_Params
	{
	public:
		struct Fmps_cash_info                                      ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_cash_shop_info_sc.alloc_cash_info
	 */
	struct Ump_cash_shop_info_sc_alloc_cash_info_Params
	{
	public:
		struct Fmps_cash_info                                      ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_arsenal_build_donate_sc.has_use_item_info
	 */
	struct Ump_castle_town_arsenal_build_donate_sc_has_use_item_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_arsenal_build_donate_sc.get_use_item_info
	 */
	struct Ump_castle_town_arsenal_build_donate_sc_get_use_item_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_arsenal_build_donate_sc.alloc_use_item_info
	 */
	struct Ump_castle_town_arsenal_build_donate_sc_alloc_use_item_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_arsenal_build_work_info_sc.has_work_info
	 */
	struct Ump_castle_town_arsenal_build_work_info_sc_has_work_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_arsenal_build_work_info_sc.get_work_info
	 */
	struct Ump_castle_town_arsenal_build_work_info_sc_get_work_info_Params
	{
	public:
		struct Fmps_castle_town_arsenal_work                       ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_arsenal_build_work_info_sc.alloc_work_info
	 */
	struct Ump_castle_town_arsenal_build_work_info_sc_alloc_work_info_Params
	{
	public:
		struct Fmps_castle_town_arsenal_work                       ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_dinner_get_item_sc.has_item_info
	 */
	struct Ump_castle_town_dinner_get_item_sc_has_item_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_dinner_get_item_sc.get_item_info
	 */
	struct Ump_castle_town_dinner_get_item_sc_get_item_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_dinner_get_item_sc.alloc_item_info
	 */
	struct Ump_castle_town_dinner_get_item_sc_alloc_item_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_hud_info_sc.has_dinner_work
	 */
	struct Ump_castle_town_hud_info_sc_has_dinner_work_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_hud_info_sc.has_character_specialties_work
	 */
	struct Ump_castle_town_hud_info_sc_has_character_specialties_work_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_hud_info_sc.has_arsenal_work
	 */
	struct Ump_castle_town_hud_info_sc_has_arsenal_work_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_hud_info_sc.get_dinner_work
	 */
	struct Ump_castle_town_hud_info_sc_get_dinner_work_Params
	{
	public:
		struct Fmps_castle_town_dinner_work                        ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_hud_info_sc.get_character_specialties_work
	 */
	struct Ump_castle_town_hud_info_sc_get_character_specialties_work_Params
	{
	public:
		struct Fmps_castle_town_character_specialties_work         ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_hud_info_sc.get_arsenal_work
	 */
	struct Ump_castle_town_hud_info_sc_get_arsenal_work_Params
	{
	public:
		struct Fmps_castle_town_arsenal_work                       ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_hud_info_sc.alloc_dinner_work
	 */
	struct Ump_castle_town_hud_info_sc_alloc_dinner_work_Params
	{
	public:
		struct Fmps_castle_town_dinner_work                        ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_hud_info_sc.alloc_character_specialties_work
	 */
	struct Ump_castle_town_hud_info_sc_alloc_character_specialties_work_Params
	{
	public:
		struct Fmps_castle_town_character_specialties_work         ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_hud_info_sc.alloc_arsenal_work
	 */
	struct Ump_castle_town_hud_info_sc_alloc_arsenal_work_Params
	{
	public:
		struct Fmps_castle_town_arsenal_work                       ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_single_specialties_hud_sc.has_specialties_work
	 */
	struct Ump_castle_town_single_specialties_hud_sc_has_specialties_work_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_single_specialties_hud_sc.get_specialties_work
	 */
	struct Ump_castle_town_single_specialties_hud_sc_get_specialties_work_Params
	{
	public:
		struct Fmps_castle_town_specialties_work                   ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_single_specialties_hud_sc.alloc_specialties_work
	 */
	struct Ump_castle_town_single_specialties_hud_sc_alloc_specialties_work_Params
	{
	public:
		struct Fmps_castle_town_specialties_work                   ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_start_dinner_sc.has_dinner_work
	 */
	struct Ump_castle_town_start_dinner_sc_has_dinner_work_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_start_dinner_sc.get_dinner_work
	 */
	struct Ump_castle_town_start_dinner_sc_get_dinner_work_Params
	{
	public:
		struct Fmps_castle_town_dinner_work                        ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_start_dinner_sc.alloc_dinner_work
	 */
	struct Ump_castle_town_start_dinner_sc_alloc_dinner_work_Params
	{
	public:
		struct Fmps_castle_town_dinner_work                        ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_start_specialties_sc.has_use_item_info
	 */
	struct Ump_castle_town_start_specialties_sc_has_use_item_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_start_specialties_sc.has_town_specialties_work
	 */
	struct Ump_castle_town_start_specialties_sc_has_town_specialties_work_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_start_specialties_sc.get_use_item_info
	 */
	struct Ump_castle_town_start_specialties_sc_get_use_item_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_start_specialties_sc.get_town_specialties_work
	 */
	struct Ump_castle_town_start_specialties_sc_get_town_specialties_work_Params
	{
	public:
		struct Fmps_castle_town_character_specialties_work         ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_start_specialties_sc.alloc_use_item_info
	 */
	struct Ump_castle_town_start_specialties_sc_alloc_use_item_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_start_specialties_sc.alloc_town_specialties_work
	 */
	struct Ump_castle_town_start_specialties_sc_alloc_town_specialties_work_Params
	{
	public:
		struct Fmps_castle_town_character_specialties_work         ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_work_sc.has_use_item_info
	 */
	struct Ump_castle_town_work_sc_has_use_item_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_work_sc.get_use_item_info
	 */
	struct Ump_castle_town_work_sc_get_use_item_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_work_sc.alloc_use_item_info
	 */
	struct Ump_castle_town_work_sc_alloc_use_item_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_work_use_character_item_cs.has_work
	 */
	struct Ump_castle_town_work_use_character_item_cs_has_work_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_work_use_character_item_cs.get_work
	 */
	struct Ump_castle_town_work_use_character_item_cs_get_work_Params
	{
	public:
		struct Fmps_castle_town_work                               ReturnValue;                                             // 0x0000(0x0038)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_castle_town_work_use_character_item_cs.alloc_work
	 */
	struct Ump_castle_town_work_use_character_item_cs_alloc_work_Params
	{
	public:
		struct Fmps_castle_town_work                               ReturnValue;                                             // 0x0000(0x0038)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_condition_refill_sc.has_info
	 */
	struct Ump_condition_refill_sc_has_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_condition_refill_sc.get_info
	 */
	struct Ump_condition_refill_sc_get_info_Params
	{
	public:
		struct Fmps_update_goods_list                              ReturnValue;                                             // 0x0000(0x0010)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_condition_refill_sc.alloc_info
	 */
	struct Ump_condition_refill_sc_alloc_info_Params
	{
	public:
		struct Fmps_update_goods_list                              ReturnValue;                                             // 0x0000(0x0010)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_customizing_save_sc.has_update_goods
	 */
	struct Ump_customizing_save_sc_has_update_goods_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_customizing_save_sc.get_update_goods
	 */
	struct Ump_customizing_save_sc_get_update_goods_Params
	{
	public:
		struct Fmps_update_goods                                   ReturnValue;                                             // 0x0000(0x000C)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_customizing_save_sc.alloc_update_goods
	 */
	struct Ump_customizing_save_sc_alloc_update_goods_Params
	{
	public:
		struct Fmps_update_goods                                   ReturnValue;                                             // 0x0000(0x000C)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_decrement_item_durability_sc.has_durability_info
	 */
	struct Ump_decrement_item_durability_sc_has_durability_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_decrement_item_durability_sc.get_durability_info
	 */
	struct Ump_decrement_item_durability_sc_get_durability_info_Params
	{
	public:
		struct Fmps_decrement_item_durability                      ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_decrement_item_durability_sc.alloc_durability_info
	 */
	struct Ump_decrement_item_durability_sc_alloc_durability_info_Params
	{
	public:
		struct Fmps_decrement_item_durability                      ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_demon_summon_info_sc.has_info
	 */
	struct Ump_demon_summon_info_sc_has_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_demon_summon_info_sc.get_info
	 */
	struct Ump_demon_summon_info_sc_get_info_Params
	{
	public:
		struct Fmps_zone_object_info                               ReturnValue;                                             // 0x0000(0x0320)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_demon_summon_info_sc.alloc_info
	 */
	struct Ump_demon_summon_info_sc_alloc_info_Params
	{
	public:
		struct Fmps_zone_object_info                               ReturnValue;                                             // 0x0000(0x0320)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_add_sc.has_stat
	 */
	struct Ump_dictionary_add_sc_has_stat_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_add_sc.has_dic_info
	 */
	struct Ump_dictionary_add_sc_has_dic_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_add_sc.get_stat
	 */
	struct Ump_dictionary_add_sc_get_stat_Params
	{
	public:
		struct Fmps_dic_stat                                       ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_add_sc.get_dic_info
	 */
	struct Ump_dictionary_add_sc_get_dic_info_Params
	{
	public:
		struct Fmps_dictionary_info                                ReturnValue;                                             // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_add_sc.alloc_stat
	 */
	struct Ump_dictionary_add_sc_alloc_stat_Params
	{
	public:
		struct Fmps_dic_stat                                       ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_add_sc.alloc_dic_info
	 */
	struct Ump_dictionary_add_sc_alloc_dic_info_Params
	{
	public:
		struct Fmps_dictionary_info                                ReturnValue;                                             // 0x0000(0x0020)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_expire_sc.has_stat
	 */
	struct Ump_dictionary_expire_sc_has_stat_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_expire_sc.get_stat
	 */
	struct Ump_dictionary_expire_sc_get_stat_Params
	{
	public:
		struct Fmps_dic_stat                                       ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_expire_sc.alloc_stat
	 */
	struct Ump_dictionary_expire_sc_alloc_stat_Params
	{
	public:
		struct Fmps_dic_stat                                       ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_reward_get_sc.has_reward
	 */
	struct Ump_dictionary_reward_get_sc_has_reward_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_reward_get_sc.get_reward
	 */
	struct Ump_dictionary_reward_get_sc_get_reward_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_dictionary_reward_get_sc.alloc_reward
	 */
	struct Ump_dictionary_reward_get_sc_alloc_reward_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_compose_sc.has_info
	 */
	struct Ump_enchant_stone_compose_sc_has_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_compose_sc.get_info
	 */
	struct Ump_enchant_stone_compose_sc_get_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_compose_sc.alloc_info
	 */
	struct Ump_enchant_stone_compose_sc_alloc_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_equip_sc.has_update_info
	 */
	struct Ump_enchant_stone_equip_sc_has_update_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_equip_sc.has_info
	 */
	struct Ump_enchant_stone_equip_sc_has_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_equip_sc.get_update_info
	 */
	struct Ump_enchant_stone_equip_sc_get_update_info_Params
	{
	public:
		struct Fmps_enchant_stone_update                           ReturnValue;                                             // 0x0000(0x0018)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_equip_sc.get_info
	 */
	struct Ump_enchant_stone_equip_sc_get_info_Params
	{
	public:
		struct Fmps_item_update                                    ReturnValue;                                             // 0x0000(0x0020)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_equip_sc.alloc_update_info
	 */
	struct Ump_enchant_stone_equip_sc_alloc_update_info_Params
	{
	public:
		struct Fmps_enchant_stone_update                           ReturnValue;                                             // 0x0000(0x0018)  (Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_equip_sc.alloc_info
	 */
	struct Ump_enchant_stone_equip_sc_alloc_info_Params
	{
	public:
		struct Fmps_item_update                                    ReturnValue;                                             // 0x0000(0x0020)  (Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_slot_open_sc.has_info
	 */
	struct Ump_enchant_stone_slot_open_sc_has_info_Params
	{
	public:
		bool                                                       ReturnValue;                                             // 0x0000(0x0001)  (ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_slot_open_sc.get_info
	 */
	struct Ump_enchant_stone_slot_open_sc_get_info_Params
	{
	public:
		struct Fmps_item_add                                       ReturnValue;                                             // 0x0000(0x0048)  (ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NativeAccessSpecifierPublic)
	};

	/**
	 * Function ProtocolPlugins.mp_enchant_stone_slot_open_sc.alloc_info
	 */
	struct Ump_enchant_stone_slot_open_sc_alloc_info_Params
	{
	public:
